{
  "manuscript_metadata": {
    "title": "Novel base predictive model of resilient modulus of compacted subgrade soils by using interpretable approaches with graphical user interface",
    "doi": "10.1016/j.mtcomm.2024.109764",
    "authors": [
      "Loai Alkhattabi",
      "Kiran Arif"
    ],
    "abstract": "The flexible pavement system consists of layers that are made up of a blend of aggregates and bitumen. To design flexible pavement systems that are both safe and environmentally sustainable, it is essential to have an accurate understanding of the resilient modulus (Mr) of the compacted subgrade soil. Mr refers to the ability of the soil to resist deformation under repeated loads. Thus, a critical parameter affects the performance and longevity of pavement systems. This study employs machine learning (ML) algorithms such as individual and ensemble learners using an extensive database of 2813 data points. These include dry unit weight, weighted plasticity index, confining stress, deviator stress, moisture content, and the number of freeze-thaw cycles (FT). The individual or weak learners were incorporated to create strong and robust ensemble learners by employing techniques such as bagging, adaptive boosting, and random forest (RF). Ensemble learning methods were used to improve the performance of individual learners, such as support vector machine (SVM) and decision tree (DT), by combining their predictions. To achieve the highest R2 value, a total of twenty bagging and boosting sub-models were trained and optimized. The validation of the test data was carried out through K-Fold cross-validation, utilizing metrics such as R2, MAE, and RMSE. The developed models were rigorously tested using statistical indices (MAE, MSE, RMSE, and RMLSE) to verify their predictive accuracy, reliability, and trustworthiness. The findings indicate that the integration of bagging and boosting techniques improves the efficiency of individual machine learning (ML) models. The combination of RF and DT utilizing bagging resulted in the most reliable performance, achieving an R2 value of 0.9 and demonstrating minimum errors. In general, the implementation of the ensemble algorithm in ML improved the overall prediction accuracy of the model. Sensitivity analysis reveals that the prediction of the resilient modulus (Mr) of the subgrade is primarily influenced by dry density, confining stress, and deviator stress. Moreover, a graphical user interface (GUI) is developed for practical implantation."
  },
  "citations_in_text": [
    {
      "marker": "[1 – 3]",
      "context_window": "The pavement system consists of several layers having different material properties. These layers typically include the surface, base, subbase, and subgrade [1 – 3] . The strength and stiffness of these layers play an important role in designing the pavement system [4 – 6] ."
    },
    {
      "marker": "[4 – 6]",
      "context_window": "These layers typically include the surface, base, subbase, and subgrade [1 – 3] . The strength and stiffness of these layers play an important role in designing the pavement system [4 – 6] . The subgrade layer is called the foundation of the pavement system [7] ."
    },
    {
      "marker": "[7]",
      "context_window": "The strength and stiffness of these layers play an important role in designing the pavement system [4 – 6] . The subgrade layer is called the foundation of the pavement system [7] . It transfers applied loads to the ground."
    },
    {
      "marker": "[8]",
      "context_window": "It transfers applied loads to the ground. However, seasonal fluctuations and cyclic or dynamic loads on pavement layers cause stresses in these layers [8] . Moreover, the primary support for all pavements is due to the underlying subgrade layer."
    },
    {
      "marker": "[9]",
      "context_window": "Moreover, the primary support for all pavements is due to the underlying subgrade layer. This layer typically consists of varying soil combinations is considered as the fundamental base of the pavement structure, and is responsible for transferring applied loads to the ground [9] . Thus, resilient modulus (Mr) serves as a vital parameter for assessing subgrade material’s behaviour under various environmental and load conditions [10 – 13] ."
    },
    {
      "marker": "[10 – 13]",
      "context_window": "This layer typically consists of varying soil combinations is considered as the fundamental base of the pavement structure, and is responsible for transferring applied loads to the ground [9] . Thus, resilient modulus (Mr) serves as a vital parameter for assessing subgrade material’s behaviour under various environmental and load conditions [10 – 13] . Additionally, it explains the material’s inelastic response to traffic loads."
    },
    {
      "marker": "[12]",
      "context_window": "Additionally, it explains the material’s inelastic response to traffic loads. As pavement layers endure repetitive traffic loads, the subgrade soil undergoes both reversible and irreversible strains with each load cycle [12] . With an increasing number of load repetitions, the extent of plastic deformation diminishes until it becomes recoverable."
    },
    {
      "marker": "[14 – 17]",
      "context_window": "The Mr of the soil has a direct relationship with both fatigue cracking and permanent deformation. Hence, considered an essential property for understanding pavement behaviour and its design [14 – 17] . The Mr of compacted pavement subgrade soils depends upon multiple factors."
    },
    {
      "marker": "[12]",
      "context_window": "The Mr of compacted pavement subgrade soils depends upon multiple factors. These factors encompass a range of characteristics and conditions that affect the soil’s ability to withstand and recover from applied loads [12] . Some key factors include the soil’s composition, density, moisture content, stress history, temperature, and loading frequency [18 – 20] ."
    },
    {
      "marker": "[18 – 20]",
      "context_window": "These factors encompass a range of characteristics and conditions that affect the soil’s ability to withstand and recover from applied loads [12] . Some key factors include the soil’s composition, density, moisture content, stress history, temperature, and loading frequency [18 – 20] . Each of these factors contributes to the overall resilient modulus of the subgrade soils and plays a significant role in determining their response to traffic loading and subsequent pavement performance [21] ."
    },
    {
      "marker": "[21]",
      "context_window": "Some key factors include the soil’s composition, density, moisture content, stress history, temperature, and loading frequency [18 – 20] . Each of these factors contributes to the overall resilient modulus of the subgrade soils and plays a significant role in determining their response to traffic loading and subsequent pavement performance [21] . Moreover, the seasonal environmental effects are also important in regions with seasonal freezing."
    },
    {
      "marker": "[22 – 24]",
      "context_window": "Typically, subgrade soils are compacted at their maximum dry unit weight and optimal moisture content. The moisture content can vary seasonally due to environmental factors, such as precipitation, surface infiltration, plant transpiration, evaporation, temperature fluctuation, and groundwater table variation [22 – 24] . In regions where seasonal freezing occurs, FT cycles can cause substantial harm to pavements."
    },
    {
      "marker": "[25]",
      "context_window": "In regions where seasonal freezing occurs, FT cycles can cause substantial harm to pavements. Thus, resulting in pavement surface spalling and cracking [25] . This can also lead to severe settlement caused by the influx of water during the spring thaw."
    },
    {
      "marker": "[26]",
      "context_window": "The Mr and strength of pavement materials degrade during FT processes. This results in a significant increase in tensile strain on the surface layer of the pavement when subjected to traffic loading [26] . Moreover, the increase in tensile strain can cause fatigue cracks to form on the pavement surface, which can lead to further damage if left unaddressed."
    },
    {
      "marker": "[27 – 30]",
      "context_window": "Furthermore, when pavement materials experience desiccation (drying out) and thermal shrinkage (reduction in volume due to temperature changes), longitudinal and transverse cracks may appear. The Mr refers to a measure of the elastic modulus (EM) that defines the non-linear stress-strain properties of subgrade materials [27 – 30] . This is an important factor in the structural response of pavements."
    },
    {
      "marker": "[31 – 33]",
      "context_window": "M r considers the effects of various stress states, including traffic loading, confining stress, cyclic stress, and deviator stress. In addition, Mr can be determined through various laboratory testing methods, which include in-situ testing, cyclic tri-axial load testing, resonant column testing, and torsional shear testing [31 – 33] . Despite their effectiveness, these methods are expensive and complex."
    },
    {
      "marker": "[37 – 39]",
      "context_window": "Conversely, k3 must be negative, as an increase in deviator or shear stress results in a softening effect on the material. Finally, a second set of regression analyses is conducted to establish the relationship between these k-coefficients and various soil physical properties, such as moisture content, dry density, plasticity index, liquid limit, coefficient of curvature, uniformity coefficient, and percent passing #200 sieve [37 – 39] . The details on how these models are obtained can be found in previously published literature."
    },
    {
      "marker": "[40 – 42]",
      "context_window": "Therefore, its effectiveness is limited to the range of datasets used in the analysis. Additionally, existing models lack validation and testing on new data [40 – 42] . Given the shortcomings of these models and the intricate behaviour of Mr, there is a need to develop more effective prediction models for estimating Mr in pavement subgrade soils."
    },
    {
      "marker": "[43 – 52]",
      "context_window": "However, accurate prediction is difficult, and more research is required to overcome these challenges. In recent years, neural-based ML techniques have been used to overcome challenges and improve the accuracy of predictions in various applications. [43 – 52] . The use of ML techniques is becoming increasingly popular in civil engineering, particularly in the prediction of mechanical properties of materials like concrete, asphalt, and resilient modulus (Mr) value [53 – 60] ."
    },
    {
      "marker": "[53 – 60]",
      "context_window": "In recent years, neural-based ML techniques have been used to overcome challenges and improve the accuracy of predictions in various applications. [43 – 52] . The use of ML techniques is becoming increasingly popular in civil engineering, particularly in the prediction of mechanical properties of materials like concrete, asphalt, and resilient modulus (Mr) value [53 – 60] . These methods rely heavily on extensive datasets to build accurate models."
    },
    {
      "marker": "[61 – 63]",
      "context_window": "These methods rely heavily on extensive datasets to build accurate models. The success of these models is contingent upon both the quality and quantity of the data used during the model development process [61 – 63] . In other words, having a substantial and high-quality dataset is crucial for the effectiveness of these ML methods [64 – 68] ."
    },
    {
      "marker": "[64 – 68]",
      "context_window": "The success of these models is contingent upon both the quality and quantity of the data used during the model development process [61 – 63] . In other words, having a substantial and high-quality dataset is crucial for the effectiveness of these ML methods [64 – 68] . Javed et al. [47] utilized gene expression programming (GEP) to forecast the compressive strength (CS) of sugarcane bagasse ash (SCBA) concrete."
    },
    {
      "marker": "[47]",
      "context_window": "In other words, having a substantial and high-quality dataset is crucial for the effectiveness of these ML methods [64 – 68] . Javed et al. [47] utilized gene expression programming (GEP) to forecast the compressive strength (CS) of sugarcane bagasse ash (SCBA) concrete. Likewise, Aslam et al. [46] used the GEP approach to predict the strength of high-strength concrete (HSC)."
    },
    {
      "marker": "[46]",
      "context_window": "Javed et al. [47] utilized gene expression programming (GEP) to forecast the compressive strength (CS) of sugarcane bagasse ash (SCBA) concrete. Likewise, Aslam et al. [46] used the GEP approach to predict the strength of high-strength concrete (HSC). Their findings indicated a strong correlation between the predicted values and target values."
    },
    {
      "marker": "[69]",
      "context_window": "Their findings indicated a strong correlation between the predicted values and target values. In addition, researchers have employed artificial neural networks (ANNs) to forecast the strength of concrete made of waste and recycled materials, and their finding reveals that ANNs have shown a strong relationship with fewer errors [69] . Zaman et al. [70] conducted a study exploring the construction of different ANNs."
    },
    {
      "marker": "[70]",
      "context_window": "In addition, researchers have employed artificial neural networks (ANNs) to forecast the strength of concrete made of waste and recycled materials, and their finding reveals that ANNs have shown a strong relationship with fewer errors [69] . Zaman et al. [70] conducted a study exploring the construction of different ANNs. The goal was to establish a relationship between Mr and standard subgrade soil characteristics, along with stress states encountered in pavement design."
    },
    {
      "marker": "[71]",
      "context_window": "The goal was to establish a relationship between Mr and standard subgrade soil characteristics, along with stress states encountered in pavement design. Similarly, Zou et al. [71] employed GEP and ANNs for the estimation of compressed subgrade soils and reported robust results. Deswal and Pal [72] evaluated the performance of two machine-based extreme learning regression models for calculating the resilient modulus (Mr) of cohesive soils."
    },
    {
      "marker": "[72]",
      "context_window": "Similarly, Zou et al. [71] employed GEP and ANNs for the estimation of compressed subgrade soils and reported robust results. Deswal and Pal [72] evaluated the performance of two machine-based extreme learning regression models for calculating the resilient modulus (Mr) of cohesive soils. The author compared their results with those obtained from SVM methods and demonstrated a robust performance by these models."
    },
    {
      "marker": "[73]",
      "context_window": "The author compared their results with those obtained from SVM methods and demonstrated a robust performance by these models. In addition, Sadrossadat et al. [73] used a neuro-fuzzy adaptive interface system to forecast the behaviour of subgrade soils in flexible pavements. ML algorithms are versatile tools that can be utilized to predict a range of responses in various engineering or data science fields, beyond the compressive or tensile nature of concrete."
    },
    {
      "marker": "[74]",
      "context_window": "Moreover, the significance of MLAs in civil engineering domain is illustrate in Fig. 1 . Recently, there has been an increasing inclination towards the adoption of ensemble modelling methods to improve the overall effectiveness of models. This is achieved by combining individual or weak learners to build much stronger predictive learners [74] . Feng et al. [75] used ensemble learning techniques to predict the properties of reinforced concrete (RC) structural elements and observed a strong and robust performance of the models."
    },
    {
      "marker": "[75]",
      "context_window": "This is achieved by combining individual or weak learners to build much stronger predictive learners [74] . Feng et al. [75] used ensemble learning techniques to predict the properties of reinforced concrete (RC) structural elements and observed a strong and robust performance of the models. Bui et al. [76] also used a modified firefly algorithm in combination with an ANN to forecast the behaviour of high-performance concrete (HPC)."
    },
    {
      "marker": "[76]",
      "context_window": "Feng et al. [75] used ensemble learning techniques to predict the properties of reinforced concrete (RC) structural elements and observed a strong and robust performance of the models. Bui et al. [76] also used a modified firefly algorithm in combination with an ANN to forecast the behaviour of high-performance concrete (HPC). The results indicate that the hybrid model performed better and gave a strong performance."
    },
    {
      "marker": "[77]",
      "context_window": "The results indicate that the hybrid model performed better and gave a strong performance. Similarly, Salami et al. [77] utilized the RF approach and achieved a good accuracy of R2 = 0.9867. Cai et al. [78] predicted the penetration of chloride in RC structures located in marine environment using several supervised machine ensemble algorithms."
    },
    {
      "marker": "[78]",
      "context_window": "Similarly, Salami et al. [77] utilized the RF approach and achieved a good accuracy of R2 = 0.9867. Cai et al. [78] predicted the penetration of chloride in RC structures located in marine environment using several supervised machine ensemble algorithms. Halil et al. [58] applied three ensemble modelling techniques, using a decision tree (DT) as the base learner."
    },
    {
      "marker": "[58]",
      "context_window": "Cai et al. [78] predicted the penetration of chloride in RC structures located in marine environment using several supervised machine ensemble algorithms. Halil et al. [58] applied three ensemble modelling techniques, using a decision tree (DT) as the base learner. The hybrid model demonstrated superior predictive performance for HPC strength compared to other models, resulting in a robust R2 value of 0.9368."
    },
    {
      "marker": "[59]",
      "context_window": "The hybrid model demonstrated superior predictive performance for HPC strength compared to other models, resulting in a robust R2 value of 0.9368. In a study conducted by Kermani et al. [59] , the efficiency of five soft computing base learners was systematically assessed with the aim of predicting concrete corrosion in sewer systems. The study incorporated both tree-based and network-based learners."
    },
    {
      "marker": "[79]",
      "context_window": "Moreover, a graphical user interface (GUI) is developed for practical implantation. Data description is an important step in the process of building machine-learning models [79] . It involves thoroughly understanding the dataset and its characteristics before delving into the modelling phase."
    },
    {
      "marker": "[40]",
      "context_window": "Confining concentrations vary from 0 KPa to 41.4 KPa, representing extremes in the dataset. Analyzing the distribution of explanatory variables aids in constructing a generalized model [40] . The dataset’s highest and lowest values illustrate its extremes, while mean, median, and mode serve as indicators of central tendencies."
    },
    {
      "marker": "[61]",
      "context_window": "This statistical metric provides insights into the spread or dispersion of data points, aiding in the understanding of the data’s overall distribution pattern. Skewness and kurtosis evaluate normal probability distribution regularity and profile [61] . Skewness is a statistical metric used to evaluate the asymmetry within a probability distribution, with zero suggesting perfect symmetry, positive values indicating a longer right tail, and negative values a longer left tail."
    },
    {
      "marker": "[62]",
      "context_window": "Positive kurtosis (leptokurtic) suggests a more peaked curve, indicating heavier tails and a distribution with more extreme values than a normal distribution. In contrast, negative kurtosis (platykurtic) suggests a flatter data curve, indicating a distribution with lighter tails compared to a normal distribution [62] . Understanding kurtosis provides valuable insights into the shape and tails of a probability distribution, contributing to a comprehensive analysis of the data’s characteristics."
    },
    {
      "marker": "[80 – 84]",
      "context_window": "It provides a clearer understanding of how changes in input variables relate to changes in output strength, which ultimately helps in making predictions about the mechanical behavior of a system. Currently, numerous industries utilizes machine-learning algorithms (MLAs) to understand and estimate material behaviour [80 – 84] . In this research, various ML-based approaches, namely support vector machines (SVM), decision trees (DT), and random forests (RF), are employed to assess the resilient modules (Mr) of subgrade."
    },
    {
      "marker": "[85 – 87]",
      "context_window": "In this research, various ML-based approaches, namely support vector machines (SVM), decision trees (DT), and random forests (RF), are employed to assess the resilient modules (Mr) of subgrade. These particular techniques were chosen due to their widespread application [85 – 87] . Moreover, the rationale behind in selecting these approaches was driven by their distinctive advantages in handling the complexities."
    },
    {
      "marker": "[88]",
      "context_window": "Moreover, an ensemble learning technique (ELT) is implemented to forecast the strength of Mr. The ensemble learning method combines the predictions from multiple ML models to enhance overall prediction performance [88] . Fig. 5 depicts the comprehensive flow diagram of the ML algorithm process that is used in our research."
    },
    {
      "marker": "[89]",
      "context_window": "Fig. 5 depicts the comprehensive flow diagram of the ML algorithm process that is used in our research. The support vector regression (SVR) technique was first introduced by Vapnik in 1995 [89] . Since then, it has gained widespread use for performing classification, prediction, and regression tasks."
    },
    {
      "marker": "[90 – 92]",
      "context_window": "Since then, it has gained widespread use for performing classification, prediction, and regression tasks. Numerous studies have demonstrated the high learning capacity of SVMs in civil and structural engineering [90 – 92] . The approach utilizes labelled training data to generate support vector machines (SVMs)."
    },
    {
      "marker": "[93]",
      "context_window": "Various mathematical functions, including linear, radial basis, polynomial, or sigmoid functions, are employed during the training of SVM to detect support vectors on the function surface. The selection of the kernel function plays a crucial role in determining the complexity and flexibility of the decision boundary created by the SVM model [93] . Each kernel function has unique properties and is appropriate for different types of data, depending on the data set’s specific characteristics and the modelling task’s requirements."
    },
    {
      "marker": "[94]",
      "context_window": "Moreover, Fig. 6 depicts the standardized SVM for the prediction of the properties. A supervised learning technique used in ML, that constructs a tree-like model to make decisions based on a set of input variables [94] . It is commonly used for classification and regression tasks and has gained widespread popularity."
    },
    {
      "marker": "[43]",
      "context_window": "During the training phase of a decision tree, each input variable is given a unique importance, and an \"inner node\" in the tree splits the input data into multiple classes using a function that is determined at this time. The decision tree algorithm generates the tree by minimizing a fitness function on a given dataset, identifying the optimal tree as illustrated in Fig. 7 [43] . In the absence of classes within the dataset, the algorithm adjusts by constructing a regression model for the dependent variable, taking into account different factors."
    },
    {
      "marker": "[95]",
      "context_window": "When all variables exhibit equal errors at the split point, the algorithm selects the variable with the lowest fitness function values as the decisive split point. Iterating through this process, the algorithm systematically constructs the optimal tree, ensuring a comprehensive evaluation of factors and minimizing errors in the model’s predictive capabilities [95] . Researchers have taken an interest in the RF model because of its classification and regression methodology that is used for predicting the mechanical properties of materials [96] ."
    },
    {
      "marker": "[96]",
      "context_window": "Iterating through this process, the algorithm systematically constructs the optimal tree, ensuring a comprehensive evaluation of factors and minimizing errors in the model’s predictive capabilities [95] . Researchers have taken an interest in the RF model because of its classification and regression methodology that is used for predicting the mechanical properties of materials [96] . Shaqadan et al. [97] utilized the RF regression model to predict the compressive strength (CS) of concrete and noticed a reliable performance."
    },
    {
      "marker": "[97]",
      "context_window": "Researchers have taken an interest in the RF model because of its classification and regression methodology that is used for predicting the mechanical properties of materials [96] . Shaqadan et al. [97] utilized the RF regression model to predict the compressive strength (CS) of concrete and noticed a reliable performance. Unlike DT, which produces only one tree, RF grows multiple trees to form a forest where different data subsets are randomly selected and distributed across each tree as demonstrated in Fig. 8 [97] ."
    },
    {
      "marker": "[97]",
      "context_window": "Shaqadan et al. [97] utilized the RF regression model to predict the compressive strength (CS) of concrete and noticed a reliable performance. Unlike DT, which produces only one tree, RF grows multiple trees to form a forest where different data subsets are randomly selected and distributed across each tree as demonstrated in Fig. 8 [97] . Every tree consists of data arranged in rows and columns with variable dimensions that can be defined."
    },
    {
      "marker": "[54]",
      "context_window": "Choosing the right hyper parameters is vital for obtaining optimal performance when building ML models [54] . In this study, multiple parameter configurations for each algorithm are used based on previous literature [98 – 101] , as shown in Table 4 ."
    },
    {
      "marker": "[98 – 101]",
      "context_window": "Choosing the right hyper parameters is vital for obtaining optimal performance when building ML models [54] . In this study, multiple parameter configurations for each algorithm are used based on previous literature [98 – 101] , as shown in Table 4 . This is done to improve the predictive accuracy of the models."
    }
  ],
  "enriched_references": [
    {
      "ref_id": "[1]",
      "original_data": {
        "ref_id": "[1]",
        "parsed": {
          "title": "Sustainable pavement drainage systems: Subgrade moisture, subsurface drainage methods and drainage effectiveness",
          "authors": [
            "X. Chu",
            "I. Campos-Guereta",
            "A. Dawson",
            "N. Thom"
          ],
          "year": 2023,
          "venue": "Construction and Building Materials",
          "doi": "10.1016/j.conbuildmat.2022.129950"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W4311768396",
        "title": "Sustainable pavement drainage systems: Subgrade moisture, subsurface drainage methods and drainage effectiveness",
        "display_name": "Sustainable pavement drainage systems: Subgrade moisture, subsurface drainage methods and drainage effectiveness",
        "year": 2022,
        "cited_by_count": 29,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.conbuildmat.2022.129950",
        "url": "https://doi.org/10.1016/j.conbuildmat.2022.129950",
        "authors": [
          {
            "display_name": "Xuanxuan Chu"
          },
          {
            "display_name": "Ivan Campos-Guereta"
          },
          {
            "display_name": "Andrew Dawson"
          },
          {
            "display_name": "Nick Thom"
          }
        ],
        "venue": "Construction and Building Materials"
      }
    },
    {
      "ref_id": "[2]",
      "original_data": {
        "ref_id": "[2]",
        "parsed": {
          "title": "Determination of in-field temperature variations in fresh HMA and corresponding compaction temperatures",
          "authors": [
            "A. Hayat",
            "A. Hussain",
            "H.F. Afridi"
          ],
          "year": 2019,
          "venue": "Construction and Building Materials",
          "doi": "10.1016/j.conbuildmat.2019.04.262"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W2944196199",
        "title": "Determination of in-field temperature variations in fresh HMA and corresponding compaction temperatures",
        "display_name": "Determination of in-field temperature variations in fresh HMA and corresponding compaction temperatures",
        "year": 2019,
        "cited_by_count": 24,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.conbuildmat.2019.04.262",
        "url": "https://doi.org/10.1016/j.conbuildmat.2019.04.262",
        "authors": [
          {
            "display_name": "Asif Hayat"
          },
          {
            "display_name": "Arshad Hussain"
          },
          {
            "display_name": "Hassan Farooq Afridi"
          }
        ],
        "venue": "Construction and Building Materials"
      }
    },
    {
      "ref_id": "[3]",
      "original_data": {
        "ref_id": "[3]",
        "parsed": {
          "title": "In-Time Density Monitoring of In-Place Asphalt Layer Construction via Intelligent Compaction Technology",
          "authors": [
            "W. Zhang",
            "K.N. Ahmad",
            "Z. Tong",
            "Z. Hu",
            "H. Wang",
            "M. Wu",
            "K. Zhao",
            "S. Yang",
            "H. Farooq",
            "L.N. Mohammad"
          ],
          "year": 2023,
          "venue": "Journal of Materials in Civil Engineering",
          "doi": "10.1061/(asce)mt.1943-5533.0004558"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W4307750324",
        "title": "In-Time Density Monitoring of In-Place Asphalt Layer Construction via Intelligent Compaction Technology",
        "display_name": "In-Time Density Monitoring of In-Place Asphalt Layer Construction via Intelligent Compaction Technology",
        "year": 2022,
        "cited_by_count": 13,
        "is_retracted": false,
        "abstract": "Intelligent compaction (IC) has been successfully used for soil and base compaction of highways. However, the application of IC technology to monitor the construction quality of asphalt pavement faces complications with compaction processing. This study monitored the compaction process of asphalt layers using an IC-based method. The compaction data were first collected during the construction of a local road in Mardan, Pakistan, including IC data, in-place density, and temperature at the asphalt layer surface. The collected IC data were then used to compute the intelligent compaction measurement values (ICMVs). The support vector regression analysis was performed to predict the roller amplitude and in-place density using the ICMVs. To explore the correlations in compaction measuring/monitoring indicators, this study also explored the correlations between the ICMVs with core density, temperature, and amplitude. Experiment results indicated that the predicted roller amplitude values from the support vector regression model were close to the measured ones. There were high correlations between the roller amplitudes and temperatures with the compaction measurement values (CMVs). In contrast, the correlation between the in-place core densities and CMV values was low. Additionally, the CMVs of the backward pass were higher than the forward one in each compaction cycle because the pavement density increased and the air void decreased after each forward pass.",
        "doi": "https://doi.org/10.1061/(asce)mt.1943-5533.0004558",
        "url": "https://doi.org/10.1061/(asce)mt.1943-5533.0004558",
        "authors": [
          {
            "display_name": "Weiguang Zhang"
          },
          {
            "display_name": "Kamal Nasir Ahmad"
          },
          {
            "display_name": "Wei He"
          },
          {
            "display_name": "Zhaoguang Hu"
          },
          {
            "display_name": "Haoyang Wang"
          },
          {
            "display_name": "Meng Wu"
          },
          {
            "display_name": "Kai Zhao"
          },
          {
            "display_name": "Shunxin Yang"
          },
          {
            "display_name": "Syed Hassan Farooq"
          },
          {
            "display_name": "Louay N. Mohammad"
          }
        ],
        "venue": "Journal of Materials in Civil Engineering"
      }
    },
    {
      "ref_id": "[4]",
      "original_data": {
        "ref_id": "[4]",
        "parsed": {
          "title": "Sustainable re-use of waste glass, cement and lime treated dredged material as pavement material",
          "authors": [
            "G. Bilgen",
            "O.F. Altuntas"
          ],
          "year": 2023,
          "venue": "Case Studies in Construction Materials",
          "doi": "10.1016/j.cscm.2022.e01815"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W4313369205",
        "title": "Sustainable re-use of waste glass, cement and lime treated dredged material as pavement material",
        "display_name": "Sustainable re-use of waste glass, cement and lime treated dredged material as pavement material",
        "year": 2022,
        "cited_by_count": 29,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.cscm.2022.e01815",
        "url": "https://doi.org/10.1016/j.cscm.2022.e01815",
        "authors": [
          {
            "display_name": "Gamze Bilgen"
          },
          {
            "display_name": "Ömer Faruk ALTUNTAŞ"
          }
        ],
        "venue": "Case Studies in Construction Materials"
      }
    },
    {
      "ref_id": "[5]",
      "original_data": {
        "ref_id": "[5]",
        "parsed": {
          "title": "Self-Healing Characteristics of Polyvinyl Alcohol-Fiber-Reinforced Hot Mix Asphalt for Enhanced Pavement Durability",
          "authors": [
            "H.F. Afridi",
            "M.J. Khattak"
          ],
          "year": 2024,
          "venue": "Transportation Research Record",
          "doi": "10.1177/03611981241231969"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4394890951",
        "title": "Self-Healing Characteristics of Polyvinyl Alcohol-Fiber-Reinforced Hot Mix Asphalt for Enhanced Pavement Durability",
        "display_name": "Self-Healing Characteristics of Polyvinyl Alcohol-Fiber-Reinforced Hot Mix Asphalt for Enhanced Pavement Durability",
        "year": 2024,
        "cited_by_count": 6,
        "is_retracted": false,
        "abstract": "Pavement maintenance presents significant financial challenges, driving researchers to explore innovative approaches that can prolong pavement service life and reduce costly interventions. The objective of this research is to examine the feasibility of utilizing polyvinyl alcohol (PVA) fibers to self-heal asphalt pavements. A comprehensive mechanical testing strategy was developed to evaluate the self-healing capability of several hot mix asphalt (HMA) mixtures at the micro- and macro-level. Moreover, to assess the healing behavior of macro fractures in PVA-fiber-reinforced HMA, semi-circular bending (SCB) specimens were loaded until peak load and then allowed to heal at varying time intervals and temperatures for several loading cycles. Healing indices developed based on SCB stiffness, strength, and beam fatigue technique were utilized to measure the self-healing ability of control and reinforced mixtures. By comparing different concentrations of PVA fibers with a control HMA, the optimal fiber dosage was determined based on newly developed healing indices. This study also investigated the impact of healing time and different temperatures on healing. The results demonstrated that PVA fibers expedited the healing process, effectively healing macro-, meso-, and micro-cracks. The most effective recovery occurred with 0.3% fiber content at 40°C for a 2 h duration. Incorporating PVA fibers into asphalt pavements presents a promising solution for extending pavement service life and can be helpful in reducing maintenance costs.",
        "doi": "https://doi.org/10.1177/03611981241231969",
        "url": "https://doi.org/10.1177/03611981241231969",
        "authors": [
          {
            "display_name": "Hassan Farooq Afridi"
          },
          {
            "display_name": "Muhammad Jamal Khattak"
          }
        ],
        "venue": "Transportation Research Record Journal of the Transportation Research Board"
      }
    },
    {
      "ref_id": "[6]",
      "original_data": {
        "ref_id": "[6]",
        "parsed": {
          "title": "Fluid Inverse Volumetric Modeling and Applications from Surface Motion",
          "authors": [
            "X. Xie",
            "Y. Gao",
            "F. Hou",
            "T. Cheng",
            "A. Hao",
            "H. Qin"
          ],
          "year": 2024,
          "venue": "IEEE Transactions on Visualization and Computer Graphics",
          "doi": "10.1109/TVCG.2024.3370551"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4392251610",
        "title": "Fluid Inverse Volumetric Modeling and Applications From Surface Motion",
        "display_name": "Fluid Inverse Volumetric Modeling and Applications From Surface Motion",
        "year": 2024,
        "cited_by_count": 52,
        "is_retracted": false,
        "abstract": "In this study, we devise a framework for volumetrically reconstructing fluid from observable, measurable free surface motion. Our innovative method amalgamates the benefits of deep learning and conventional simulation to preserve the guiding motion and temporal coherence of the reproduced fluid. We infer surface velocities by encoding and decoding spatiotemporal features of surface sequences, and a 3D CNN is used to generate the volumetric velocity field, which is then combined with 3D labels of obstacles and boundaries. Concurrently, we employ a network to estimate the fluid's physical properties. To progressively evolve the flow field over time, we input the reconstructed velocity field and estimated parameters into the physical simulator as the initial state. Our approach yields promising results for both synthetic fluid generated by different fluid solvers and captured real fluid. The developed framework naturally lends itself to a variety of graphics applications, such as 1) effective reproductions of fluid behaviors visually congruent with the observed surface motion, and 2) physics-guided re-editing of fluid scenes. Extensive experiments affirm that our novel method surpasses state-of-the-art approaches for 3D fluid inverse modeling and animation in graphics.",
        "doi": "https://doi.org/10.1109/tvcg.2024.3370551",
        "url": "https://doi.org/10.1109/tvcg.2024.3370551",
        "authors": [
          {
            "display_name": "Xueguang Xie"
          },
          {
            "display_name": "Yang Gao"
          },
          {
            "display_name": "Fei Hou"
          },
          {
            "display_name": "Tianwei Cheng"
          },
          {
            "display_name": "Aimin Hao"
          },
          {
            "display_name": "Hong Qin"
          }
        ],
        "venue": "IEEE Transactions on Visualization and Computer Graphics"
      }
    },
    {
      "ref_id": "[7]",
      "original_data": {
        "ref_id": "[7]",
        "parsed": {
          "title": "Moisture influence on structural responses of pavement on expansive soils",
          "authors": [
            "D. Sarker",
            "J.X. Wang"
          ],
          "year": 2022,
          "venue": "Transportation Geotechnics",
          "doi": "10.1016/j.trgeo.2022.100773"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4224442681",
        "title": "Moisture influence on structural responses of pavement on expansive soils",
        "display_name": "Moisture influence on structural responses of pavement on expansive soils",
        "year": 2022,
        "cited_by_count": 18,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.trgeo.2022.100773",
        "url": "https://doi.org/10.1016/j.trgeo.2022.100773",
        "authors": [
          {
            "display_name": "Debojit Sarker"
          },
          {
            "display_name": "Jay X. Wang"
          }
        ],
        "venue": "Transportation Geotechnics"
      }
    },
    {
      "ref_id": "[8]",
      "original_data": {
        "ref_id": "[8]",
        "parsed": {
          "title": "Thermal fatigue and cracking behaviors of asphalt mixtures under different temperature variations",
          "authors": [
            "Y. Luo",
            "H. Wu",
            "W. Song",
            "J. Yin",
            "Y. Zhan",
            "J. Yu",
            "S. Abubakar Wada"
          ],
          "year": 2023,
          "venue": "Construction and Building Materials",
          "doi": "10.1016/j.conbuildmat.2023.130623"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4319348740",
        "title": "Thermal fatigue and cracking behaviors of asphalt mixtures under different temperature variations",
        "display_name": "Thermal fatigue and cracking behaviors of asphalt mixtures under different temperature variations",
        "year": 2023,
        "cited_by_count": 66,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.conbuildmat.2023.130623",
        "url": "https://doi.org/10.1016/j.conbuildmat.2023.130623",
        "authors": [
          {
            "display_name": "Yao Luo"
          },
          {
            "display_name": "Hao Wu"
          },
          {
            "display_name": "Weimin Song"
          },
          {
            "display_name": "Jian Yin"
          },
          {
            "display_name": "Yiqun Zhan"
          },
          {
            "display_name": "Jia Yu"
          },
          {
            "display_name": "Surajo Abubakar Wada"
          }
        ],
        "venue": "Construction and Building Materials"
      }
    },
    {
      "ref_id": "[9]",
      "original_data": {
        "ref_id": "[9]",
        "parsed": {
          "title": "Application of coal fly ash in pavement subgrade stabilisation: A review",
          "authors": [
            "Z. Zimar",
            "D. Robert",
            "A. Zhou",
            "F. Giustozzi",
            "S. Setunge",
            "J. Kodikara"
          ],
          "year": 2022,
          "venue": "Journal of Environmental Management",
          "doi": "10.1016/j.jenvman.2022.114926"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4221043337",
        "title": "Application of coal fly ash in pavement subgrade stabilisation: A review",
        "display_name": "Application of coal fly ash in pavement subgrade stabilisation: A review",
        "year": 2022,
        "cited_by_count": 113,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.jenvman.2022.114926",
        "url": "https://doi.org/10.1016/j.jenvman.2022.114926",
        "authors": [
          {
            "display_name": "Z. Zimar"
          },
          {
            "display_name": "Dilan Robert"
          },
          {
            "display_name": "Annan Zhou"
          },
          {
            "display_name": "Filippo Giustozzi"
          },
          {
            "display_name": "Sujeeva Setunge"
          },
          {
            "display_name": "Jayantha Kodikara"
          }
        ],
        "venue": "Journal of Environmental Management"
      }
    },
    {
      "ref_id": "[10]",
      "original_data": {
        "ref_id": "[10]",
        "parsed": {
          "title": "A novel approach for resilient modulus prediction using extreme learning machine-equilibrium optimiser techniques",
          "authors": [
            "A.R. Gabr",
            "B. Roy",
            "M.R. Kaloop",
            "D. Kumar",
            "A. Arisha",
            "M. Shiha",
            "S. Shwally",
            "J.W. Hu",
            "S.M. El-Badawy"
          ],
          "year": 2022,
          "venue": "International Journal of Pavement Engineering",
          "doi": "10.1080/10298436.2021.1892109"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W3136991952",
        "title": "A novel approach for resilient modulus prediction using extreme learning machine-equilibrium optimiser techniques",
        "display_name": "A novel approach for resilient modulus prediction using extreme learning machine-equilibrium optimiser techniques",
        "year": 2021,
        "cited_by_count": 11,
        "is_retracted": false,
        "abstract": "This study presents a novel hybrid intelligent approach using Extreme Learning Machine (ELM) and Equilibrium Optimiser (EO) (ELM-EO) for predicting resilient modulus, Mr of Unbound Granular Materials (UGMs). Fourteen various blends of Recycled Concrete Aggregate (RCA) with Recycled Clay Masonry (RCM), and Electric Arc Furnace Steel (EAFS) slag with limestone aggregates were tested in the laboratory using routine and advanced tests. The laboratory Mr testing produced 224 measurements based on the average of triplicate samples for each blend. The performance of the ELM-EO approach was evaluated and compared with conventional regression, ELM-biogeography-based optimisation (BBO) (ELM-BBO) and ELM-genetic algorithm (ELM-GA) approaches using the same input properties. The inputs used for the Mr prediction are the bulk stress, percent of RCM, and/or percent of EAFS. The results demonstrate that the performance of ELM-EO and ELM-BBO approaches is better than ELM-GA and regression approaches for predicting Mr. The overall statistical measures of the proposed approaches show that the ELM-EO approach ranks first as it outperforms the other approaches with coefficient of determination (R2) of 0.924 and Root Mean Square Error (RMSE) of 37.08 MPa.",
        "doi": "https://doi.org/10.1080/10298436.2021.1892109",
        "url": "https://doi.org/10.1080/10298436.2021.1892109",
        "authors": [
          {
            "display_name": "Alaa R. Gabr"
          },
          {
            "display_name": "Bishwajit Roy"
          },
          {
            "display_name": "Mosbeh R. Kaloop"
          },
          {
            "display_name": "Deepak Kumar"
          },
          {
            "display_name": "Ali Arisha"
          },
          {
            "display_name": "Mohamed Shiha"
          },
          {
            "display_name": "Sayed Shwally"
          },
          {
            "display_name": "Jong Wan Hu"
          },
          {
            "display_name": "Sherif M. El-Badawy"
          }
        ],
        "venue": "International Journal of Pavement Engineering"
      }
    },
    {
      "ref_id": "[11]",
      "original_data": {
        "ref_id": "[11]",
        "parsed": {
          "title": "Prediction of CBR and resilient modulus of crushed waste rocks using machine learning models",
          "authors": [
            "S. Hao",
            "T. Pabst"
          ],
          "year": 2022,
          "venue": "Acta Geotechnica",
          "doi": "10.1007/s11440-022-01472-1"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4225667703",
        "title": "Prediction of CBR and resilient modulus of crushed waste rocks using machine learning models",
        "display_name": "Prediction of CBR and resilient modulus of crushed waste rocks using machine learning models",
        "year": 2022,
        "cited_by_count": 37,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1007/s11440-022-01472-1",
        "url": "https://doi.org/10.1007/s11440-022-01472-1",
        "authors": [
          {
            "display_name": "Shengpeng Hao"
          },
          {
            "display_name": "Thomas Pabst"
          }
        ],
        "venue": "Acta Geotechnica"
      }
    },
    {
      "ref_id": "[12]",
      "original_data": {
        "ref_id": "[12]",
        "parsed": {
          "title": "Predicting resilient modulus of flexible pavement foundation using extreme gradient boosting based optimised models",
          "authors": [
            "R. Sarkhani Benemaran",
            "M. Esmaeili-Falak",
            "A. Javadi"
          ],
          "year": 2022,
          "venue": "International Journal of Pavement Engineering",
          "doi": "10.1080/10298436.2022.2095385"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4285043979",
        "title": "Predicting resilient modulus of flexible pavement foundation using extreme gradient boosting based optimised models",
        "display_name": "Predicting resilient modulus of flexible pavement foundation using extreme gradient boosting based optimised models",
        "year": 2022,
        "cited_by_count": 97,
        "is_retracted": false,
        "abstract": "This is the author accepted manuscript. the final version is available from Wiley via the DOI in this record",
        "doi": "https://doi.org/10.1080/10298436.2022.2095385",
        "url": "https://doi.org/10.1080/10298436.2022.2095385",
        "authors": [
          {
            "display_name": "Reza Sarkhani Benemaran"
          },
          {
            "display_name": "Mahzad Esmaeili‐Falak"
          },
          {
            "display_name": "Akbar A. Javadi"
          }
        ],
        "venue": "International Journal of Pavement Engineering"
      }
    },
    {
      "ref_id": "[13]",
      "original_data": {
        "ref_id": "[13]",
        "parsed": {
          "title": "Experiment and Application of NATM Tunnel Deformation Monitoring Based on 3D Laser Scanning",
          "authors": [
            "D. Hu",
            "Y. Li",
            "X. Yang",
            "X. Liang",
            "K. Zhang",
            "X. Liang"
          ],
          "year": 2023,
          "venue": "Structural Control and Health Monitoring",
          "doi": "10.1155/2023/3341788"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4379791055",
        "title": "Experiment and Application of NATM Tunnel Deformation Monitoring Based on 3D Laser Scanning",
        "display_name": "Experiment and Application of NATM Tunnel Deformation Monitoring Based on 3D Laser Scanning",
        "year": 2023,
        "cited_by_count": 55,
        "is_retracted": false,
        "abstract": "In recent years, 3D laser scanning technology has been applied to tunnel engineering. Although more intelligent than traditional measurement technology, it is still challenging to estimate the real-time deformation of NATM tunnel excavation from laser detection and ranging point clouds. To further improve the measurement accuracy of 3D laser scanning technology in the tunnel construction process, this paper proposes an improved Kriging filtering algorithm. Considering the spatial correlation of the described object, the optimization method of point cloud grid filtering is studied. By analyzing the full-space deformation field of the tunnel lining, the deformation information of the measuring points on the surface of the tunnel lining is extracted. Based on the actual project, through the on-site monitoring comparison test, the three-dimensional laser point cloud data are grid processed and analyzed, and the deformation data obtained from the test are compared with the data measured by traditional methods. The experimental results show that the Kriging filtering algorithm can not only efficiently identify and extract the tunnel profile visualization data but also efficiently and accurately obtain the tunnel deformation. The measurement results obtained by using the proposed technology are in good agreement with those obtained by using traditional monitoring methods. Therefore, tunnel deformation monitoring based on 3D laser scanning technology can better reflect the evolution of the tunnel full-space deformation field under certain environmental conditions and can provide an effective safety warning for tunnel construction.",
        "doi": "https://doi.org/10.1155/2023/3341788",
        "url": "https://doi.org/10.1155/2023/3341788",
        "authors": [
          {
            "display_name": "Da Hu"
          },
          {
            "display_name": "Yongsuo Li"
          },
          {
            "display_name": "Xian Yang"
          },
          {
            "display_name": "Xiaoqiang Liang"
          },
          {
            "display_name": "Ke-neng Zhang"
          },
          {
            "display_name": "Xiaodong Liang"
          }
        ],
        "venue": "Structural Control and Health Monitoring"
      }
    },
    {
      "ref_id": "[14]",
      "original_data": {
        "ref_id": "[14]",
        "parsed": {
          "title": "Developing Resilient Modulus Prediction Models Based on Experimental Results of Crushed Hornfels Mixes with Different Gradations and Plasticity",
          "authors": [
            "A. Fouad",
            "R. Hassan",
            "A. Mahmood"
          ],
          "year": 2022,
          "venue": "International Journal of Pavement Research and Technology",
          "doi": "10.1007/s42947-021-00005-5"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W3165201728",
        "title": "Developing Resilient Modulus Prediction Models Based on Experimental Results of Crushed Hornfels Mixes with Different Gradations and Plasticity",
        "display_name": "Developing Resilient Modulus Prediction Models Based on Experimental Results of Crushed Hornfels Mixes with Different Gradations and Plasticity",
        "year": 2021,
        "cited_by_count": 4,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1007/s42947-021-00005-5",
        "url": "https://doi.org/10.1007/s42947-021-00005-5",
        "authors": [
          {
            "display_name": "Ali Fouad"
          },
          {
            "display_name": "Rayya Hassan"
          },
          {
            "display_name": "Abdulrahman Mahmood"
          }
        ],
        "venue": "International Journal of Pavement Research and Technology"
      }
    },
    {
      "ref_id": "[15]",
      "original_data": {
        "ref_id": "[15]",
        "parsed": {
          "title": "Machine learning-based prediction of resilient modulus for blends of tire-derived aggregates and demolition wastes",
          "authors": [
            "B. Ghorbani",
            "E. Yaghoubi",
            "P.L.P. Wasantha",
            "R. van Staden",
            "M. Guerrieri",
            "S. Fragomeni"
          ],
          "year": 2023,
          "venue": "Road Materials and Pavement Design",
          "doi": "10.1080/14680629.2023.2222176"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4381890949",
        "title": "Machine learning-based prediction of resilient modulus for blends of tire-derived aggregates and demolition wastes",
        "display_name": "Machine learning-based prediction of resilient modulus for blends of tire-derived aggregates and demolition wastes",
        "year": 2023,
        "cited_by_count": 8,
        "is_retracted": false,
        "abstract": "AbstractAlthough numerous studies have been undertaken to examine the potential of C&D wastes in pavement structures, limited research to date has developed constitutive models for the resilient modulus (Mr) of C&D wastes. In this study, machine learning algorithms: artificial neural network (ANN); Support Vector Regression (SVR); and Random Forest Regression (RFR) were utilised for estimating the Mr of C&D wastes blended with tire-derived aggregate (TDA). A database of repeated load triaxial test results on C&D/TDA blends including stress-state parameters, Mr values and other influential parameters on the Mr such as physical properties of the blends, as well as the California bearing ratio (CBR) test results was utilised for developing the machine learning models. The predictive performance of the developed algorithms was assessed using statistical indices and several validation stages. The results exhibited the robustness of machine learning algorithms used for predicting the Mr of C&D/TDA wastes, with R2train, R2test, MAPEtrain, MAPEtest between 0.996–0.997, 0.911–0.997, 0.037–0.068, and 0.037–0.067, respectively. The sensitivity analysis results indicated that the optimum moisture content and CBR had the highest impacts on the Mr of C&D/TDA blends.KEYWORDS: Demolition wastespavement geotechnicsresilient modulusmachine learningtire derived aggregates Disclosure statementNo potential conflict of interest was reported by the author(s).Additional informationFundingThis work was supported by the State Government of Victoria.",
        "doi": "https://doi.org/10.1080/14680629.2023.2222176",
        "url": "https://doi.org/10.1080/14680629.2023.2222176",
        "authors": [
          {
            "display_name": "Behnam Ghorbani"
          },
          {
            "display_name": "Ehsan Yaghoubi"
          },
          {
            "display_name": "P.L.P. Wasantha"
          },
          {
            "display_name": "Rudi van Staden"
          },
          {
            "display_name": "Maurice Guerrieri"
          },
          {
            "display_name": "Sam Fragomeni"
          }
        ],
        "venue": "Road Materials and Pavement Design"
      }
    },
    {
      "ref_id": "[16]",
      "original_data": {
        "ref_id": "[16]",
        "parsed": {
          "title": "Developing Prediction Equations for Soil Resilient Modulus Using Evolutionary Machine Learning",
          "authors": [
            "L. Sadik"
          ],
          "year": 2023,
          "venue": "Transportation Infrastructure Geotechnology",
          "doi": "10.1007/s40515-023-00342-x"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4387670115",
        "title": "Developing Prediction Equations for Soil Resilient Modulus Using Evolutionary Machine Learning",
        "display_name": "Developing Prediction Equations for Soil Resilient Modulus Using Evolutionary Machine Learning",
        "year": 2023,
        "cited_by_count": 32,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1007/s40515-023-00342-x",
        "url": "https://doi.org/10.1007/s40515-023-00342-x",
        "authors": [
          {
            "display_name": "Laith Sadik"
          }
        ],
        "venue": "Transportation Infrastructure Geotechnology"
      }
    },
    {
      "ref_id": "[17]",
      "original_data": {
        "ref_id": "[17]",
        "parsed": {
          "title": "Cardiovascular disease therapeutics via engineered oral microbiota: Applications and perspective",
          "authors": [
            "W. Zhen",
            "Z. Wang",
            "Q. Wang",
            "W. Sun",
            "R. Wang",
            "W. Zhang",
            "Y. Zhang",
            "W. Qin",
            "B. Li",
            "Q. Wang",
            "B. Hong",
            "Y. Yang",
            "J. Xu",
            "S. Ma",
            "M. Da",
            "L. Feng",
            "X. Zang",
            "X. Mo",
            "X. Sun",
            "M. Wu",
            "J. Xu",
            "J. Xu",
            "Y. Huang",
            "H. Zhang"
          ],
          "year": 2024,
          "venue": "IMeta",
          "doi": "10.1002/imt2.197"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4396771810",
        "title": "Cardiovascular disease therapeutics via engineered oral microbiota: Applications and perspective",
        "display_name": "Cardiovascular disease therapeutics via engineered oral microbiota: Applications and perspective",
        "year": 2024,
        "cited_by_count": 69,
        "is_retracted": false,
        "abstract": "Engineering bacteria are considered as a potential treatment for cardiovascular diseases and related risk factors. Oral bacteria are closely related to the occurrence and development of cardiovascular diseases, and their engineering has broad prospects and potential in the treatment of cardiovascular diseases. Oral pathogenic bacteria undergo protein and genetic engineering, including the incorporation of exogenous plasmids to yield therapeutic effects; genetically engineered oral probiotics can be harnessed to secrete cytokines and reactive oxygen species, offering novel therapeutic avenues for cardiovascular diseases.[Image: see text]",
        "doi": "https://doi.org/10.1002/imt2.197",
        "url": "https://doi.org/10.1002/imt2.197",
        "authors": [
          {
            "display_name": "Wenyu Zhen"
          },
          {
            "display_name": "Zifei Wang"
          },
          {
            "display_name": "Qing Wang"
          },
          {
            "display_name": "Wansu Sun"
          },
          {
            "display_name": "Rui Wang"
          },
          {
            "display_name": "Wenhao Zhang"
          },
          {
            "display_name": "Yulong Zhang"
          },
          {
            "display_name": "Wengang Qin"
          },
          {
            "display_name": "Bang Li"
          },
          {
            "display_name": "Qingqing Wang"
          },
          {
            "display_name": "Biao Hong"
          },
          {
            "display_name": "Yicheng Yang"
          },
          {
            "display_name": "Jing Xu"
          },
          {
            "display_name": "Siyu Ma"
          },
          {
            "display_name": "Ming Da"
          },
          {
            "display_name": "Linfei Feng"
          },
          {
            "display_name": "Xiaodong Zang"
          },
          {
            "display_name": "Xuming Mo"
          },
          {
            "display_name": "Xiaoyu Sun"
          },
          {
            "display_name": "Mingyue Wu"
          },
          {
            "display_name": "Junji Xu"
          },
          {
            "display_name": "Jianguang Xu"
          },
          {
            "display_name": "Yuan Huang"
          },
          {
            "display_name": "Hengguo Zhang"
          },
          {
            "display_name": "Jianguang Xu"
          },
          {
            "display_name": "Yuan Huang"
          },
          {
            "display_name": "Hengguo Zhang"
          }
        ],
        "venue": "iMeta"
      }
    },
    {
      "ref_id": "[18]",
      "original_data": {
        "ref_id": "[18]",
        "parsed": {
          "title": "Evaluation of climate effect on resilient modulus of granular subgrade material",
          "authors": [
            "T. Lin",
            "T. Ishikawa",
            "J. Yang",
            "T. Tokoro"
          ],
          "year": 2022,
          "venue": "Cold Regions Science and Technology",
          "doi": "10.1016/j.coldregions.2021.103452"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W3217204925",
        "title": "Evaluation of climate effect on resilient modulus of granular subgrade material",
        "display_name": "Evaluation of climate effect on resilient modulus of granular subgrade material",
        "year": 2021,
        "cited_by_count": 18,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.coldregions.2021.103452",
        "url": "https://doi.org/10.1016/j.coldregions.2021.103452",
        "authors": [
          {
            "display_name": "Tianshu Lin"
          },
          {
            "display_name": "Tatsuya Ishikawa"
          },
          {
            "display_name": "Jiaqiang Yang"
          },
          {
            "display_name": "Tetsuya Tokoro"
          }
        ],
        "venue": "Cold Regions Science and Technology"
      }
    },
    {
      "ref_id": "[19]",
      "original_data": {
        "ref_id": "[19]",
        "parsed": {
          "title": "Resilient modulus estimation using in-situ modulus detector: performance and factors",
          "authors": [
            "S.Y. Kim",
            "D.J. Kim",
            "J.S. Lee",
            "T.H.K. Kang",
            "Y.H. Byun"
          ],
          "year": 2022,
          "venue": "International Journal of Pavement Engineering",
          "doi": "10.1080/10298436.2022.2096883"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4286008078",
        "title": "Resilient modulus estimation using in-situ modulus detector: performance and factors",
        "display_name": "Resilient modulus estimation using in-situ modulus detector: performance and factors",
        "year": 2022,
        "cited_by_count": 10,
        "is_retracted": false,
        "abstract": "The resilient modulus of subgrade should be estimated for pavement designs that undergo repetitive loading from vehicular movement. In this study, an in-situ modulus detector (IMD) with flat, wedge, and cone tips is employed to estimate the resilient modulus. The specimens with three different levels of water content are compacted, and the dynamic responses for two hammer drop heights are analysed. For all specimens, elastic waves are acquired to estimate the shear modulus and Poisson's ratio using bender and piezo-disk elements. The resilient modulus estimated from the IMD is compared with the lightweight deflectometer (LWD) modulus. The experimental results show a stronger relationship between the flat and wedge tips than between the cone and wedge tips. Furthermore, higher drop heights result in strong relationships between the resilient, shear, and LWD moduli. This study proposes an intrinsic design and verification of an IMD for reliable resilient modulus estimation in pavement design.",
        "doi": "https://doi.org/10.1080/10298436.2022.2096883",
        "url": "https://doi.org/10.1080/10298436.2022.2096883",
        "authors": [
          {
            "display_name": "Sang Yeob Kim"
          },
          {
            "display_name": "Dong‐Ju Kim"
          },
          {
            "display_name": "Jong‐Sub Lee"
          },
          {
            "display_name": "Thomas H.‐K. Kang"
          },
          {
            "display_name": "Yong‐Hoon Byun"
          }
        ],
        "venue": "International Journal of Pavement Engineering"
      }
    },
    {
      "ref_id": "[20]",
      "original_data": {
        "ref_id": "[20]",
        "parsed": {
          "title": "Resilient modulus descriptive analysis and estimation for fine-grained soils using multivariate and machine learning methods",
          "authors": [
            "C.C. Ikeagwuani",
            "D.C. Nwonu",
            "C.C. Nweke"
          ],
          "year": 2022,
          "venue": "International Journal of Pavement Engineering",
          "doi": "10.1080/10298436.2021.1895993"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W3136027227",
        "title": "Resilient modulus descriptive analysis and estimation for fine-grained soils using multivariate and machine learning methods",
        "display_name": "Resilient modulus descriptive analysis and estimation for fine-grained soils using multivariate and machine learning methods",
        "year": 2021,
        "cited_by_count": 33,
        "is_retracted": false,
        "abstract": "The adoption of mechanistic-empirical approach to pavement design requires the use of resilient modulus of subgrade soils as a crucial input. The determination of in the laboratory is inexpedient due to the nature of the existing test protocols. This prompted the use of estimated values, which inadvertently has gained popularity lately. However, the accuracy of estimated values is questionable due to spatial variability of soil properties. This necessitated the aggressive search for robust and thorough approaches for predictive modelling of the . In the present study, a systematic approach was adopted for the descriptive analysis and estimation of . from routine soil properties using data from Long-Term Pavement Performance (LTPP) and considering the spatial variability of the soil properties. Descriptive analysis was executed using non-parametric correlation and principal component analysis (PCA), while the estimation was done using three machine learning methods which include gradient boosting regression (GBR), adaptive neuro-fuzzy inference system (ANFIS) and artificial neural network (ANN). Based on the PCA, four factors which explained a total of 77.5% variance in the data had significant influence on the . These include the effect of moisture-induced changes on the soil consistency limits and physical condition, effect of the soil clay content, effect of the soil gradation and effect of the soil stress state. Various factors of the machine learning methods such as the learning rate, number of clusters and number of hidden layers had a significant effect on the prediction accuracy. The three machine learning methods were satisfactory for the prediction based on R2 values which were generally above 0.9. Also, when considering spatial variability of routine soil properties, the GBR and ANFIS have a comparative advantage over the ANN, since they exhibited a high stability in the prediction for both the training and testing dataset.",
        "doi": "https://doi.org/10.1080/10298436.2021.1895993",
        "url": "https://doi.org/10.1080/10298436.2021.1895993",
        "authors": [
          {
            "display_name": "Chijioke Christopher Ikeagwuani"
          },
          {
            "display_name": "Donald Chimobi Nwonu"
          },
          {
            "display_name": "Chukwuebuka C. Nweke"
          }
        ],
        "venue": "International Journal of Pavement Engineering"
      }
    },
    {
      "ref_id": "[21]",
      "original_data": {
        "ref_id": "[21]",
        "parsed": {
          "title": "Laboratory testing and analysis of dynamic and static resilient modulus of subgrade soil under various influencing factors",
          "authors": [
            "X. Liu",
            "X. Zhang",
            "H. Wang",
            "B. Jiang"
          ],
          "year": 2019,
          "venue": "Construction and Building Materials",
          "doi": "10.1016/j.conbuildmat.2018.11.061"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W2901875110",
        "title": "Laboratory testing and analysis of dynamic and static resilient modulus of subgrade soil under various influencing factors",
        "display_name": "Laboratory testing and analysis of dynamic and static resilient modulus of subgrade soil under various influencing factors",
        "year": 2018,
        "cited_by_count": 80,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.conbuildmat.2018.11.061",
        "url": "https://doi.org/10.1016/j.conbuildmat.2018.11.061",
        "authors": [
          {
            "display_name": "Xiaolan Liu"
          },
          {
            "display_name": "Xianmin Zhang"
          },
          {
            "display_name": "Hao Wang"
          },
          {
            "display_name": "Baiyu Jiang"
          }
        ],
        "venue": "Construction and Building Materials"
      }
    },
    {
      "ref_id": "[22]",
      "original_data": {
        "ref_id": "[22]",
        "parsed": {
          "title": "Modeling humidity and stress-dependent subgrade soils in flexible pavements",
          "authors": [
            "J. Peng",
            "J. Zhang",
            "J. Li",
            "Y. Yao",
            "A. Zhang"
          ],
          "year": 2020,
          "venue": "Computers and Geotechnics",
          "doi": "10.1016/j.compgeo.2019.103413"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3000030117",
        "title": "Modeling humidity and stress-dependent subgrade soils in flexible pavements",
        "display_name": "Modeling humidity and stress-dependent subgrade soils in flexible pavements",
        "year": 2020,
        "cited_by_count": 90,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.compgeo.2019.103413",
        "url": "https://doi.org/10.1016/j.compgeo.2019.103413",
        "authors": [
          {
            "display_name": "Junhui Peng"
          },
          {
            "display_name": "Junhui Zhang"
          },
          {
            "display_name": "Jue Li"
          },
          {
            "display_name": "Yongsheng Yao"
          },
          {
            "display_name": "Anshun Zhang"
          }
        ],
        "venue": "Computers and Geotechnics"
      }
    },
    {
      "ref_id": "[23]",
      "original_data": {
        "ref_id": "[23]",
        "parsed": {
          "title": "Rapid estimation of resilient modulus of subgrade soils using performance-related soil properties",
          "authors": [
            "J. Zhang",
            "J. Peng",
            "L. Zeng",
            "J. Li",
            "F. Li"
          ],
          "year": 2021,
          "venue": "International Journal of Pavement Engineering",
          "doi": "10.1080/10298436.2019.1643022"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Mismatch Flagged (Year diff: 2)",
      "external_metadata": {
        "id": "https://openalex.org/W2962745204",
        "title": "Rapid estimation of resilient modulus of subgrade soils using performance-related soil properties",
        "display_name": "Rapid estimation of resilient modulus of subgrade soils using performance-related soil properties",
        "year": 2019,
        "cited_by_count": 87,
        "is_retracted": false,
        "abstract": "This study aims at developing an efficient and accurate methodology to estimate the resilient modulus of subgrade soils. First, a new resilient modulus model incorporating stress dependence and moisture dependence was proposed. Second, prediction models were developed to conveniently and accurately determine model parameters of SWCC and resilient modulus model. In order to characterise the moisture dependence of subgrade soils, the matric suction was added into the proposed model. The matric suction was measured by the pressure plate test and the soil-water characteristic curve (SWCC) was used to determine the matric suction value at any given moisture contents. In order to develop prediction models for model parameters of SWCC and resilient modulus model, the laboratory experiments and multiple regression analysis were conducted on 22 soil samples. A series of performance-related soil properties were measured and used to develop the coefficients prediction models. The developed coefficients prediction models using the performance-related soil properties have high R-squared values and were validated by comparing the measured and predicted values of resilient modulus. Therefore, when the basic physical properties of soils were obtained, the resilient modulus can be predicted for the subgrade soils at any given matric suctions and stress states.",
        "doi": "https://doi.org/10.1080/10298436.2019.1643022",
        "url": "https://doi.org/10.1080/10298436.2019.1643022",
        "authors": [
          {
            "display_name": "Junhui Zhang"
          },
          {
            "display_name": "Junhui Peng"
          },
          {
            "display_name": "Ling Zeng"
          },
          {
            "display_name": "Jue Li"
          },
          {
            "display_name": "Feng Li"
          }
        ],
        "venue": "International Journal of Pavement Engineering"
      }
    },
    {
      "ref_id": "[24]",
      "original_data": {
        "ref_id": "[24]",
        "parsed": {
          "title": "Characterising the resilient behaviour of pavement subgrade with construction and demolition waste under Freeze–Thaw cycles",
          "authors": [
            "J. Zhang",
            "A. Zhang",
            "C. Huang",
            "H. Yu",
            "C. Zhou"
          ],
          "year": 2021,
          "venue": "Journal of Cleaner Production",
          "doi": "10.1016/j.jclepro.2021.126702"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3149311143",
        "title": "Characterising the resilient behaviour of pavement subgrade with construction and demolition waste under Freeze–Thaw cycles",
        "display_name": "Characterising the resilient behaviour of pavement subgrade with construction and demolition waste under Freeze–Thaw cycles",
        "year": 2021,
        "cited_by_count": 77,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.jclepro.2021.126702",
        "url": "https://doi.org/10.1016/j.jclepro.2021.126702",
        "authors": [
          {
            "display_name": "Junhui Zhang"
          },
          {
            "display_name": "Anshun Zhang"
          },
          {
            "display_name": "Chao Huang"
          },
          {
            "display_name": "Huayang Yu"
          },
          {
            "display_name": "Chao Zhou"
          }
        ],
        "venue": "Journal of Cleaner Production"
      }
    },
    {
      "ref_id": "[25]",
      "original_data": {
        "ref_id": "[25]",
        "parsed": {
          "title": "Effect evaluation of freeze-thaw on resilient modulus of unsaturated granular base course material in pavement",
          "authors": [
            "T. Ishikawa",
            "T. Lin",
            "S. Kawabata",
            "S. Kameyama",
            "T. Tokoro"
          ],
          "year": 2019,
          "venue": "Transportation Geotechnics",
          "doi": "10.1016/j.trgeo.2019.100284"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W2974869887",
        "title": "Effect evaluation of freeze-thaw on resilient modulus of unsaturated granular base course material in pavement",
        "display_name": "Effect evaluation of freeze-thaw on resilient modulus of unsaturated granular base course material in pavement",
        "year": 2019,
        "cited_by_count": 41,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.trgeo.2019.100284",
        "url": "https://doi.org/10.1016/j.trgeo.2019.100284",
        "authors": [
          {
            "display_name": "Tatsuya Ishikawa"
          },
          {
            "display_name": "Tianshu Lin"
          },
          {
            "display_name": "Shinichiro Kawabata"
          },
          {
            "display_name": "Shuichi KAMEYAMA"
          },
          {
            "display_name": "Tetsuya Tokoro"
          }
        ],
        "venue": "Transportation Geotechnics"
      }
    },
    {
      "ref_id": "[26]",
      "original_data": {
        "ref_id": "[26]",
        "parsed": {
          "title": "Long-term and immediate effects of freeze–thaw cycles on the resilient modulus of treated expansive subgrades",
          "authors": [
            "A.M. Al-Mahbashi",
            "M. Al-Shamrani"
          ],
          "year": 2023,
          "venue": "Road Materials and Pavement Design",
          "doi": "10.1080/14680629.2022.2146603"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W4310487384",
        "title": "Long-term and immediate effects of freeze–thaw cycles on the resilient modulus of treated expansive subgrades",
        "display_name": "Long-term and immediate effects of freeze–thaw cycles on the resilient modulus of treated expansive subgrades",
        "year": 2022,
        "cited_by_count": 16,
        "is_retracted": false,
        "abstract": "This study aims to investigate the long-term and immediate effects of freeze-thaw (FT) cycles on the resilient modulus (MR) of two different expansive subgrades before and after lime-treatment. The immediate effects were examined by performing MR test (using triaxial dynamic-system) for specimens immediately after applying successive FT cycles. For assessment of long-term effects, the specimens were subjected to 15 FT cycles and then thawing in a humidity room for different recovery periods up to 250 days before commencing MR tests. The results indicated a reduction in MR by about three times due to FT cycles regardless of lime-treatment. This reduction mostly took place after first FT cycle and showed a dependency on FT cycle number. On long-term performance, the reduction was not entirely recovered for all soils, and reducing the designed values of MR is recommended when pavement subgrades are to be subjected to FT cycles even once a year.",
        "doi": "https://doi.org/10.1080/14680629.2022.2146603",
        "url": "https://doi.org/10.1080/14680629.2022.2146603",
        "authors": [
          {
            "display_name": "Ahmed M. Al-Mahbashi"
          },
          {
            "display_name": "Mosleh A. Al‐Shamrani"
          }
        ],
        "venue": "Road Materials and Pavement Design"
      }
    },
    {
      "ref_id": "[27]",
      "original_data": {
        "ref_id": "[27]",
        "parsed": {
          "title": "Resilient Moduli Response of Moderately Cement-Treated Reclaimed Asphalt Pavement Aggregates",
          "authors": [
            "A.J. Puppala",
            "L.R. Hoyos",
            "A.K. Potturi"
          ],
          "year": 2011,
          "venue": "Journal of Materials in Civil Engineering",
          "doi": "10.1061/(asce)mt.1943-5533.0000268"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W2028654367",
        "title": "Resilient Moduli Response of Moderately Cement-Treated Reclaimed Asphalt Pavement Aggregates",
        "display_name": "Resilient Moduli Response of Moderately Cement-Treated Reclaimed Asphalt Pavement Aggregates",
        "year": 2011,
        "cited_by_count": 319,
        "is_retracted": false,
        "abstract": "The use of reclaimed asphalt pavement (RAP) aggregate materials in road construction reduces natural resource depletion and promotes the recycling of RAP materials for other applications. However, product variability and low resilient moduli characteristics often limit RAP applications in road bases. Stabilization of RAP materials with cement was hence attempted in a research study to evaluate the effectiveness of cement treatments in enhancing resilient characteristics of RAP aggregates. The present paper describes the results from a series of resilient modulus tests that were conducted in a laboratory environment using a repeated load triaxial test setup. The effects of three different cement dosages and various confining and deviatoric stress levels on the resilient modulus (MR) response of treated RAP materials were studied. MR values of untreated and cement-treated RAP aggregates ranged from 180 to 340 MPa and 200 to 515 MPa, respectively, which reveal the enhancements with cement treatment. Regression modeling analyses of MR test results, by using two- and three-parameter models, are also presented. The analyses show that both models are reasonably capable of capturing the effects of stress levels on treated RAP resilient properties. Test results were also analyzed to determine structural coefficients for pavement design purposes, which ranged from 0.16 to 0.22, suggesting a greater structural support of cement-treated RAP layers when compared with untreated aggregates.",
        "doi": "https://doi.org/10.1061/(asce)mt.1943-5533.0000268",
        "url": "https://doi.org/10.1061/(asce)mt.1943-5533.0000268",
        "authors": [
          {
            "display_name": "Anand J. Puppala"
          },
          {
            "display_name": "Laureano R. Hoyos"
          },
          {
            "display_name": "Ajay K. Potturi"
          }
        ],
        "venue": "Journal of Materials in Civil Engineering"
      }
    },
    {
      "ref_id": "[28]",
      "original_data": {
        "ref_id": "[28]",
        "parsed": {
          "title": "Fault Detection for Point Machines: A Review, Challenges, and Perspectives",
          "authors": [
            "X. Hu",
            "T. Tang",
            "L. Tan",
            "H. Zhang"
          ],
          "year": 2023,
          "venue": "Actuators",
          "doi": "10.3390/ACT12100391"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4387744525",
        "title": "Fault Detection for Point Machines: A Review, Challenges, and Perspectives",
        "display_name": "Fault Detection for Point Machines: A Review, Challenges, and Perspectives",
        "year": 2023,
        "cited_by_count": 81,
        "is_retracted": false,
        "abstract": "Point machines are the actuators for railway switching and crossing systems that guide trains from one track to another. Hence, the safe and reliable behavior of point machines are pivotal for rail transportation. Recently, scholars and researchers have attempted to deploy various kinds of sensors on point machines for anomaly detection and/or incipient fault detection using date-driven algorithms. However, challenges arise when deploying condition monitoring and fault detection to trackside point machines in practical applications. This article begins by reviewing studies on fault and anomaly detection in point machines, encompassing employed methods and evaluation metrics. It subsequently conducts an in-depth analysis of point machines and outlines the envisioned intelligent fault detection system. Finally, it presents eight challenges and promising research directions along with a blueprint for intelligent point machine fault detection.",
        "doi": "https://doi.org/10.3390/act12100391",
        "url": "https://doi.org/10.3390/act12100391",
        "authors": [
          {
            "display_name": "Xiaoxi Hu"
          },
          {
            "display_name": "Tao Tang"
          },
          {
            "display_name": "Lei Tan"
          },
          {
            "display_name": "Heng Zhang"
          }
        ],
        "venue": "Actuators"
      }
    },
    {
      "ref_id": "[29]",
      "original_data": {
        "ref_id": "[29]",
        "parsed": {
          "title": "Comparison of Constrained Unscented and Cubature Kalman Filters for Nonlinear System Parameter Identification",
          "authors": [
            "J. Cao",
            "S.-T. Quek",
            "H. Xiong",
            "Z. Yang"
          ],
          "year": 2023,
          "venue": "Journal of Engineering Mechanics",
          "doi": "10.1061/jenmdt.emeng-7091"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4386089421",
        "title": "Comparison of Constrained Unscented and Cubature Kalman Filters for Nonlinear System Parameter Identification",
        "display_name": "Comparison of Constrained Unscented and Cubature Kalman Filters for Nonlinear System Parameter Identification",
        "year": 2023,
        "cited_by_count": 34,
        "is_retracted": false,
        "abstract": "Accurate and efficient parameter identification along with uncertainty quantification in nonlinear systems is crucial for enabling practical and reliable structural health monitoring and digital twinning. This paper presents a novel procedure for estimating parameters that combines Bayesian filters and truncated probability density functions (PDFs). To simplify the state-space equations, only model parameters are incorporated in the state equations, whereas the measurement equations are implicitly considered in the state vector of displacement and velocity. This simplification enables the unified implementation of three different types of Bayesian filters: the unscented Kalman filter, third-degree cubature Kalman filter, and fifth-degree cubature Kalman filter. Consequently, it facilitates the seamless integration of complex numerical models into the parameter identification procedure. To improve the robustness of the proposed method, the truncated PDF is employed to enforce constraints that prevent the covariance matrix from becoming singular. The applicability and accuracy of the proposed method were evaluated using a 10-story numerical example and a 12-story shake-table model. Based on the selected parameters for tuning, the estimated results are consistent with both the simulated and experimental data, demonstrating that the Bayesian filters can estimate parameters and quantify their uncertainties. Comparison of the estimation accuracy, computational cost, and efficiency index among the three types of Bayesian filters reveals that the fifth-degree cubature Kalman filter has the highest accuracy. When dealing with less complex structural models, the unscented Kalman filter demonstrates superior efficiency. These findings are useful for finite-element model updating and assessment of structural performance.",
        "doi": "https://doi.org/10.1061/jenmdt.emeng-7091",
        "url": "https://doi.org/10.1061/jenmdt.emeng-7091",
        "authors": [
          {
            "display_name": "Jixing Cao"
          },
          {
            "display_name": "Ser Tong Quek"
          },
          {
            "display_name": "Haibei Xiong"
          },
          {
            "display_name": "Zhenyu Yang"
          }
        ],
        "venue": "Journal of Engineering Mechanics"
      }
    },
    {
      "ref_id": "[30]",
      "original_data": {
        "ref_id": "[30]",
        "parsed": {
          "title": "Predicting the mechanical properties of plastic concrete: An optimization method by using genetic programming and ensemble learners",
          "authors": [
            "U. Asif",
            "M.F. Javed",
            "M. Abuhussain",
            "M. Ali",
            "W.A. Khan",
            "A. Mohamed"
          ],
          "year": 2024,
          "venue": "Case Studies in Construction Materials",
          "doi": "10.1016/j.cscm.2024.e03135"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4394015596",
        "title": "Predicting the mechanical properties of plastic concrete: An optimization method by using genetic programming and ensemble learners",
        "display_name": "Predicting the mechanical properties of plastic concrete: An optimization method by using genetic programming and ensemble learners",
        "year": 2024,
        "cited_by_count": 56,
        "is_retracted": false,
        "abstract": "This study presents a comparative analysis of individual and ensemble learning algorithms (ELAs) to predict the compressive strength (CS) and flexural strength (FS) of plastic concrete. Multilayer perceptron neuron network (MLPNN), Support vector machine (SVM), random forest (RF), and decision tree (DT) were used as base learners, which were then combined with bagging and Adaboost methods to improve the predictive performance. In addition, gene expression programming (GEP) was used to develop computational equations that can be used to predict the CS and FS of plastic concrete. An extensive database containing 357 and 125 data points was obtained from the literature, and the eight most impactful ingredients were used in the model’s development. The accuracy of all models was assessed using several statistical measures, including an error matrix, Akaike information criterion (AIC), K-fold cross-validation, and other external validation equations. Furthermore, sensitivity and SHAP analysis were performed to evaluate input variables' relative significance and impact on the anticipated CS and FS. Based on statistical measures and other validation criteria, GEP outpaces all other individual models, whereas, in ELAs, the SVR ensemble with Adaboost and RF modified with the Bagging technique demonstrated superior performance. SHapley Additive exPlanations (SHAP) and sensitivity analysis reveal that plastic, cement, water, and the age of the specimens have the highest influence, while superplasticizer has the lowest impact, which is consistent with experimental studies. Moreover, GUI and GEP-based simple mathematical correlation can enhance the practical scope of this study and be an effective tool for the pre-mix design of plastic concrete.",
        "doi": "https://doi.org/10.1016/j.cscm.2024.e03135",
        "url": "https://doi.org/10.1016/j.cscm.2024.e03135",
        "authors": [
          {
            "display_name": "Usama Asif"
          },
          {
            "display_name": "Muhammad Faisal Javed"
          },
          {
            "display_name": "Maher Abuhussain"
          },
          {
            "display_name": "Mujahid Ali"
          },
          {
            "display_name": "Waseem Akhtar Khan"
          },
          {
            "display_name": "Abdullah Mohamed"
          }
        ],
        "venue": "Case Studies in Construction Materials"
      }
    },
    {
      "ref_id": "[31]",
      "original_data": {
        "ref_id": "[31]",
        "parsed": {
          "title": "An Experimental and Modeling Investigation on Creep Mechanical Behavior of Granite Under Triaxial Cyclic Loading and Unloading",
          "authors": [
            "S.Q. Yang",
            "J.Z. Tang",
            "S.S. Wang",
            "D.S. Yang",
            "W.T. Zheng"
          ],
          "year": 2022,
          "venue": "Rock Mechanics and Rock Engineering",
          "doi": "10.1007/s00603-022-02920-w"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4283389222",
        "title": "An Experimental and Modeling Investigation on Creep Mechanical Behavior of Granite Under Triaxial Cyclic Loading and Unloading",
        "display_name": "An Experimental and Modeling Investigation on Creep Mechanical Behavior of Granite Under Triaxial Cyclic Loading and Unloading",
        "year": 2022,
        "cited_by_count": 31,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1007/s00603-022-02920-w",
        "url": "https://doi.org/10.1007/s00603-022-02920-w",
        "authors": [
          {
            "display_name": "Sheng‐Qi Yang"
          },
          {
            "display_name": "Jinzhou Tang"
          },
          {
            "display_name": "Susheng Wang"
          },
          {
            "display_name": "Diansen Yang"
          },
          {
            "display_name": "Zheng Wen-tang"
          }
        ],
        "venue": "Rock Mechanics and Rock Engineering"
      }
    },
    {
      "ref_id": "[32]",
      "original_data": {
        "ref_id": "[32]",
        "parsed": {
          "title": "Macro-meso fatigue failure of bimrocks with various block content subjected to multistage fatigue triaxial loads",
          "authors": [
            "Y. Wang",
            "T. Mao",
            "Y. Xia",
            "X. Li",
            "X. Yi"
          ],
          "year": 2022,
          "venue": "International Journal of Fatigue",
          "doi": "10.1016/j.ijfatigue.2022.107014"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4280630337",
        "title": "Macro-meso fatigue failure of bimrocks with various block content subjected to multistage fatigue triaxial loads",
        "display_name": "Macro-meso fatigue failure of bimrocks with various block content subjected to multistage fatigue triaxial loads",
        "year": 2022,
        "cited_by_count": 59,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.ijfatigue.2022.107014",
        "url": "https://doi.org/10.1016/j.ijfatigue.2022.107014",
        "authors": [
          {
            "display_name": "Yu Wang"
          },
          {
            "display_name": "Tianqiao Mao"
          },
          {
            "display_name": "Yingjie Xia"
          },
          {
            "display_name": "Xiao Li"
          },
          {
            "display_name": "Xuefeng Yi"
          }
        ],
        "venue": "International Journal of Fatigue"
      }
    },
    {
      "ref_id": "[33]",
      "original_data": {
        "ref_id": "[33]",
        "parsed": {
          "title": "Effect of the Field-Stress State on the Subgrade Resilient Modulus for Pavement Rutting and IRI",
          "authors": [
            "K.M. Islam",
            "S.L. Gassman"
          ],
          "year": 2023,
          "venue": "Geotechnics",
          "doi": "10.3390/geotechnics3020021"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4377107535",
        "title": "Effect of the Field-Stress State on the Subgrade Resilient Modulus for Pavement Rutting and IRI",
        "display_name": "Effect of the Field-Stress State on the Subgrade Resilient Modulus for Pavement Rutting and IRI",
        "year": 2023,
        "cited_by_count": 3,
        "is_retracted": false,
        "abstract": "The new Mechanistic-Empirical Pavement Design Guide (MEPDG) uses the subgrade resilient modulus (MR) as the key input parameter to represent the subgrade soil behavior for pavement design. The resilient modulus increases with an increase in confining pressure, whereas, for an increase in deviatoric stress, it increases for granular soils and decreases for fine-grained soils. The value of MR is highly stress dependent, with the stress state (i.e., bulk stress) a function of the position of the materials in the pavement structure and applied traffic loading. Applying excessive vertical stress at the top of the subgrade without knowing the appropriate stress state can result in permanent deformation. In situ stress must be calculated so the correct resilient modulus can be determined. To facilitate the implementation of MEPDG, this study develops a methodology to select the appropriate subgrade resilient modulus for predicting rutting and IRI. A comprehensive research methodology was undertaken to study the effect of in situ or undisturbed subgrade MR on pavement performance using the MEPDG. Results show that MR obtained from in situ stress is approximately 1.4 times higher than the MR estimate from NCHRP-285. Thus, the in situ stress significantly affects the calculation of subgrade MR and, subsequently, the use of MR in the predicted rutting, with IRI using the AASHTOWare pavement mechanistic-empirical design. Results also show that the pavement sections were classified as in “Good” and “Fair” conditions for rutting and IRI, respectively, considering in situ MR.",
        "doi": "https://doi.org/10.3390/geotechnics3020021",
        "url": "https://doi.org/10.3390/geotechnics3020021",
        "authors": [
          {
            "display_name": "Kazi Moinul Islam"
          },
          {
            "display_name": "Sarah L. Gassman"
          }
        ],
        "venue": "Geotechnics"
      }
    },
    {
      "ref_id": "[34]",
      "original_data": {
        "ref_id": "[34]",
        "parsed": {
          "title": "DEVELOPMENT OF A CONSTITUTIVE MODEL FOR RESILIENT MODULUS",
          "authors": [
            "M. Dong-Gyou Kim"
          ],
          "year": 2004,
          "venue": null,
          "doi": null
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W2602661404",
        "title": "Development of a constitutive model for resilient modulus of cohesive soils",
        "display_name": "Development of a constitutive model for resilient modulus of cohesive soils",
        "year": 2004,
        "cited_by_count": 19,
        "is_retracted": false,
        "abstract": null,
        "doi": null,
        "url": "http://rave.ohiolink.edu/etdc/view?acc_num=osu1078246971",
        "authors": [
          {
            "display_name": "Dong-Gyou Kim"
          }
        ],
        "venue": "OhioLink ETD Center (Ohio Library and Information Network)"
      }
    },
    {
      "ref_id": "[35]",
      "original_data": {
        "ref_id": "[35]",
        "parsed": {
          "title": "Determination of resilient modulus for Maine roadway soils",
          "authors": [
            "A.L. Smart",
            "D.N. Humphrey"
          ],
          "year": 1999,
          "venue": null,
          "doi": null
        }
      },
      "enrichment_status": "not_found",
      "consistency_status": "Not Checked",
      "external_metadata": {}
    },
    {
      "ref_id": "[36]",
      "original_data": {
        "ref_id": "[36]",
        "parsed": {
          "title": "Prediction models of resilient modulus for nongranular materials",
          "authors": [
            "R. Pezo",
            "W.R. Hudson"
          ],
          "year": 1994,
          "venue": "Geotechnical Testing Journal",
          "doi": "10.1520/gtj10109j"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W2055829062",
        "title": "Prediction Models of Resilient Modulus for Nongranular Materials",
        "display_name": "Prediction Models of Resilient Modulus for Nongranular Materials",
        "year": 1994,
        "cited_by_count": 48,
        "is_retracted": false,
        "abstract": "Abstract This paper describes an experimental program and the analyses performed for the purpose of developing prediction models of resilient modulus for nongranular materials. Two models were developed and are presented herein. The first model provides a quick estimation of the resilient modulus based on basic characteristics of the specimens, while the second model includes a family of curves that relate a normalized modulus to the resilient axial strains and the plasticity index of the specimens. The significance of the second model is corroborated particularly now that moduli measurements obtained from field and laboratory tests can be easily related.",
        "doi": "https://doi.org/10.1520/gtj10109j",
        "url": "https://doi.org/10.1520/gtj10109j",
        "authors": [
          {
            "display_name": "R. Pezo"
          },
          {
            "display_name": "W. Ronald Hudson"
          }
        ],
        "venue": "Geotechnical Testing Journal"
      }
    },
    {
      "ref_id": "[37]",
      "original_data": {
        "ref_id": "[37]",
        "parsed": {
          "title": "Characterizing cyclic and static moduli and strength of compacted pavement subgrade soils considering moisture variation",
          "authors": [
            "Z. Han",
            "S.K. Vanapalli",
            "J. ping Ren",
            "W. lie Zou"
          ],
          "year": 2018,
          "venue": "Soils and Foundations",
          "doi": "10.1016/j.sandf.2018.06.003"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W2884666117",
        "title": "Characterizing cyclic and static moduli and strength of compacted pavement subgrade soils considering moisture variation",
        "display_name": "Characterizing cyclic and static moduli and strength of compacted pavement subgrade soils considering moisture variation",
        "year": 2018,
        "cited_by_count": 32,
        "is_retracted": false,
        "abstract": "Compacted soils are widely used as the subgrade layer for pavements. Knowledge of the mechanical properties of subgrade soils under cyclic and static loading conditions and their variation under the influence of environmental factors is required for the rational design of pavements based on mechanistic methods. This paper presents an experimental investigation of the cyclic and static moduli and the strength properties of seven different compacted Canadian subgrade soils considering the variation in the post-compaction moisture content. Cyclic triaxial tests were performed to reliably determine the resilient modulus (MR). Unconfined compression tests, which allow an unloading-reloading loop at 1% strain, were performed to determine the deviator stress (Su1%) at 1% strain, the reloading elastic modulus (E1%) at 1% strain and the unconfined compressive strength (qu) at failure. The physical properties, the chemical and mineralogical compositions, and the soil-water characteristics of these soils were also determined. Relationships were developed to predict the MR from the Su1%, E1%, qu and soil physical properties for the investigated subgrade soils because the experimental determination of MR is both expensive and time-consuming. The studies presented in this paper provide useful information and approaches that can be used to promote the implementation of mechanistic pavement design methods using simple techniques.",
        "doi": "https://doi.org/10.1016/j.sandf.2018.06.003",
        "url": "https://doi.org/10.1016/j.sandf.2018.06.003",
        "authors": [
          {
            "display_name": "Zhong Han"
          },
          {
            "display_name": "Sai K. Vanapalli"
          },
          {
            "display_name": "Junping Ren"
          },
          {
            "display_name": "Wei-lie Zou"
          }
        ],
        "venue": "SOILS AND FOUNDATIONS"
      }
    },
    {
      "ref_id": "[38]",
      "original_data": {
        "ref_id": "[38]",
        "parsed": {
          "title": "Seismic behavior of a replaceable artificial controllable plastic hinge for precast concrete beam-column joint",
          "authors": [
            "H. Huang",
            "Y. Yuan",
            "W. Zhang",
            "M. Li"
          ],
          "year": 2021,
          "venue": "Engineering Structures",
          "doi": "10.1016/j.engstruct.2021.112848"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3183139758",
        "title": "Seismic behavior of a replaceable artificial controllable plastic hinge for precast concrete beam-column joint",
        "display_name": "Seismic behavior of a replaceable artificial controllable plastic hinge for precast concrete beam-column joint",
        "year": 2021,
        "cited_by_count": 141,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.engstruct.2021.112848",
        "url": "https://doi.org/10.1016/j.engstruct.2021.112848",
        "authors": [
          {
            "display_name": "Hua Huang"
          },
          {
            "display_name": "Yujie Yuan"
          },
          {
            "display_name": "Wei Zhang"
          },
          {
            "display_name": "Ming Li"
          }
        ],
        "venue": "Engineering Structures"
      }
    },
    {
      "ref_id": "[39]",
      "original_data": {
        "ref_id": "[39]",
        "parsed": {
          "title": "End-to-end deep learning model for underground utilities localization using GPR",
          "authors": [
            "Y. Su",
            "J. Wang",
            "D. Li",
            "X. Wang",
            "L. Hu",
            "Y. Yao",
            "Y. Kang"
          ],
          "year": 2023,
          "venue": "Automation in Construction",
          "doi": "10.1016/j.autcon.2023.104776"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4320036601",
        "title": "End-to-end deep learning model for underground utilities localization using GPR",
        "display_name": "End-to-end deep learning model for underground utilities localization using GPR",
        "year": 2023,
        "cited_by_count": 58,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.autcon.2023.104776",
        "url": "https://doi.org/10.1016/j.autcon.2023.104776",
        "authors": [
          {
            "display_name": "Yang Su"
          },
          {
            "display_name": "Jun Wang"
          },
          {
            "display_name": "Danqi Li"
          },
          {
            "display_name": "Xiangyu Wang"
          },
          {
            "display_name": "Lei Hu"
          },
          {
            "display_name": "Yuan Yao"
          },
          {
            "display_name": "Yuanxin Kang"
          }
        ],
        "venue": "Automation in Construction"
      }
    },
    {
      "ref_id": "[40]",
      "original_data": {
        "ref_id": "[40]",
        "parsed": {
          "title": "Prediction of building energy performance using mathematical gene-expression programming for a selected region of dry-summer climate",
          "authors": [
            "M. Alzara",
            "M.F. Rehman",
            "F. Farooq",
            "M. Ali",
            "A.A.A. Beshr",
            "A.M. Yosri",
            "S.B. A El Sayed"
          ],
          "year": 2023,
          "venue": "Engineering Applications of Artificial Intelligence",
          "doi": "10.1016/j.engappai.2023.106958"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4386041982",
        "title": "Prediction of building energy performance using mathematical gene-expression programming for a selected region of dry-summer climate",
        "display_name": "Prediction of building energy performance using mathematical gene-expression programming for a selected region of dry-summer climate",
        "year": 2023,
        "cited_by_count": 31,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.engappai.2023.106958",
        "url": "https://doi.org/10.1016/j.engappai.2023.106958",
        "authors": [
          {
            "display_name": "Majed Alzara"
          },
          {
            "display_name": "Muhammad Faisal Rehman"
          },
          {
            "display_name": "Furqan Farooq"
          },
          {
            "display_name": "Mujahid Ali"
          },
          {
            "display_name": "Ashraf A. A. Beshr"
          },
          {
            "display_name": "Ahmed M. Yosri"
          },
          {
            "display_name": "Sabrina Bintay Sayed"
          }
        ],
        "venue": "Engineering Applications of Artificial Intelligence"
      }
    },
    {
      "ref_id": "[41]",
      "original_data": {
        "ref_id": "[41]",
        "parsed": {
          "title": "Seismic Behavior of Strengthened RC Columns under Combined Loadings",
          "authors": [
            "H. Huang",
            "M. Guo",
            "W. Zhang",
            "M. Huang"
          ],
          "year": 2022,
          "venue": "Journal of Bridge Engineering",
          "doi": "10.1061/(asce)be.1943-5592.0001871"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4220683492",
        "title": "Seismic Behavior of Strengthened RC Columns under Combined Loadings",
        "display_name": "Seismic Behavior of Strengthened RC Columns under Combined Loadings",
        "year": 2022,
        "cited_by_count": 114,
        "is_retracted": false,
        "abstract": "Twenty-five reinforced concrete (RC) columns of section size 250 × 250 mm were designed and tested to study the seismic response considering the effect of loading case, strengthening method, and the predamage level, containing 21 columns reinforced with high-performance ferrocement laminate (HPFL)-bonded steel plates (BSPs), i.e., the intact strengthened columns (ISCs), earthquake-damaged strengthened columns (EDSCs), corrosion-damaged strengthened columns (CSCs) and coupled-predamaged strengthened columns (CPSCs). The bearing capacity of the specimens under the four different types of loading methods is ranked as follows: uniaxial compression–bending–shear (CBS) members, biaxial CBS members, biaxial CBS-torsion (CBST) members, and uniaxial CBST members. Compared with nonstrengthened specimens, the cracks of the strengthened RC columns are more fully developed, and the failure modes have been changed after strengthening. The failure modes and load–deformation curves had little significant difference for the strengthened RC columns with different damage under combined loading levels. The bearing capacity of strengthened RC columns with the applied loading of 400 kN improved, which increased to 60.1%–114.7%, 29.9%–103%, 65.2%–127%, and 49.2%–104.5% for ISCs, EDSCs, CSCs, and CPSCs, respectively. Moreover, the bearing capacity of specimens decreased due to the existence of horizontal eccentricity. Finally, based on the degraded trilinear restoring force model, the strengthened influence coefficient for loading α and displacement β and the torsion influence coefficient for loading γ and displacement ξ were introduced. A modified restoring force model of RC columns was presented, reflecting the loading method, predamage level, and strengthening method. The theoretical calculation values align with the test load–deformation curves, and the mean absolute error is almost less than 15%.",
        "doi": "https://doi.org/10.1061/(asce)be.1943-5592.0001871",
        "url": "https://doi.org/10.1061/(asce)be.1943-5592.0001871",
        "authors": [
          {
            "display_name": "Hua Huang"
          },
          {
            "display_name": "Mengxue Guo"
          },
          {
            "display_name": "Wei Zhang"
          },
          {
            "display_name": "Min Huang"
          }
        ],
        "venue": "Journal of Bridge Engineering"
      }
    },
    {
      "ref_id": "[42]",
      "original_data": {
        "ref_id": "[42]",
        "parsed": {
          "title": "Fractional elastoplastic constitutive model for soils based on a novel 3D fractional plastic flow rule",
          "authors": [
            "D. Lu",
            "J. Liang",
            "X. Du",
            "C. Ma",
            "Z. Gao"
          ],
          "year": 2019,
          "venue": "Computers and Geotechnics",
          "doi": "10.1016/j.compgeo.2018.10.004"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W2898779956",
        "title": "Fractional elastoplastic constitutive model for soils based on a novel 3D fractional plastic flow rule",
        "display_name": "Fractional elastoplastic constitutive model for soils based on a novel 3D fractional plastic flow rule",
        "year": 2018,
        "cited_by_count": 219,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.compgeo.2018.10.004",
        "url": "https://doi.org/10.1016/j.compgeo.2018.10.004",
        "authors": [
          {
            "display_name": "Dechun Lu"
          },
          {
            "display_name": "Jingyu Liang"
          },
          {
            "display_name": "Xiuli Du"
          },
          {
            "display_name": "Chao Ma"
          },
          {
            "display_name": "Zhiwei Gao"
          }
        ],
        "venue": "Computers and Geotechnics"
      }
    },
    {
      "ref_id": "[43]",
      "original_data": {
        "ref_id": "[43]",
        "parsed": {
          "title": "Simulation of depth of wear of eco-friendly concrete using machine learning based computational approaches",
          "authors": [
            "M.A. Khan",
            "F. Farooq",
            "M.F. Javed",
            "A. Zafar",
            "K.A. Ostrowski",
            "F. Aslam",
            "S. Malazdrewicz",
            "M. Ma´slak"
          ],
          "year": 2022,
          "venue": "Materials (Basel)",
          "doi": "10.3390/ma15010058"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W4200470394",
        "title": "Simulation of Depth of Wear of Eco-Friendly Concrete Using Machine Learning Based Computational Approaches",
        "display_name": "Simulation of Depth of Wear of Eco-Friendly Concrete Using Machine Learning Based Computational Approaches",
        "year": 2021,
        "cited_by_count": 82,
        "is_retracted": false,
        "abstract": "To avoid time-consuming, costly, and laborious experimental tests that require skilled personnel, an effort has been made to formulate the depth of wear of fly-ash concrete using a comparative study of machine learning techniques, namely random forest regression (RFR) and gene expression programming (GEP). A widespread database comprising 216 experimental records was constructed from available research. The database includes depth of wear as a response parameter and nine different explanatory variables, i.e., cement content, fly ash, water content, fine and coarse aggregate, plasticizer, air-entraining agent, age of concrete, and time of testing. The performance of the models was judged via statistical metrics. The GEP model gives better performance with R2 and ρ equals 0.9667 and 0.0501 respectively and meet with the external validation criterion suggested in the previous literature. The k-fold cross-validation also verifies the accurateness of the model by evaluating R2, RSE, MAE, and RMSE. The sensitivity analysis of GEP equation indicated that the time of testing is the influential parameter. The results of this research can help the designers, practitioners, and researchers to quickly estimate the depth of wear of fly-ash concrete thus shortening its ecological susceptibilities that push to sustainable and faster construction from the viewpoint of environmentally friendly waste management.",
        "doi": "https://doi.org/10.3390/ma15010058",
        "url": "https://doi.org/10.3390/ma15010058",
        "authors": [
          {
            "display_name": "Mohsin Ali Khan"
          },
          {
            "display_name": "Furqan Farooq"
          },
          {
            "display_name": "Muhammad Faisal Javed"
          },
          {
            "display_name": "Adeel Zafar"
          },
          {
            "display_name": "Krzysztof Adam Ostrowski"
          },
          {
            "display_name": "Fahid Aslam"
          },
          {
            "display_name": "Seweryn Malazdrewicz"
          },
          {
            "display_name": "Mariusz Maślak"
          }
        ],
        "venue": "Materials"
      }
    },
    {
      "ref_id": "[44]",
      "original_data": {
        "ref_id": "[44]",
        "parsed": {
          "title": "A comparative study on performance evaluation of hybrid GNPs/CNTs in conventional and self-compacting mortar",
          "authors": [
            "F. Farooq",
            "S.K.U. Rahman",
            "A. Akbar",
            "R.A. Khushnood",
            "M.F. Javed",
            "R. alyousef",
            "H. Alabduljabbar",
            "F. aslam"
          ],
          "year": 2020,
          "venue": "Alexandria Engineering Journal",
          "doi": "10.1016/j.aej.2019.12.048"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3000483839",
        "title": "A comparative study on performance evaluation of hybrid GNPs/CNTs in conventional and self-compacting mortar",
        "display_name": "A comparative study on performance evaluation of hybrid GNPs/CNTs in conventional and self-compacting mortar",
        "year": 2020,
        "cited_by_count": 48,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.aej.2019.12.048",
        "url": "https://doi.org/10.1016/j.aej.2019.12.048",
        "authors": [
          {
            "display_name": "Furqan Farooq"
          },
          {
            "display_name": "Sardar Kashif Ur Rahman"
          },
          {
            "display_name": "Arslan Akbar"
          },
          {
            "display_name": "Rao Arsalan Khushnood"
          },
          {
            "display_name": "Muhammad Faisal Javed"
          },
          {
            "display_name": "Rayed Alyousef"
          },
          {
            "display_name": "Hisham Alabduljabbar"
          },
          {
            "display_name": "Fahid Aslam"
          }
        ],
        "venue": "Alexandria Engineering Journal"
      }
    },
    {
      "ref_id": "[45]",
      "original_data": {
        "ref_id": "[45]",
        "parsed": {
          "title": "A deep-learning-based MAC for integrating channel access, rate adaptation and channel switch",
          "authors": [
            "J. Xin",
            "W. Xu",
            "B. Cao",
            "T. Wang",
            "S. Zhang"
          ],
          "year": 2024,
          "venue": null,
          "doi": null
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4403538740",
        "title": "A deep-learning-based MAC for integrating channel access, rate adaptation, and channel switch",
        "display_name": "A deep-learning-based MAC for integrating channel access, rate adaptation, and channel switch",
        "year": 2024,
        "cited_by_count": 44,
        "is_retracted": false,
        "abstract": "With increasing density and heterogeneity in unlicensed wireless networks, traditional MAC protocols, such as carrier-sense multiple access with collision avoidance (CSMA/CA) in Wi-Fi networks, are experiencing performance degradation. This is manifested in increased collisions and extended backoff times, leading to diminished spectrum efficiency and protocol coordination. Addressing these issues, this paper proposes a deep-learning-based MAC paradigm, dubbed DL-MAC, which leverages spectrum sensing data readily available from energy detection modules in wireless devices to achieve the MAC functionalities of channel access, rate adaptation and channel switch. First, we utilize DL-MAC to realize a joint design of channel access and rate adaptation. Subsequently, we integrate the capability of channel switch into DL-MAC, enhancing its functionality from single-channel to multi-channel operation. Specifically, the DL-MAC protocol incorporates a deep neural network (DNN) for channel selection and a recurrent neural network (RNN) for the joint design of channel access and rate adaptation. We conducted real-world data collection within the 2.4 GHz frequency band to validate the effectiveness of DL-MAC, and our experiments reveal that DL-MAC exhibits superior performance over traditional algorithms in both single and multi-channel environments and also outperforms single-function approaches in terms of overall performance. Additionally, the performance of DL-MAC remains robust, unaffected by channel switch overhead within the evaluated range.",
        "doi": "https://doi.org/10.1016/j.dcan.2024.10.010",
        "url": "https://doi.org/10.1016/j.dcan.2024.10.010",
        "authors": [
          {
            "display_name": "Jiantao Xin"
          },
          {
            "display_name": "Wei Xu"
          },
          {
            "display_name": "Bin Cao"
          },
          {
            "display_name": "Taotao Wang"
          },
          {
            "display_name": "Shengli Zhang"
          }
        ],
        "venue": "Digital Communications and Networks"
      }
    },
    {
      "ref_id": "[46]",
      "original_data": {
        "ref_id": "[46]",
        "parsed": {
          "title": "Applications of Gene Expression Programming for Estimating Compressive Strength of High-Strength Concrete",
          "authors": [
            "F. Aslam",
            "F. Farooq",
            "M.N. Amin",
            "K. Khan",
            "A. Waheed",
            "A. Akbar",
            "M.F. Javed",
            "R. Alyousef",
            "H. Alabdulijabbar"
          ],
          "year": 2020,
          "venue": "Advances in Civil Engineering",
          "doi": "10.1155/2020/8850535"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3087991416",
        "title": "Applications of Gene Expression Programming for Estimating Compressive Strength of High‐Strength Concrete",
        "display_name": "Applications of Gene Expression Programming for Estimating Compressive Strength of High‐Strength Concrete",
        "year": 2020,
        "cited_by_count": 211,
        "is_retracted": false,
        "abstract": "The experimental design of high‐strength concrete (HSC) requires deep analysis to get the target strength. In this study, machine learning approaches and artificial intelligence python‐based approaches have been utilized to predict the mechanical behaviour of HSC. The data to be used in the modelling consist of several input parameters such as cement, water, fine aggregate, and coarse aggregate in combination with a superplasticizer. Empirical relation with mathematical expression has been proposed using engineering programming. The efficiency of the models is assessed by statistical analysis with the error by using MAE, RRMSE, RSE, and comparisons were made between regression models. Moreover, variable intensity and correlation have shown that deep learning can be used to know the exact amount of materials in civil engineering rather than doing experimental work. The expression tree, as well as normalization of the graph, depicts significant accuracy between target and output values. The results reveal that machine learning proposed adamant accuracy and has elucidated performance in the prediction aspect.",
        "doi": "https://doi.org/10.1155/2020/8850535",
        "url": "https://doi.org/10.1155/2020/8850535",
        "authors": [
          {
            "display_name": "Fahid Aslam"
          },
          {
            "display_name": "Furqan Farooq"
          },
          {
            "display_name": "Muhammad Nasir Amin"
          },
          {
            "display_name": "Kaffayatullah Khan"
          },
          {
            "display_name": "Abdul Waheed"
          },
          {
            "display_name": "Arslan Akbar"
          },
          {
            "display_name": "Muhammad Faisal Javed"
          },
          {
            "display_name": "Rayed Alyousef"
          },
          {
            "display_name": "Hisham Alabdulijabbar"
          }
        ],
        "venue": "Advances in Civil Engineering"
      }
    },
    {
      "ref_id": "[47]",
      "original_data": {
        "ref_id": "[47]",
        "parsed": {
          "title": "Applications of gene expression programming and regression techniques for estimating compressive strength of bagasse ash based concrete",
          "authors": [
            "M.F. Javed",
            "M.N. Amin",
            "M.I. Shah",
            "K. Khan",
            "B. Iftikhar",
            "F. Farooq",
            "F. Aslam",
            "R. Alyousef",
            "H. Alabduljabbar"
          ],
          "year": 2020,
          "venue": "Crystals",
          "doi": "10.3390/cryst10090737"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3081231874",
        "title": "Applications of Gene Expression Programming and Regression Techniques for Estimating Compressive Strength of Bagasse Ash based Concrete",
        "display_name": "Applications of Gene Expression Programming and Regression Techniques for Estimating Compressive Strength of Bagasse Ash based Concrete",
        "year": 2020,
        "cited_by_count": 162,
        "is_retracted": false,
        "abstract": "Compressive strength is one of the important property of concrete and depends on many factors. Most of the concrete compressive strength predictive models mainly rely on available literature data, which are too simple to consider all the contributing factors. This study adopted a new approach to predict the compressive strength of sugarcane bagasse ash concrete (SCBAC). A vast amount of data from the literature study and fifteen laboratory tested concrete samples with different dosage of bagasse ash, were respectively used to calibrate and validate the models. The novel Gene Expression Programming, Multiple Linear Regression and Multiple Non-Linear Regression were used to model SCBAC compressive strength. The water cement ratio, bagasse ash percent replacement, quantity of fine and coarse aggregate and cement content were used as an input for models development. Various statistical indicators, i.e., NSE, R2 and RMSE were used to assess the performance of the models. The results indicated a strong correlation between observed and predicted values with NSE and R2 both above 0.8 during calibration and validation for the Gene Expression Programming (GEP). The outcomes from GEP outclassed all the models to predict SCBAC compressive strength. The validity of the model is further verified using data of fifteen tests conducted in the laboratory. Moreover, the cement content in the mix was revealed as the most sensitive parameter followed by water cement ratio form sensitivity analysis. The GEP fulfilled all the criteria for external validity. The simple formulae derived in this study could be used reliably for the prediction of SCBAC compressive strength.",
        "doi": "https://doi.org/10.3390/cryst10090737",
        "url": "https://doi.org/10.3390/cryst10090737",
        "authors": [
          {
            "display_name": "Muhammad Faisal Javed"
          },
          {
            "display_name": "Muhammad Nasir Amin"
          },
          {
            "display_name": "Muhammad Izhar Shah"
          },
          {
            "display_name": "Kaffayatullah Khan"
          },
          {
            "display_name": "Bawar Iftikhar"
          },
          {
            "display_name": "Furqan Farooq"
          },
          {
            "display_name": "Fahid Aslam"
          },
          {
            "display_name": "Rayed Alyousef"
          },
          {
            "display_name": "Hisham Alabduljabbar"
          }
        ],
        "venue": "Crystals"
      }
    },
    {
      "ref_id": "[48]",
      "original_data": {
        "ref_id": "[48]",
        "parsed": {
          "title": "Behavior analysis of concrete with recycled tire rubber as aggregate using 3D-digital image correlation",
          "authors": [
            "F. Abbassi",
            "F. Ahmad"
          ],
          "year": 2020,
          "venue": "Journal of Cleaner Production",
          "doi": "10.1016/j.jclepro.2020.123074"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3043346423",
        "title": "Behavior analysis of concrete with recycled tire rubber as aggregate using 3D-digital image correlation",
        "display_name": "Behavior analysis of concrete with recycled tire rubber as aggregate using 3D-digital image correlation",
        "year": 2020,
        "cited_by_count": 71,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.jclepro.2020.123074",
        "url": "https://doi.org/10.1016/j.jclepro.2020.123074",
        "authors": [
          {
            "display_name": "Fethi Abbassi"
          },
          {
            "display_name": "Furqan Ahmad"
          }
        ],
        "venue": "Journal of Cleaner Production"
      }
    },
    {
      "ref_id": "[49]",
      "original_data": {
        "ref_id": "[49]",
        "parsed": {
          "title": "A comparative study for the prediction of the compressive strength of self-compacting concrete modified with fly ash",
          "authors": [
            "F. Farooq",
            "S. Czarnecki",
            "P. Niewiadomski",
            "F. Aslam",
            "H. Alabduljabbar",
            "K.A. Ostrowski",
            "K. ´Sliwa-Wieczorek",
            "T. Nowobilski",
            "S. Malazdrewicz"
          ],
          "year": 2021,
          "venue": "Materials (Basel)",
          "doi": "10.3390/ma14174934"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3196351205",
        "title": "A Comparative Study for the Prediction of the Compressive Strength of Self-Compacting Concrete Modified with Fly Ash",
        "display_name": "A Comparative Study for the Prediction of the Compressive Strength of Self-Compacting Concrete Modified with Fly Ash",
        "year": 2021,
        "cited_by_count": 122,
        "is_retracted": false,
        "abstract": "Artificial intelligence and machine learning are employed in creating functions for the prediction of self-compacting concrete (SCC) strength based on input variables proportion as cement replacement. SCC incorporating waste material has been used in learning approaches. Artificial neural network (ANN) support vector machine (SVM) and gene expression programming (GEP) consisting of 300 datasets have been utilized in the model to foresee the mechanical property of SCC. Data used in modeling consist of several input parameters such as cement, water–binder ratio, coarse aggregate, fine aggregate, and fly ash (FA) in combination with the superplasticizer. The best predictive models were selected based on the coefficient of determination (R2) results and model validation. Empirical relation with mathematical expression has been proposed using ANN, SVM, and GEP. The efficiency of the models is assessed by permutation features importance, statistical analysis, and comparison between regression models. The results reveal that the proposed machine learning models achieved adamant accuracy and has elucidated performance in the prediction aspect.",
        "doi": "https://doi.org/10.3390/ma14174934",
        "url": "https://doi.org/10.3390/ma14174934",
        "authors": [
          {
            "display_name": "Furqan Farooq"
          },
          {
            "display_name": "Sławomir Czarnecki"
          },
          {
            "display_name": "Paweł Niewiadomski"
          },
          {
            "display_name": "Fahid Aslam"
          },
          {
            "display_name": "Hisham Alabduljabbar"
          },
          {
            "display_name": "Krzysztof Adam Ostrowski"
          },
          {
            "display_name": "Klaudia Śliwa-Wieczorek"
          },
          {
            "display_name": "Tomasz Nowobilski"
          },
          {
            "display_name": "Seweryn Malazdrewicz"
          }
        ],
        "venue": "Materials"
      }
    },
    {
      "ref_id": "[50]",
      "original_data": {
        "ref_id": "[50]",
        "parsed": {
          "title": "Compressive Strength of Fly-Ash-Based Geopolymer Concrete by Gene Expression Programming and Random Forest",
          "authors": [
            "M.A. Khan",
            "S.A. Memon",
            "F. Farooq",
            "M.F. Javed",
            "F. Aslam",
            "R. Alyousef"
          ],
          "year": 2021,
          "venue": "Advances in Civil Engineering",
          "doi": "10.1155/2021/6618407"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3128759053",
        "title": "Compressive Strength of Fly‐Ash‐Based Geopolymer Concrete by Gene Expression Programming and Random Forest",
        "display_name": "Compressive Strength of Fly‐Ash‐Based Geopolymer Concrete by Gene Expression Programming and Random Forest",
        "year": 2021,
        "cited_by_count": 203,
        "is_retracted": false,
        "abstract": "Fly ash (FA) is a residual from thermal industries that has been effectively utilized in the production of FA‐based geopolymer concrete (FGPC). To avoid time‐consuming and costly experimental procedures, soft computing techniques, namely, random forest regression (RFR) and gene expression programming (GEP), are used in this study to develop an empirical model for the prediction of compressive strength of FGPC. A widespread, reliable, and consistent database of compressive strength of FGPC is set up via a comprehensive literature review. The database consists of 298 compressive strength data points. The influential parameters that are considered as input variables for modelling are curing temperature ( T ), curing time ( t ), age of the specimen ( A ), the molarity of NaOH solution ( M ), percent SiO 2 solids to water ratio (% S / W ) in sodium silicate (Na 2 SiO 3 ) solution, percent volume of total aggregate ( % A G ), fine aggregate to the total aggregate ratio ( F / A G ), sodium oxide (Na 2 O) to water ratio ( N / W ) in Na 2 SiO 3 solution, alkali or activator to the FA ratio ( A L / F A ), Na 2 SiO 3 to NaOH ratio ( N s / N o ), percent plasticizer (% P ), and extra water added as percent FA ( E W %). RFR is an ensemble algorithm and gives outburst performance as compared to GEP. However, GEP proposed an empirical expression that can be used to estimate the compressive strength of FGPC. The accuracy and performance of both models are evaluated via statistical error checks, and external validation is considered. The proposed GEP equation is used for sensitivity analysis and parametric study and then compared with nonlinear and linear regression expressions.",
        "doi": "https://doi.org/10.1155/2021/6618407",
        "url": "https://doi.org/10.1155/2021/6618407",
        "authors": [
          {
            "display_name": "Mohsin Ali Khan"
          },
          {
            "display_name": "Shazim Ali Memon"
          },
          {
            "display_name": "Furqan Farooq"
          },
          {
            "display_name": "Muhammad Faisal Javed"
          },
          {
            "display_name": "Fahid Aslam"
          },
          {
            "display_name": "Rayed Alyousef"
          }
        ],
        "venue": "Advances in Civil Engineering"
      }
    },
    {
      "ref_id": "[51]",
      "original_data": {
        "ref_id": "[51]",
        "parsed": {
          "title": "Prediction of sustainable concrete utilizing rice husk ash (RHA) as supplementary cementitious material (SCM): Optimization and hyper-tuning",
          "authors": [
            "M.N. Amin",
            "K. Khan",
            "A.M. Abu Arab",
            "F. Farooq",
            "S.M. Eldin",
            "M.F. Javed"
          ],
          "year": 2023,
          "venue": "Journal of Materials Research and Technology",
          "doi": "10.1016/j.jmrt.2023.06.006"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4379538285",
        "title": "Prediction of sustainable concrete utilizing rice husk ash (RHA) as supplementary cementitious material (SCM): Optimization and hyper-tuning",
        "display_name": "Prediction of sustainable concrete utilizing rice husk ash (RHA) as supplementary cementitious material (SCM): Optimization and hyper-tuning",
        "year": 2023,
        "cited_by_count": 48,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.jmrt.2023.06.006",
        "url": "https://doi.org/10.1016/j.jmrt.2023.06.006",
        "authors": [
          {
            "display_name": "Muhammad Nasir Amin"
          },
          {
            "display_name": "Kaffayatullah Khan"
          },
          {
            "display_name": "Abdullah Mohammad Abu Arab"
          },
          {
            "display_name": "Furqan Farooq"
          },
          {
            "display_name": "Sayed M. Eldin"
          },
          {
            "display_name": "Muhammad Faisal Javed"
          }
        ],
        "venue": "Journal of Materials Research and Technology"
      }
    },
    {
      "ref_id": "[52]",
      "original_data": {
        "ref_id": "[52]",
        "parsed": {
          "title": "MPCCT: Multimodal vision-language learning paradigm with context-based compact Transformer",
          "authors": [
            "C. Chen",
            "D. Han",
            "C.C. Chang"
          ],
          "year": 2024,
          "venue": "Pattern Recognition",
          "doi": "10.1016/j.patcog.2023.110084"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W4388181804",
        "title": "MPCCT: Multimodal vision-language learning paradigm with context-based compact Transformer",
        "display_name": "MPCCT: Multimodal vision-language learning paradigm with context-based compact Transformer",
        "year": 2023,
        "cited_by_count": 120,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.patcog.2023.110084",
        "url": "https://doi.org/10.1016/j.patcog.2023.110084",
        "authors": [
          {
            "display_name": "Chongqing Chen"
          },
          {
            "display_name": "Dezhi Han"
          },
          {
            "display_name": "Chin‐Chen Chang"
          }
        ],
        "venue": "Pattern Recognition"
      }
    },
    {
      "ref_id": "[53]",
      "original_data": {
        "ref_id": "[53]",
        "parsed": {
          "title": "A novel approach in forecasting compressive strength of concrete with carbon nanotubes as nanomaterials",
          "authors": [
            "H. Jiao",
            "Y. Wang",
            "L. Li",
            "K. Arif",
            "F. Farooq",
            "A. Alaskar"
          ],
          "year": 2023,
          "venue": "Materials Today Communications",
          "doi": "10.1016/j.mtcomm.2023.106335"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4379206808",
        "title": "A novel approach in forecasting compressive strength of concrete with carbon nanotubes as nanomaterials",
        "display_name": "A novel approach in forecasting compressive strength of concrete with carbon nanotubes as nanomaterials",
        "year": 2023,
        "cited_by_count": 36,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.mtcomm.2023.106335",
        "url": "https://doi.org/10.1016/j.mtcomm.2023.106335",
        "authors": [
          {
            "display_name": "Hongbo Jiao"
          },
          {
            "display_name": "Yonggang Wang"
          },
          {
            "display_name": "Lielie Li"
          },
          {
            "display_name": "Kiran Arif"
          },
          {
            "display_name": "Furqan Farooq"
          },
          {
            "display_name": "Abdulaziz A. Al–Askar"
          }
        ],
        "venue": "Materials Today Communications"
      }
    },
    {
      "ref_id": "[54]",
      "original_data": {
        "ref_id": "[54]",
        "parsed": {
          "title": "Evaluation of properties of bio-composite with interpretable machine learning approaches: optimization and hyper tuning",
          "authors": [
            "G. Xu",
            "G. Zhou",
            "F. Althoey",
            "H.M. Hadidi",
            "A. Alaskar",
            "A.M. Hassan",
            "F. Farooq"
          ],
          "year": 2023,
          "venue": "Journal of Materials Research and Technology",
          "doi": "10.1016/j.jmrt.2023.06.007"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4379745224",
        "title": "Evaluation of properties of bio-composite with interpretable machine learning approaches: optimization and hyper tuning",
        "display_name": "Evaluation of properties of bio-composite with interpretable machine learning approaches: optimization and hyper tuning",
        "year": 2023,
        "cited_by_count": 30,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.jmrt.2023.06.007",
        "url": "https://doi.org/10.1016/j.jmrt.2023.06.007",
        "authors": [
          {
            "display_name": "Guiying Xu"
          },
          {
            "display_name": "Gengxin Zhou"
          },
          {
            "display_name": "Fadi Althoey"
          },
          {
            "display_name": "Haitham Hadidi"
          },
          {
            "display_name": "Abdulaziz Alaskar"
          },
          {
            "display_name": "Ahmed M. Hassan"
          },
          {
            "display_name": "Furqan Farooq"
          }
        ],
        "venue": "Journal of Materials Research and Technology"
      }
    },
    {
      "ref_id": "[55]",
      "original_data": {
        "ref_id": "[55]",
        "parsed": {
          "title": "Strength evaluation sustainable concrete with waste ingredients at elevated temperature by employing interpretable algorithms: Optimization and hyper tuning",
          "authors": [
            "Y. Hu",
            "A.A. Alaskar",
            "F. Althoey",
            "M.A. Abuhussain",
            "G. Alfalah",
            "F. Farooq"
          ],
          "year": 2023,
          "venue": "Materials Today Communications",
          "doi": "10.1016/j.mtcomm.2023.106467"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4382364423",
        "title": "Strength evaluation sustainable concrete with waste ingredients at elevated temperature by employing interpretable algorithms: Optimization and hyper tuning",
        "display_name": "Strength evaluation sustainable concrete with waste ingredients at elevated temperature by employing interpretable algorithms: Optimization and hyper tuning",
        "year": 2023,
        "cited_by_count": 16,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.mtcomm.2023.106467",
        "url": "https://doi.org/10.1016/j.mtcomm.2023.106467",
        "authors": [
          {
            "display_name": "Yuan Hu"
          },
          {
            "display_name": "Abdul Aziz Alaskar"
          },
          {
            "display_name": "Fadi Althoey"
          },
          {
            "display_name": "Mohammed Awad Abuhussain"
          },
          {
            "display_name": "Ghasan Alfalah"
          },
          {
            "display_name": "Furqan Farooq"
          }
        ],
        "venue": "Materials Today Communications"
      }
    },
    {
      "ref_id": "[56]",
      "original_data": {
        "ref_id": "[56]",
        "parsed": {
          "title": "Forecasting the strength of micro/nano silica in cementitious matrix by machine learning approaches",
          "authors": [
            "A. Zaman",
            "R.U.D. Nassar",
            "M. Alyami",
            "S. Shah",
            "M.F. Rehman",
            "I.Y. Hakeem",
            "F. Farooq"
          ],
          "year": 2023,
          "venue": "Materials Today Communications",
          "doi": "10.1016/j.mtcomm.2023.107066"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4386569935",
        "title": "Forecasting the strength of micro/nano silica in cementitious matrix by machine learning approaches",
        "display_name": "Forecasting the strength of micro/nano silica in cementitious matrix by machine learning approaches",
        "year": 2023,
        "cited_by_count": 25,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.mtcomm.2023.107066",
        "url": "https://doi.org/10.1016/j.mtcomm.2023.107066",
        "authors": [
          {
            "display_name": "Athar Zaman"
          },
          {
            "display_name": "Roz‐Ud‐Din Nassar"
          },
          {
            "display_name": "Mana Alyami"
          },
          {
            "display_name": "Sultan Shah"
          },
          {
            "display_name": "Muhammad Faisal Rehman"
          },
          {
            "display_name": "Ibrahim Y. Hakeem"
          },
          {
            "display_name": "Furqan Farooq"
          }
        ],
        "venue": "Materials Today Communications"
      }
    },
    {
      "ref_id": "[57]",
      "original_data": {
        "ref_id": "[57]",
        "parsed": {
          "title": "Rutting prediction of asphalt pavement with semi-rigid base: Numerical modeling on laboratory to accelerated pavement testing",
          "authors": [
            "Z. Liu",
            "X. Gu",
            "H. Ren"
          ],
          "year": 2023,
          "venue": "Construction and Building Materials",
          "doi": "10.1016/j.conbuildmat.2023.130903"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4323928242",
        "title": "Rutting prediction of asphalt pavement with semi-rigid base: Numerical modeling on laboratory to accelerated pavement testing",
        "display_name": "Rutting prediction of asphalt pavement with semi-rigid base: Numerical modeling on laboratory to accelerated pavement testing",
        "year": 2023,
        "cited_by_count": 57,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.conbuildmat.2023.130903",
        "url": "https://doi.org/10.1016/j.conbuildmat.2023.130903",
        "authors": [
          {
            "display_name": "Zhen Liu"
          },
          {
            "display_name": "Xingyu Gu"
          },
          {
            "display_name": "Hua Ren"
          }
        ],
        "venue": "Construction and Building Materials"
      }
    },
    {
      "ref_id": "[58]",
      "original_data": {
        "ref_id": "[58]",
        "parsed": {
          "title": "Prediction and evaluation of rutting and moisture susceptibility in rejuvenated asphalt mixtures",
          "authors": [
            "Y. Zhang",
            "M. Ling",
            "F. Kaseer",
            "E. Arambula",
            "R.L. Lytton",
            "A.E. Martin"
          ],
          "year": 2022,
          "venue": "Journal of Cleaner Production",
          "doi": "10.1016/j.jclepro.2021.129980"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W4200144918",
        "title": "Prediction and evaluation of rutting and moisture susceptibility in rejuvenated asphalt mixtures",
        "display_name": "Prediction and evaluation of rutting and moisture susceptibility in rejuvenated asphalt mixtures",
        "year": 2021,
        "cited_by_count": 27,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.jclepro.2021.129980",
        "url": "https://doi.org/10.1016/j.jclepro.2021.129980",
        "authors": [
          {
            "display_name": "Yao Zhang"
          },
          {
            "display_name": "Meng Ling"
          },
          {
            "display_name": "Fawaz Kaseer"
          },
          {
            "display_name": "Edith Arámbula"
          },
          {
            "display_name": "Robert L. Lytton"
          },
          {
            "display_name": "Amy Epps Martin"
          }
        ],
        "venue": "Journal of Cleaner Production"
      }
    },
    {
      "ref_id": "[59]",
      "original_data": {
        "ref_id": "[59]",
        "parsed": {
          "title": "CLVIN: Complete language-vision interaction network for visual question answering",
          "authors": [
            "C. Chen",
            "D. Han",
            "X. Shen"
          ],
          "year": 2023,
          "venue": "Knowledge-Based Systems",
          "doi": "10.1016/j.knosys.2023.110706"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4380201463",
        "title": "CLVIN: Complete language-vision interaction network for visual question answering",
        "display_name": "CLVIN: Complete language-vision interaction network for visual question answering",
        "year": 2023,
        "cited_by_count": 101,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.knosys.2023.110706",
        "url": "https://doi.org/10.1016/j.knosys.2023.110706",
        "authors": [
          {
            "display_name": "Chongqing Chen"
          },
          {
            "display_name": "Dezhi Han"
          },
          {
            "display_name": "Xiang Shen"
          }
        ],
        "venue": "Knowledge-Based Systems"
      }
    },
    {
      "ref_id": "[60]",
      "original_data": {
        "ref_id": "[60]",
        "parsed": {
          "title": "An Improved BPNN Method Based on Probability Density for Indoor Location",
          "authors": [
            "R. Fei",
            "Y. Guo",
            "J. Li",
            "B. Hu",
            "L. Yang"
          ],
          "year": 2023,
          "venue": "IEICE Transactions on Information and Systems",
          "doi": "10.1587/transinf.2022DLP0073"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4367555634",
        "title": "An Improved BPNN Method Based on Probability Density for Indoor Location",
        "display_name": "An Improved BPNN Method Based on Probability Density for Indoor Location",
        "year": 2023,
        "cited_by_count": 98,
        "is_retracted": false,
        "abstract": "With the widespread use of indoor positioning technology, the need for high-precision positioning services is rising; nevertheless, there are several challenges, such as the difficulty of simulating the distribution of interior location data and the enormous inaccuracy of probability computation. As a result, this paper proposes three different neural network model comparisons for indoor location based on WiFi fingerprint - indoor location algorithm based on improved back propagation neural network model, RSSI indoor location algorithm based on neural network angle change, and RSSI indoor location algorithm based on depth neural network angle change - to raise accurately predict indoor location coordinates. Changing the action range of the activation function in the standard back-propagation neural network model achieves the goal of accurately predicting location coordinates. The revised back-propagation neural network model has strong stability and enhances indoor positioning accuracy based on experimental comparisons of loss rate (loss), accuracy rate (acc), and cumulative distribution function (CDF).",
        "doi": "https://doi.org/10.1587/transinf.2022dlp0073",
        "url": "https://doi.org/10.1587/transinf.2022dlp0073",
        "authors": [
          {
            "display_name": "Rong FEI"
          },
          {
            "display_name": "Yufan Guo"
          },
          {
            "display_name": "Junhuai LI"
          },
          {
            "display_name": "Bo Hu"
          },
          {
            "display_name": "Lü Yang"
          }
        ],
        "venue": "IEICE Transactions on Information and Systems"
      }
    },
    {
      "ref_id": "[61]",
      "original_data": {
        "ref_id": "[61]",
        "parsed": {
          "title": "Intelligent Control of Multilegged Robot Smooth Motion: A Review",
          "authors": [
            "Y. Zhao",
            "J. Wang",
            "G. Cao",
            "Y. Yuan",
            "X. Yao",
            "L. Qi"
          ],
          "year": 2023,
          "venue": "IEEE Access",
          "doi": "10.1109/ACCESS.2023.3304992"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4385819939",
        "title": "Intelligent Control of Multilegged Robot Smooth Motion: A Review",
        "display_name": "Intelligent Control of Multilegged Robot Smooth Motion: A Review",
        "year": 2023,
        "cited_by_count": 109,
        "is_retracted": false,
        "abstract": "Motion control is crucial for multilegged robot locomotion and task completion. This study aims to address the fundamental challenges of inadequate foot tracking and weak leg compliance control in multilegged robot motions. The first section summarizes and discusses the feasibility and operability of smooth motion for multilegged robots based on the necessary conditions and application value of walking over complicated and unstructured terrain. The second to fourth sections present a qualitative research method of literature review to study the effects of several factors on the smooth motion of multilegged robots, including foot force perception and motion planning, active compliance control, gait stability, and Deep Reinforcement Learning (DRL) control. We conducted a case analysis of multilegged robots using traditional Nonlinear Model Predictive Control (NMPC), biomimetic Central Pattern Generator (CPG), and DRL control in the latest international open-source projects to help readers further follow the latest open-source algorithms for legged robot motion control. In addition, we analyze the challenges these influencing factors face in optimization and provide suggestions for effectively promoting the realization of review objectives. In the fifth section, we discuss the challenges of springy gait and intelligent switching control in solving the problems of poor foot tracking and weak leg compliance. We explore and forecast the potential application of the Probability Density Function (PDF) control of the foot force in the smooth motion of multilegged robots. In the sixth section, we systematically discuss, analyze, and summarize the existing problems in this research field. We also highlight the shortcomings of existing research methods, look forward to future research areas, and highlight the obstacles that need to be overcome to promote future research in this field.",
        "doi": "https://doi.org/10.1109/access.2023.3304992",
        "url": "https://doi.org/10.1109/access.2023.3304992",
        "authors": [
          {
            "display_name": "Yongyong Zhao"
          },
          {
            "display_name": "Jinghua Wang"
          },
          {
            "display_name": "Guohua Cao"
          },
          {
            "display_name": "Yi Yuan"
          },
          {
            "display_name": "Yao Xu"
          },
          {
            "display_name": "Luqiang Qi"
          }
        ],
        "venue": "IEEE Access"
      }
    },
    {
      "ref_id": "[62]",
      "original_data": {
        "ref_id": "[62]",
        "parsed": {
          "title": "SVM strategy and analysis of a three-phase quasi-Z-source inverter with high voltage transmission ratio",
          "authors": [
            "D.L. Chen",
            "J.W. Zhao",
            "S.R. Qin"
          ],
          "year": 2023,
          "venue": "Science China Technological Sciences",
          "doi": "10.1007/s11431-022-2394-4"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4385661882",
        "title": "SVM strategy and analysis of a three-phase quasi-Z-source inverter with high voltage transmission ratio",
        "display_name": "SVM strategy and analysis of a three-phase quasi-Z-source inverter with high voltage transmission ratio",
        "year": 2023,
        "cited_by_count": 81,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1007/s11431-022-2394-4",
        "url": "https://doi.org/10.1007/s11431-022-2394-4",
        "authors": [
          {
            "display_name": "Daolian Chen"
          },
          {
            "display_name": "Jiawei Zhao"
          },
          {
            "display_name": "Shize Qin"
          }
        ],
        "venue": "Science China Technological Sciences"
      }
    },
    {
      "ref_id": "[63]",
      "original_data": {
        "ref_id": "[63]",
        "parsed": {
          "title": "A robust observer based on the nonlinear descriptor systems application to estimate the state of charge of lithium-ion batteries",
          "authors": [
            "S. Meng",
            "F. Meng",
            "H. Chi",
            "H. Chen",
            "A. Pang"
          ],
          "year": 2023,
          "venue": "Journal of the Franklin Institute",
          "doi": "10.1016/j.jfranklin.2023.08.037"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4386367035",
        "title": "A robust observer based on the nonlinear descriptor systems application to estimate the state of charge of lithium-ion batteries",
        "display_name": "A robust observer based on the nonlinear descriptor systems application to estimate the state of charge of lithium-ion batteries",
        "year": 2023,
        "cited_by_count": 145,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.jfranklin.2023.08.037",
        "url": "https://doi.org/10.1016/j.jfranklin.2023.08.037",
        "authors": [
          {
            "display_name": "Shengya Meng"
          },
          {
            "display_name": "Fanwei Meng"
          },
          {
            "display_name": "Heng Chi"
          },
          {
            "display_name": "Haonan Chen"
          },
          {
            "display_name": "Aiping Pang"
          }
        ],
        "venue": "Journal of the Franklin Institute"
      }
    },
    {
      "ref_id": "[64]",
      "original_data": {
        "ref_id": "[64]",
        "parsed": {
          "title": "Ensemble regression based on polynomial regression-based decision tree and its application in the in-situ data of tunnel boring machine",
          "authors": [
            "M. Shi",
            "W. Hu",
            "M. Li",
            "J. Zhang",
            "X. Song",
            "W. Sun"
          ],
          "year": 2023,
          "venue": "Mechanical Systems and Signal Processing",
          "doi": "10.1016/j.ymssp.2022.110022"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W4311240451",
        "title": "Ensemble regression based on polynomial regression-based decision tree and its application in the in-situ data of tunnel boring machine",
        "display_name": "Ensemble regression based on polynomial regression-based decision tree and its application in the in-situ data of tunnel boring machine",
        "year": 2022,
        "cited_by_count": 126,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.ymssp.2022.110022",
        "url": "https://doi.org/10.1016/j.ymssp.2022.110022",
        "authors": [
          {
            "display_name": "Maolin Shi"
          },
          {
            "display_name": "Weifei Hu"
          },
          {
            "display_name": "Muxi Li"
          },
          {
            "display_name": "Jian Zhang"
          },
          {
            "display_name": "Xueguan Song"
          },
          {
            "display_name": "Wei Sun"
          }
        ],
        "venue": "Mechanical Systems and Signal Processing"
      }
    },
    {
      "ref_id": "[65]",
      "original_data": {
        "ref_id": "[65]",
        "parsed": {
          "title": "An open-source unconstrained stress updating algorithm for the modified Cam-clay model",
          "authors": [
            "X. Zhou",
            "D. Lu",
            "Y. Zhang",
            "X. Du",
            "T. Rabczuk"
          ],
          "year": 2022,
          "venue": "Computer Methods in Applied Mechanics and Engineering",
          "doi": "10.1016/j.cma.2021.114356"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W3216342379",
        "title": "An open-source unconstrained stress updating algorithm for the modified Cam-clay model",
        "display_name": "An open-source unconstrained stress updating algorithm for the modified Cam-clay model",
        "year": 2021,
        "cited_by_count": 107,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.cma.2021.114356",
        "url": "https://doi.org/10.1016/j.cma.2021.114356",
        "authors": [
          {
            "display_name": "Xin Zhou"
          },
          {
            "display_name": "Dechun Lu"
          },
          {
            "display_name": "Yaning Zhang"
          },
          {
            "display_name": "Xiuli Du"
          },
          {
            "display_name": "Timon Rabczuk"
          }
        ],
        "venue": "Computer Methods in Applied Mechanics and Engineering"
      }
    },
    {
      "ref_id": "[66]",
      "original_data": {
        "ref_id": "[66]",
        "parsed": {
          "title": "3D Dynamic Elastoplastic Constitutive Model of Concrete within the Framework of Rate-Dependent Consistency Condition",
          "authors": [
            "D. Lu",
            "X. Zhou",
            "X. Du",
            "G. Wang"
          ],
          "year": 2020,
          "venue": "Journal of Engineering Mechanics",
          "doi": "10.1061/(asce)em.1943-7889.0001854"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3080200352",
        "title": "3D Dynamic Elastoplastic Constitutive Model of Concrete within the Framework of Rate-Dependent Consistency Condition",
        "display_name": "3D Dynamic Elastoplastic Constitutive Model of Concrete within the Framework of Rate-Dependent Consistency Condition",
        "year": 2020,
        "cited_by_count": 37,
        "is_retracted": false,
        "abstract": "In this paper, the proposed yield function is the function of stress, hardening parameter, and strain rate. To fully describe the stress state and strain rate condition of material during dynamic loading, a new coordinate system, which is composed of a stress axis and strain rate axis, is employed to present the proposed rate-dependent yield surface. The strain rate is regarded as a variable in applying the consistency condition. The rate-dependent consistency is satisfied strictly during the whole dynamic loading. The nonassociated flow rule is employed to describe the dilatancy behavior of concrete. The loading–unloading criterion based on Ilyushin's postulate is developed into the rate-dependent loading–unloading criterion that can consider reasonably the change of elastic domain caused by strain rate. Furthermore, a three-dimensional (3D) dynamic elastoplastic model of concrete is established within the framework of the rate-dependent consistency condition. Under the dynamic uniaxial compression loading condition, the model characteristics related to rate-dependent consistency condition are discussed and analyzed. Five sets of dynamic experiment results of concrete are employed to evaluate the performance of the model.",
        "doi": "https://doi.org/10.1061/(asce)em.1943-7889.0001854",
        "url": "https://doi.org/10.1061/(asce)em.1943-7889.0001854",
        "authors": [
          {
            "display_name": "Dechun Lu"
          },
          {
            "display_name": "Xin Zhou"
          },
          {
            "display_name": "Xiuli Du"
          },
          {
            "display_name": "Guosheng Wang"
          }
        ],
        "venue": "Journal of Engineering Mechanics"
      }
    },
    {
      "ref_id": "[67]",
      "original_data": {
        "ref_id": "[67]",
        "parsed": {
          "title": "A multimodal hybrid parallel network intrusion detection model",
          "authors": [
            "S. Shi",
            "D. Han",
            "M. Cui"
          ],
          "year": 2023,
          "venue": "Connection Science",
          "doi": "10.1080/09540091.2023.2227780"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4385877082",
        "title": "A multimodal hybrid parallel network intrusion detection model",
        "display_name": "A multimodal hybrid parallel network intrusion detection model",
        "year": 2023,
        "cited_by_count": 122,
        "is_retracted": false,
        "abstract": "With the rapid growth of Internet data traffic, the means of malicious attack become more diversified. The single modal intrusion detection model cannot fully exploit the rich feature information in the massive network traffic data, resulting in unsatisfactory detection results. To address this issue, this paper proposes a multimodal hybrid parallel network intrusion detection model (MHPN). The proposed model extracts network traffic features from two modalities: the statistical information of network traffic and the original load of traffic, and constructs appropriate neural network models for each modal information. Firstly, a two-branch convolutional neural network is combined with Long Short-Term Memory (LSTM) network to extract the spatio-temporal feature information of network traffic from the original load mode of traffic, and a convolutional neural network is used to extract the feature information of traffic statistics. Then, the feature information extracted from the two modalities is fused and fed to the CosMargin classifier for network traffic classification. The experimental results on the ISCX-IDS 2012 and CIC-IDS-2017 datasets show that the MHPN model outperforms the single-modal models and achieves an average accuracy of 99.98 $ \\% $ . The model also demonstrates strong robustness and a positive sample recognition rate.",
        "doi": "https://doi.org/10.1080/09540091.2023.2227780",
        "url": "https://doi.org/10.1080/09540091.2023.2227780",
        "authors": [
          {
            "display_name": "Shuxin Shi"
          },
          {
            "display_name": "Dezhi Han"
          },
          {
            "display_name": "Mingming Cui"
          }
        ],
        "venue": "Connection Science"
      }
    },
    {
      "ref_id": "[68]",
      "original_data": {
        "ref_id": "[68]",
        "parsed": {
          "title": "Analysis and Experimental Verification of the Tangential Force Effect on Electromagnetic Vibration of PM Motor",
          "authors": [
            "J. Hong",
            "L. Gui",
            "J. Cao"
          ],
          "year": 2023,
          "venue": "IEEE Transactions on Energy Conversion",
          "doi": "10.1109/TEC.2023.3241082"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4319866324",
        "title": "Analysis and Experimental Verification of the Tangential Force Effect on Electromagnetic Vibration of PM Motor",
        "display_name": "Analysis and Experimental Verification of the Tangential Force Effect on Electromagnetic Vibration of PM Motor",
        "year": 2023,
        "cited_by_count": 102,
        "is_retracted": false,
        "abstract": "In traditional analysis, several studies have discussed the vibration behavior of electric machines from the point of view of radial force. With the increasingly strict vibroacoustic index, the tangential force effects on the vibration are analyzed and investigated, and it shows the contribution of tangential force on electromagnetic vibration cannot be ignored. However, these studies are based mainly on finite element multi-physics models, and experiments are not conducted. Furthermore, the mechanism of tangential force is not clearly explained. In this paper, a special motor stator structure is proposed to explore the effect of tangential force on vibration. First, the analytical calculation of the tangential force and the tangential effect on motor vibration are described. Next, the Theorem of Translation of A Force is introduced to convert the effective tangential tooth force to a radial force couple acting on the stator yoke. Then, a novel motor stator is proposed to investigate the vibration characteristics caused only by tangential force, and the simulation is analyzed. Finally, a vibration test of the prototype is conducted and the result shows the tangential force can induce the radial vibration with corresponding order.",
        "doi": "https://doi.org/10.1109/tec.2023.3241082",
        "url": "https://doi.org/10.1109/tec.2023.3241082",
        "authors": [
          {
            "display_name": "Jianfeng Hong"
          },
          {
            "display_name": "Lin Gui"
          },
          {
            "display_name": "Junci Cao"
          }
        ],
        "venue": "IEEE Transactions on Energy Conversion"
      }
    },
    {
      "ref_id": "[69]",
      "original_data": {
        "ref_id": "[69]",
        "parsed": {
          "title": "Investigation and optimization of the C-ANN structure in predicting the compressive strength of foamed concrete",
          "authors": [
            "D. Van Dao",
            "H.-B.B. Ly",
            "H.-L.L.T. Vu",
            "T.-T.T. Le",
            "B.T. Pham"
          ],
          "year": 2020,
          "venue": "Materials (Basel)",
          "doi": "10.3390/ma13051072"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3007270451",
        "title": "Investigation and Optimization of the C-ANN Structure in Predicting the Compressive Strength of Foamed Concrete",
        "display_name": "Investigation and Optimization of the C-ANN Structure in Predicting the Compressive Strength of Foamed Concrete",
        "year": 2020,
        "cited_by_count": 98,
        "is_retracted": false,
        "abstract": "Development of Foamed Concrete (FC) and incessant increases in fabrication technology have paved the way for many promising civil engineering applications. Nevertheless, the design of FC requires a large number of experiments to determine the appropriate Compressive Strength (CS). Employment of machine learning algorithms to take advantage of the existing experiments database has been attempted, but model performance can still be improved. In this study, the performance of an Artificial Neural Network (ANN) was fully analyzed to predict the 28 days CS of FC. Monte Carlo simulations (MCS) were used to statistically analyze the convergence of the modeled results under the effect of random sampling strategies and the network structures selected. Various statistical measures such as Coefficient of Determination (R2), Mean Absolute Error (MAE), and Root Mean Squared Error (RMSE) were used for validation of model performance. The results show that ANN is a highly efficient predictor of the CS of FC, achieving a maximum R2 value of 0.976 on the training part and an R2 of 0.972 on the testing part, using the optimized C-ANN-[3–4–5–1] structure, which compares with previous published studies. In addition, a sensitivity analysis using Partial Dependence Plots (PDP) over 1000 MCS was also performed to interpret the relationship between the input parameters and 28 days CS of FC. Dry density was found as the variable with the highest impact to predict the CS of FC. The results presented could facilitate and enhance the use of C-ANN in other civil engineering-related problems.",
        "doi": "https://doi.org/10.3390/ma13051072",
        "url": "https://doi.org/10.3390/ma13051072",
        "authors": [
          {
            "display_name": "Dong Van Dao"
          },
          {
            "display_name": "Hai‐Bang Ly"
          },
          {
            "display_name": "Huong-Lan Thi Vu"
          },
          {
            "display_name": "Tien-Thinh Le"
          },
          {
            "display_name": "Binh Thai Pham"
          }
        ],
        "venue": "Materials"
      }
    },
    {
      "ref_id": "[70]",
      "original_data": {
        "ref_id": "[70]",
        "parsed": {
          "title": "Neural Network Modeling of Resilient Modulus Using Routine Subgrade Soil Properties",
          "authors": [
            "M. Zaman",
            "P. Solanki",
            "A. Ebrahimi",
            "L. White"
          ],
          "year": 2010,
          "venue": "International Journal of Geomechanics",
          "doi": "10.1061/(asce)1532-3641(2010)10:1(1)"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W1989840401",
        "title": "Neural Network Modeling of Resilient Modulus Using Routine Subgrade Soil Properties",
        "display_name": "Neural Network Modeling of Resilient Modulus Using Routine Subgrade Soil Properties",
        "year": 2010,
        "cited_by_count": 100,
        "is_retracted": false,
        "abstract": "Artificial neural network (ANN) models are developed in this study to correlate resilient modulus with routine properties of subgrade soils and state of stress for pavement design application. A database is developed containing grain size distribution, Atterberg limits, standard Proctor, unconfined compression, and resilient modulus results for 97 soils from 16 different counties in Oklahoma. Of these, 63 soils (development data set) are used in training, and the remaining 34 soils (evaluation data set) from two different counties are used in the evaluation of the developed models. A commercial software, STATISTICA 7.1, is used to develop four different feedforward-type ANN models: linear network, general regression neural network, radial basis function network, and multilayer perceptrons network (MLPN). In each of these models, the input layer consists of seven nodes, one node for each of the independent variables, namely moisture content (w), dry density (γd), plasticity index (PI), percent passing sieve No. 200 (P200), unconfined compressive strength (Uc), deviatoric stress (σd), and bulk stress (θ). The output layer consists of only one node—resilient modulus (MR). After the architecture is set, the development data set is fed into the model for training. The strengths and weaknesses of the developed models are examined by comparing the predicted MR values with the experimental values with respect to the R2 values. Overall, the MLPN model with two hidden layers was found to be the best model for the present development and evaluation data sets. This model as well as the other models could be refined using an enriched database.",
        "doi": "https://doi.org/10.1061/(asce)1532-3641(2010)10:1(1)",
        "url": "https://doi.org/10.1061/(asce)1532-3641(2010)10:1(1)",
        "authors": [
          {
            "display_name": "Musharraf Zaman"
          },
          {
            "display_name": "Pranshoo Solanki"
          },
          {
            "display_name": "Ali Ebrahimi"
          },
          {
            "display_name": "Luther W. White"
          }
        ],
        "venue": "International Journal of Geomechanics"
      }
    },
    {
      "ref_id": "[71]",
      "original_data": {
        "ref_id": "[71]",
        "parsed": {
          "title": "Predicting resilient modulus of compacted subgrade soils under influences of freeze – thaw cycles and moisture using gene expression programming and artificial neural network approaches",
          "authors": [
            "W. lie Zou",
            "Z. Han",
            "L. qiang Ding",
            "X. qun Wang"
          ],
          "year": 2021,
          "venue": "Transportation Geotechnics",
          "doi": "10.1016/j.trgeo.2021.100520"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3126780384",
        "title": "Predicting resilient modulus of compacted subgrade soils under influences of freeze–thaw cycles and moisture using gene expression programming and artificial neural network approaches",
        "display_name": "Predicting resilient modulus of compacted subgrade soils under influences of freeze–thaw cycles and moisture using gene expression programming and artificial neural network approaches",
        "year": 2021,
        "cited_by_count": 49,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.trgeo.2021.100520",
        "url": "https://doi.org/10.1016/j.trgeo.2021.100520",
        "authors": [
          {
            "display_name": "Wei-lie Zou"
          },
          {
            "display_name": "Zhong Han"
          },
          {
            "display_name": "Luqiang Ding"
          },
          {
            "display_name": "Xie-qun Wang"
          }
        ],
        "venue": "Transportation Geotechnics"
      }
    },
    {
      "ref_id": "[72]",
      "original_data": {
        "ref_id": "[72]",
        "parsed": {
          "title": "Extreme Learning Machine Based Modeling of Resilient Modulus of Subgrade Soils",
          "authors": [
            "M. Pal",
            "S. Deswal"
          ],
          "year": 2014,
          "venue": "Geotechnical and Geological Engineering",
          "doi": "10.1007/s10706-013-9710-y"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W1985068142",
        "title": "Extreme Learning Machine Based Modeling of Resilient Modulus of Subgrade Soils",
        "display_name": "Extreme Learning Machine Based Modeling of Resilient Modulus of Subgrade Soils",
        "year": 2013,
        "cited_by_count": 43,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1007/s10706-013-9710-y",
        "url": "https://doi.org/10.1007/s10706-013-9710-y",
        "authors": [
          {
            "display_name": "Mahesh Pal"
          },
          {
            "display_name": "Surinder Deswal"
          }
        ],
        "venue": "Geotechnical and Geological Engineering"
      }
    },
    {
      "ref_id": "[73]",
      "original_data": {
        "ref_id": "[73]",
        "parsed": {
          "title": "Prediction of the resilient modulus of flexible pavement subgrade soils using adaptive neuro-fuzzy inference systems",
          "authors": [
            "E. Sadrossadat",
            "A. Heidaripanah",
            "S. Osouli"
          ],
          "year": 2016,
          "venue": "Construction and Building Materials",
          "doi": "10.1016/j.conbuildmat.2016.07.008"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W2468700497",
        "title": "Prediction of the resilient modulus of flexible pavement subgrade soils using adaptive neuro-fuzzy inference systems",
        "display_name": "Prediction of the resilient modulus of flexible pavement subgrade soils using adaptive neuro-fuzzy inference systems",
        "year": 2016,
        "cited_by_count": 98,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.conbuildmat.2016.07.008",
        "url": "https://doi.org/10.1016/j.conbuildmat.2016.07.008",
        "authors": [
          {
            "display_name": "Ehsan Sadrossadat"
          },
          {
            "display_name": "Ali Heidaripanah"
          },
          {
            "display_name": "Saeedeh Osouli"
          }
        ],
        "venue": "Construction and Building Materials"
      }
    },
    {
      "ref_id": "[74]",
      "original_data": {
        "ref_id": "[74]",
        "parsed": {
          "title": "Prediction of the resilient modulus of compacted subgrade soils using ensemble machine learning methods",
          "authors": [
            "N. Kardani",
            "M. Aminpour",
            "M. Nouman Amjad Raja",
            "G. Kumar",
            "A. Bardhan",
            "M. Nazem"
          ],
          "year": 2022,
          "venue": "Transportation Geotechnics",
          "doi": "10.1016/j.trgeo.2022.100827"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4289930890",
        "title": "Prediction of the resilient modulus of compacted subgrade soils using ensemble machine learning methods",
        "display_name": "Prediction of the resilient modulus of compacted subgrade soils using ensemble machine learning methods",
        "year": 2022,
        "cited_by_count": 84,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.trgeo.2022.100827",
        "url": "https://doi.org/10.1016/j.trgeo.2022.100827",
        "authors": [
          {
            "display_name": "Navid Kardani"
          },
          {
            "display_name": "Mohammad Aminpour"
          },
          {
            "display_name": "Muhammad Nouman Amjad Raja"
          },
          {
            "display_name": "Gaurav Kumar"
          },
          {
            "display_name": "Abidhan Bardhan"
          },
          {
            "display_name": "Majidreza Nazem"
          }
        ],
        "venue": "Transportation Geotechnics"
      }
    },
    {
      "ref_id": "[75]",
      "original_data": {
        "ref_id": "[75]",
        "parsed": {
          "title": "Failure mode classification and bearing capacity prediction for reinforced concrete columns based on ensemble machine learning algorithm",
          "authors": [
            "D.C. Feng",
            "Z.T. Liu",
            "X.D. Wang",
            "Z.M. Jiang",
            "S.X. Liang"
          ],
          "year": 2020,
          "venue": "Advances in Engineering Informatics",
          "doi": "10.1016/j.aei.2020.101126"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3036246077",
        "title": "Failure mode classification and bearing capacity prediction for reinforced concrete columns based on ensemble machine learning algorithm",
        "display_name": "Failure mode classification and bearing capacity prediction for reinforced concrete columns based on ensemble machine learning algorithm",
        "year": 2020,
        "cited_by_count": 249,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.aei.2020.101126",
        "url": "https://doi.org/10.1016/j.aei.2020.101126",
        "authors": [
          {
            "display_name": "De‐Cheng Feng"
          },
          {
            "display_name": "Zhentao Liu"
          },
          {
            "display_name": "Xiaodan Wang"
          },
          {
            "display_name": "Zhongming Jiang"
          },
          {
            "display_name": "Shixue Liang"
          }
        ],
        "venue": "Advanced Engineering Informatics"
      }
    },
    {
      "ref_id": "[76]",
      "original_data": {
        "ref_id": "[76]",
        "parsed": {
          "title": "A modified firefly algorithm-artificial neural network expert system for predicting compressive and tensile strength of high-performance concrete",
          "authors": [
            "D.K. Bui",
            "T. Nguyen",
            "J.S. Chou",
            "H. Nguyen-Xuan",
            "T.D. Ngo"
          ],
          "year": 2018,
          "venue": "Construction and Building Materials",
          "doi": "10.1016/j.conbuildmat.2018.05.201"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W2805257321",
        "title": "A modified firefly algorithm-artificial neural network expert system for predicting compressive and tensile strength of high-performance concrete",
        "display_name": "A modified firefly algorithm-artificial neural network expert system for predicting compressive and tensile strength of high-performance concrete",
        "year": 2018,
        "cited_by_count": 375,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.conbuildmat.2018.05.201",
        "url": "https://doi.org/10.1016/j.conbuildmat.2018.05.201",
        "authors": [
          {
            "display_name": "Dac-Khuong Bui"
          },
          {
            "display_name": "Tuan Ngoc Nguyen"
          },
          {
            "display_name": "Jui‐Sheng Chou"
          },
          {
            "display_name": "H. Nguyen‐Xuan"
          },
          {
            "display_name": "Tuan Ngo"
          }
        ],
        "venue": "Construction and Building Materials"
      }
    },
    {
      "ref_id": "[77]",
      "original_data": {
        "ref_id": "[77]",
        "parsed": {
          "title": "Ensemble machine learning model for corrosion initiation time estimation of embedded steel reinforced self-compacting concrete",
          "authors": [
            "B.A. Salami",
            "S.M. Rahman",
            "T.A. Oyehan",
            "M. Maslehuddin",
            "S.U. Al Dulaijan"
          ],
          "year": 2020,
          "venue": "Measurement: Journal of the International Measurement Confederation",
          "doi": "10.1016/j.measurement.2020.108141"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3037496014",
        "title": "Ensemble machine learning model for corrosion initiation time estimation of embedded steel reinforced self-compacting concrete",
        "display_name": "Ensemble machine learning model for corrosion initiation time estimation of embedded steel reinforced self-compacting concrete",
        "year": 2020,
        "cited_by_count": 94,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.measurement.2020.108141",
        "url": "https://doi.org/10.1016/j.measurement.2020.108141",
        "authors": [
          {
            "display_name": "Babatunde Abiodun Salami"
          },
          {
            "display_name": "Syed Masiur Rahman"
          },
          {
            "display_name": "Tajudeen A. Oyehan"
          },
          {
            "display_name": "Mohammed Maslehuddin"
          },
          {
            "display_name": "Salah U. Al Dulaijan"
          }
        ],
        "venue": "Measurement"
      }
    },
    {
      "ref_id": "[78]",
      "original_data": {
        "ref_id": "[78]",
        "parsed": {
          "title": "Prediction of surface chloride concentration of marine concrete using ensemble machine learning",
          "authors": [
            "R. Cai",
            "T. Han",
            "W. Liao",
            "J. Huang",
            "D. Li",
            "A. Kumar",
            "H. Ma"
          ],
          "year": 2020,
          "venue": "Cement and Concrete Research",
          "doi": "10.1016/j.cemconres.2020.106164"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3038415525",
        "title": "Prediction of surface chloride concentration of marine concrete using ensemble machine learning",
        "display_name": "Prediction of surface chloride concentration of marine concrete using ensemble machine learning",
        "year": 2020,
        "cited_by_count": 258,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.cemconres.2020.106164",
        "url": "https://doi.org/10.1016/j.cemconres.2020.106164",
        "authors": [
          {
            "display_name": "Rong Cai"
          },
          {
            "display_name": "Taihao Han"
          },
          {
            "display_name": "Wenyu Liao"
          },
          {
            "display_name": "Jie Huang"
          },
          {
            "display_name": "Dawang Li"
          },
          {
            "display_name": "Aditya Kumar"
          },
          {
            "display_name": "Hongyan Ma"
          }
        ],
        "venue": "Cement and Concrete Research"
      }
    },
    {
      "ref_id": "[79]",
      "original_data": {
        "ref_id": "[79]",
        "parsed": {
          "title": "Machine learning in concrete strength simulations: Multi-nation data analytics",
          "authors": [
            "J.S. Chou",
            "C.F. Tsai",
            "A.D. Pham",
            "Y.H. Lu"
          ],
          "year": 2014,
          "venue": "Construction and Building Materials",
          "doi": "10.1016/j.conbuildmat.2014.09.054"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W2038808304",
        "title": "Machine learning in concrete strength simulations: Multi-nation data analytics",
        "display_name": "Machine learning in concrete strength simulations: Multi-nation data analytics",
        "year": 2014,
        "cited_by_count": 428,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.conbuildmat.2014.09.054",
        "url": "https://doi.org/10.1016/j.conbuildmat.2014.09.054",
        "authors": [
          {
            "display_name": "Jui‐Sheng Chou"
          },
          {
            "display_name": "Chih‐Fong Tsai"
          },
          {
            "display_name": "Anh‐Duc Pham"
          },
          {
            "display_name": "Yu-Hsin Lu"
          }
        ],
        "venue": "Construction and Building Materials"
      }
    },
    {
      "ref_id": "[80]",
      "original_data": {
        "ref_id": "[80]",
        "parsed": {
          "title": "Modelling and prediction of binder content using latest intelligent machine learning algorithms in carbon fiber reinforced asphalt concrete",
          "authors": [
            "A. Upadhya",
            "M.S. Thakur",
            "P. Sihag",
            "R. Kumar",
            "S. Kumar",
            "A. Afeeza",
            "A. Afzal",
            "C. Ahamed Saleel"
          ],
          "year": 2023,
          "venue": "Alexandria Engineering Journal",
          "doi": "10.1016/j.aej.2022.09.055"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W4307042809",
        "title": "Modelling and prediction of binder content using latest intelligent machine learning algorithms in carbon fiber reinforced asphalt concrete",
        "display_name": "Modelling and prediction of binder content using latest intelligent machine learning algorithms in carbon fiber reinforced asphalt concrete",
        "year": 2022,
        "cited_by_count": 47,
        "is_retracted": false,
        "abstract": "In the present work, an attempt is made to find the most suitable prediction model for Marshall Stability and the optimistic Bitumen Content (BC) in carbon fiber reinforced asphalt concrete for flexible pavements by performing Marshall Stability tests. Further the prediction analysis is performed by taking the cognizance of the published research articles. Twofold approaches are adopted; first, to find the most suitable model to predict the Marshall Stability and second to obtain the optimum binder content responsible for the highest strength. Further, to find the most suitable model for closer prediction of Marshall Stability, eighteen input parameters i.e., Binder Content (BC with fifteen variations); 4.20%, 4.30%, 4.50%, 4.90%, 5.00%, 5.10%, 5.15%, 5.20%, 5.23%, 5.30%, 5.34%, 5.40%, 5.50%, 6.00%, 6.50%, and three others i.e., Carbon fiber, Bitumen grade and Fiber length are applied in the modelling algorithm. Five Machine learning techniques viz., Support Vector Machine, Gaussian Process, Random Forest, Random Tree, and M5P model were employed to find the most suitable prediction model. Seven statistical metrices i.e., Coefficient of correlation (CC), Mean absolute error (MAE), Root mean squared error (RMSE), Relative absolute error (RAE), Root relative squared error (RRSE), Willmott's index (WI), and Nash- Sutcliffe coefficient (NSE) were used to evaluate the performance of the applied models. After performing modelling analysis, it has been found that the Random Forest-based model is outperforming amongst all applied models with CC as 0.9735, MAE as 1.1755, RMSE as 1.5046, RAE as 25.68%, RRSE as 26.93%, WI values as 0.9351, and NSE values as 0.9272 in the testing stage. The Taylor diagram of the testing dataset also conforms to the results of RF-based model. The sensitivity analysis demonstrates that binder content (BC) of about 5.0% has a significant influence on the Marshall Stability in the asphalt mix used with carbon fibers.",
        "doi": "https://doi.org/10.1016/j.aej.2022.09.055",
        "url": "https://doi.org/10.1016/j.aej.2022.09.055",
        "authors": [
          {
            "display_name": "Ankita Upadhya"
          },
          {
            "display_name": "Mohindra Singh Thakur"
          },
          {
            "display_name": "Parveen Sihag"
          },
          {
            "display_name": "Raj Kumar"
          },
          {
            "display_name": "Sushil Kumar"
          },
          {
            "display_name": "Aysha Afeeza"
          },
          {
            "display_name": "Asif Afzal"
          },
          {
            "display_name": "C. Ahamed Saleel"
          }
        ],
        "venue": "Alexandria Engineering Journal"
      }
    },
    {
      "ref_id": "[81]",
      "original_data": {
        "ref_id": "[81]",
        "parsed": {
          "title": "Real-time measurement on dynamic temperature variation of asphalt pavement using machine learning",
          "authors": [
            "X. Wang",
            "P. Pan",
            "J. Li"
          ],
          "year": 2023,
          "venue": "Measurement: Journal of the International Measurement Confederation",
          "doi": "10.1016/j.measurement.2022.112413"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W4313343642",
        "title": "Real-time measurement on dynamic temperature variation of asphalt pavement using machine learning",
        "display_name": "Real-time measurement on dynamic temperature variation of asphalt pavement using machine learning",
        "year": 2022,
        "cited_by_count": 27,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.measurement.2022.112413",
        "url": "https://doi.org/10.1016/j.measurement.2022.112413",
        "authors": [
          {
            "display_name": "Xuefei Wang"
          },
          {
            "display_name": "Peng Pan"
          },
          {
            "display_name": "Jiale Li"
          }
        ],
        "venue": "Measurement"
      }
    },
    {
      "ref_id": "[82]",
      "original_data": {
        "ref_id": "[82]",
        "parsed": {
          "title": "Prediction of Interface Shear Stiffness Modulus of Asphalt Pavement using Bagging Ensemble-based Hybrid Machine Learning Model",
          "authors": [
            "Q.A.T. Bui",
            "D.D. Nguyen",
            "M. Iqbal",
            "F.E. Jalal",
            "I. Prakash",
            "B.T. Pham"
          ],
          "year": 2023,
          "venue": "Arabian Journal of Science and Engineering",
          "doi": "10.1007/s13369-023-08014-1"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4381511492",
        "title": "Prediction of Interface Shear Stiffness Modulus of Asphalt Pavement using Bagging Ensemble-based Hybrid Machine Learning Model",
        "display_name": "Prediction of Interface Shear Stiffness Modulus of Asphalt Pavement using Bagging Ensemble-based Hybrid Machine Learning Model",
        "year": 2023,
        "cited_by_count": 4,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1007/s13369-023-08014-1",
        "url": "https://doi.org/10.1007/s13369-023-08014-1",
        "authors": [
          {
            "display_name": "Quynh-Anh Thi Bui"
          },
          {
            "display_name": "Duc Dam Nguyen"
          },
          {
            "display_name": "Mudassir Iqbal"
          },
          {
            "display_name": "Fazal E. Jalal"
          },
          {
            "display_name": "Indra Prakash"
          },
          {
            "display_name": "Binh Thai Pham"
          }
        ],
        "venue": "Arabian Journal for Science and Engineering"
      }
    },
    {
      "ref_id": "[83]",
      "original_data": {
        "ref_id": "[83]",
        "parsed": {
          "title": "Machine learning based pavement performance prediction for data-driven decision of asphalt pavement overlay",
          "authors": [
            "J. Zhao",
            "H. Wang"
          ],
          "year": 2023,
          "venue": "Structural Engineering and Infrastructure Engineering",
          "doi": "10.1080/15732479.2023.2258498"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4387212008",
        "title": "Machine learning based pavement performance prediction for data-driven decision of asphalt pavement overlay",
        "display_name": "Machine learning based pavement performance prediction for data-driven decision of asphalt pavement overlay",
        "year": 2023,
        "cited_by_count": 17,
        "is_retracted": false,
        "abstract": "AbstractThis study is to develop pavement performance models using support vector regression and ensemble machine learning methods for selection of pavement overlay strategy. Predictive models of pavement distresses were developed based on the Long-Term Pavement Performance (LTPP) data and compared using support vector machine, random forest regression, gradient boosting machine, and stacking ensemble. Gradient boosting machine was found to be a more effective method to establish predictive models of rut depth and International Roughness Index. Stacking ensemble and random forest regression would provide reliable prediction of alligator cracking. The models developed based on the clusters of climate and traffic parameters were found to be more effective. Based on the developed performance models, the effects of asphalt overlays on pavement distresses and service lives were investigated. When the overlay with recycled asphalt concrete (AC) was applied, the propagation of alligator cracking was faster compared to the overlay with virgin asphalt mixture. Milling before overlay tended to slow the increase of IRI but fasten the development of rut depth.Keywords: Asphalt overlayclusteringdistresseslTPPmachine learningpavement performancerecycled asphalt concrete Disclosure statementNo potential conflict of interest was reported by the author(s).",
        "doi": "https://doi.org/10.1080/15732479.2023.2258498",
        "url": "https://doi.org/10.1080/15732479.2023.2258498",
        "authors": [
          {
            "display_name": "Jingnan Zhao"
          },
          {
            "display_name": "Hao Wang"
          }
        ],
        "venue": "Structure and Infrastructure Engineering"
      }
    },
    {
      "ref_id": "[84]",
      "original_data": {
        "ref_id": "[84]",
        "parsed": {
          "title": "Machine learning analysis of overweight traffic impact on survival life of asphalt pavement",
          "authors": [
            "J. Zhao",
            "H. Wang",
            "P. Lu"
          ],
          "year": 2023,
          "venue": "Structural Engineering and Infrastructure Engineering",
          "doi": "10.1080/15732479.2021.1961827"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Mismatch Flagged (Year diff: 2)",
      "external_metadata": {
        "id": "https://openalex.org/W3194258433",
        "title": "Machine learning analysis of overweight traffic impact on survival life of asphalt pavement",
        "display_name": "Machine learning analysis of overweight traffic impact on survival life of asphalt pavement",
        "year": 2021,
        "cited_by_count": 10,
        "is_retracted": false,
        "abstract": "The objective of this study is to quantify the impact of overweight traffic on asphalt pavement life using machine learning method for survival analysis. Traffic data and field distress measurements were collected from the long-term pavement performance (LTPP) database. A random survival forest algorithm was used to establish predictive models of load-related pavement distresses considering traffic loading, pavement structure, and climate. The variable importance approach was used to select the appropriate variables in the model and reduce prediction error. The findings indicated that the explanatory variables related to axle load spectra and traffic loading were significant in explaining pavement performance degradation. The derived models were further applied to estimate the survival probability curves of asphalt pavement life at different loading scenarios and evaluate the impact of overweight traffic on the reduction of pavement life. The reduction ratio of pavement life due to alligator cracking resulting from overweight traffic was found to be greater than those due to longitudinal cracking and rutting for all the pavement sections. The study findings indicate that the proposed random survival forest model is a promising approach for quantifying the impact of traffic loading on pavement life considering axle load spectra characteristics.",
        "doi": "https://doi.org/10.1080/15732479.2021.1961827",
        "url": "https://doi.org/10.1080/15732479.2021.1961827",
        "authors": [
          {
            "display_name": "Jingnan Zhao"
          },
          {
            "display_name": "Hao Wang"
          },
          {
            "display_name": "Pan Lu"
          }
        ],
        "venue": "Structure and Infrastructure Engineering"
      }
    },
    {
      "ref_id": "[85]",
      "original_data": {
        "ref_id": "[85]",
        "parsed": {
          "title": "OESV-KRF: Optimal ensemble support vector kernel random forest based early detection and classification of skin diseases",
          "authors": [
            "B. Kalpana",
            "A.K. Reshmy",
            "S. Senthil Pandi",
            "S. Dhanasekaran"
          ],
          "year": 2023,
          "venue": "Biomedical Signal Processing and Control",
          "doi": "10.1016/j.bspc.2023.104779"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4361216580",
        "title": "OESV-KRF: Optimal ensemble support vector kernel random forest based early detection and classification of skin diseases",
        "display_name": "OESV-KRF: Optimal ensemble support vector kernel random forest based early detection and classification of skin diseases",
        "year": 2023,
        "cited_by_count": 56,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.bspc.2023.104779",
        "url": "https://doi.org/10.1016/j.bspc.2023.104779",
        "authors": [
          {
            "display_name": "B. Kalpana"
          },
          {
            "display_name": "A K Reshmy"
          },
          {
            "display_name": "Senthil Pandi S"
          },
          {
            "display_name": "S. Dhanasekaran"
          }
        ],
        "venue": "Biomedical Signal Processing and Control"
      }
    },
    {
      "ref_id": "[86]",
      "original_data": {
        "ref_id": "[86]",
        "parsed": {
          "title": "Application of logistic regression, support vector machine and random forest on the effects of titanium dioxide nanoparticles using macroalgae in treatment of certain risk factors associated with kidney injuries",
          "authors": [
            "J. Tu",
            "L. Hu",
            "K.J. Mohammed",
            "B.N. Le",
            "P. Chen",
            "E. Ali",
            "H.E. Ali",
            "L. Sun"
          ],
          "year": 2023,
          "venue": "Environmental Research",
          "doi": "10.1016/j.envres.2022.115167"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W4312201162",
        "title": "Application of logistic regression, support vector machine and random forest on the effects of titanium dioxide nanoparticles using macroalgae in treatment of certain risk factors associated with kidney injuries",
        "display_name": "Application of logistic regression, support vector machine and random forest on the effects of titanium dioxide nanoparticles using macroalgae in treatment of certain risk factors associated with kidney injuries",
        "year": 2022,
        "cited_by_count": 11,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.envres.2022.115167",
        "url": "https://doi.org/10.1016/j.envres.2022.115167",
        "authors": [
          {
            "display_name": "Jianxin Tu"
          },
          {
            "display_name": "Lingzhen Hu"
          },
          {
            "display_name": "Khidhair Jasim Mohammed"
          },
          {
            "display_name": "Binh Nguyen Le"
          },
          {
            "display_name": "Peirong Chen"
          },
          {
            "display_name": "Elimam Ali"
          },
          {
            "display_name": "H. Elhosiny Ali"
          },
          {
            "display_name": "Li Sun"
          }
        ],
        "venue": "Environmental Research"
      }
    },
    {
      "ref_id": "[87]",
      "original_data": {
        "ref_id": "[87]",
        "parsed": {
          "title": "Random forest algorithm and support vector machine for nondestructive assessment of mass moisture content of brick walls in historic buildings",
          "authors": [
            "A. Ho ł a",
            "S. Czarnecki"
          ],
          "year": 2023,
          "venue": "Automation in Construction",
          "doi": "10.1016/j.autcon.2023.104793"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4321354593",
        "title": "Random forest algorithm and support vector machine for nondestructive assessment of mass moisture content of brick walls in historic buildings",
        "display_name": "Random forest algorithm and support vector machine for nondestructive assessment of mass moisture content of brick walls in historic buildings",
        "year": 2023,
        "cited_by_count": 40,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.autcon.2023.104793",
        "url": "https://doi.org/10.1016/j.autcon.2023.104793",
        "authors": [
          {
            "display_name": "Anna Hoła"
          },
          {
            "display_name": "Sławomir Czarnecki"
          }
        ],
        "venue": "Automation in Construction"
      }
    },
    {
      "ref_id": "[88]",
      "original_data": {
        "ref_id": "[88]",
        "parsed": {
          "title": "Prediction of Compressive Strength of Fly Ash Based Concrete Using Individual and Ensemble Algorithm",
          "authors": [
            "A. Ahmad",
            "F. Farooq",
            "P. Niewiadomski",
            "K. Ostrowski",
            "A. Akbar",
            "F. Aslam",
            "R. Alyousef",
            "A.A. Hk"
          ],
          "year": 2021,
          "venue": "Materials (Basel)",
          "doi": "10.3390/ma14040794"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3126997349",
        "title": "Prediction of Compressive Strength of Fly Ash Based Concrete Using Individual and Ensemble Algorithm",
        "display_name": "Prediction of Compressive Strength of Fly Ash Based Concrete Using Individual and Ensemble Algorithm",
        "year": 2021,
        "cited_by_count": 252,
        "is_retracted": false,
        "abstract": "Machine learning techniques are widely used algorithms for predicting the mechanical properties of concrete. This study is based on the comparison of algorithms between individuals and ensemble approaches, such as bagging. Optimization for bagging is done by making 20 sub-models to depict the accurate one. Variables like cement content, fine and coarse aggregate, water, binder-to-water ratio, fly-ash, and superplasticizer are used for modeling. Model performance is evaluated by various statistical indicators like mean absolute error (MAE), mean square error (MSE), and root mean square error (RMSE). Individual algorithms show a moderate bias result. However, the ensemble model gives a better result with R2 = 0.911 compared to the decision tree (DT) and gene expression programming (GEP). K-fold cross-validation confirms the model’s accuracy and is done by R2, MAE, MSE, and RMSE. Statistical checks reveal that the decision tree with ensemble provides 25%, 121%, and 49% enhancement for errors like MAE, MSE, and RMSE between the target and outcome response.",
        "doi": "https://doi.org/10.3390/ma14040794",
        "url": "https://doi.org/10.3390/ma14040794",
        "authors": [
          {
            "display_name": "Ayaz Ahmad"
          },
          {
            "display_name": "Furqan Farooq"
          },
          {
            "display_name": "Paweł Niewiadomski"
          },
          {
            "display_name": "Krzysztof Adam Ostrowski"
          },
          {
            "display_name": "Arslan Akbar"
          },
          {
            "display_name": "Fahid Aslam"
          },
          {
            "display_name": "Rayed Alyousef"
          }
        ],
        "venue": "Materials"
      }
    },
    {
      "ref_id": "[89]",
      "original_data": {
        "ref_id": "[89]",
        "parsed": {
          "title": "Behavior assessment, regression analysis and support vector machine (SVM) modeling of waste tire rubberized concrete",
          "authors": [
            "M. Jalal",
            "P. Arabali",
            "Z. Grasley",
            "J.W. Bullard",
            "H. Jalal"
          ],
          "year": 2020,
          "venue": "Journal of Cleaner Production",
          "doi": "10.1016/j.jclepro.2020.122960"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3043257533",
        "title": "RETRACTED: Behavior assessment, regression analysis and support vector machine (SVM) modeling of waste tire rubberized concrete",
        "display_name": "RETRACTED: Behavior assessment, regression analysis and support vector machine (SVM) modeling of waste tire rubberized concrete",
        "year": 2020,
        "cited_by_count": 63,
        "is_retracted": true,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.jclepro.2020.122960",
        "url": "https://doi.org/10.1016/j.jclepro.2020.122960",
        "authors": [
          {
            "display_name": "Mostafa Jalal"
          },
          {
            "display_name": "Hamid Jalal"
          }
        ],
        "venue": "Journal of Cleaner Production"
      }
    },
    {
      "ref_id": "[90]",
      "original_data": {
        "ref_id": "[90]",
        "parsed": {
          "title": "A review on applications of ANN and SVM for building electrical energy consumption forecasting",
          "authors": [
            "A.S. Ahmad",
            "M.Y. Hassan",
            "M.P. Abdullah",
            "H.A. Rahman",
            "F. Hussin",
            "H. Abdullah",
            "R. Saidur"
          ],
          "year": 2014,
          "venue": "Renewable and Sustainable Energy Reviews",
          "doi": "10.1016/J.RSER.2014.01.069"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W2091693228",
        "title": "A review on applications of ANN and SVM for building electrical energy consumption forecasting",
        "display_name": "A review on applications of ANN and SVM for building electrical energy consumption forecasting",
        "year": 2014,
        "cited_by_count": 926,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.rser.2014.01.069",
        "url": "https://doi.org/10.1016/j.rser.2014.01.069",
        "authors": [
          {
            "display_name": "Ahmad Sukri Ahmad"
          },
          {
            "display_name": "Mohammad Yusri Hassan"
          },
          {
            "display_name": "Md Pauzi Abdullah"
          },
          {
            "display_name": "Hasimah Abdul Rahman"
          },
          {
            "display_name": "Faridah Hussin"
          },
          {
            "display_name": "Hayati Abdullah"
          },
          {
            "display_name": "R. Saidur"
          }
        ],
        "venue": "Renewable and Sustainable Energy Reviews"
      }
    },
    {
      "ref_id": "[91]",
      "original_data": {
        "ref_id": "[91]",
        "parsed": {
          "title": "Modeling and uncertainty analysis of groundwater level using six evolutionary optimization algorithms hybridized with ANFIS, SVM, and ANN",
          "authors": [
            "A. Seifi",
            "M. Ehteram",
            "V.P. Singh",
            "A. Mosavi"
          ],
          "year": 2020,
          "venue": "Sustainability",
          "doi": "10.3390/SU12104023"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3024514109",
        "title": "Modeling and Uncertainty Analysis of Groundwater Level Using Six Evolutionary Optimization Algorithms Hybridized with ANFIS, SVM, and ANN",
        "display_name": "Modeling and Uncertainty Analysis of Groundwater Level Using Six Evolutionary Optimization Algorithms Hybridized with ANFIS, SVM, and ANN",
        "year": 2020,
        "cited_by_count": 131,
        "is_retracted": false,
        "abstract": "In the present study, six meta-heuristic schemes are hybridized with artificial neural network (ANN), adaptive neuro-fuzzy interface system (ANFIS), and support vector machine (SVM), to predict monthly groundwater level (GWL), evaluate uncertainty analysis of predictions and spatial variation analysis. The six schemes, including grasshopper optimization algorithm (GOA), cat swarm optimization (CSO), weed algorithm (WA), genetic algorithm (GA), krill algorithm (KA), and particle swarm optimization (PSO), were used to hybridize for improving the performance of ANN, SVM, and ANFIS models. Groundwater level (GWL) data of Ardebil plain (Iran) for a period of 144 months were selected to evaluate the hybrid models. The pre-processing technique of principal component analysis (PCA) was applied to reduce input combinations from monthly time series up to 12-month prediction intervals. The results showed that the ANFIS-GOA was superior to the other hybrid models for predicting GWL in the first piezometer (RMSE:1.21, MAE:0.878, NSE:0.93, PBIAS:0.15, R2:0.93), second piezometer (RMSE:1.22, MAE:0.881, NSE:0.92, PBIAS:0.17, R2:0.94), and third piezometer (RMSE:1.23, MAE:0.911, NSE:0.91, PBIAS:0.19, R2:0.94) in the testing stage. The performance of hybrid models with optimization algorithms was far better than that of classical ANN, ANFIS, and SVM models without hybridization. The percent of improvements in the ANFIS-GOA versus standalone ANFIS in piezometer 10 were 14.4%, 3%, 17.8%, and 181% for RMSE, MAE, NSE, and PBIAS in training stage and 40.7%, 55%, 25%, and 132% in testing stage, respectively. The improvements for piezometer 6 in train step were 15%, 4%, 13%, and 208% and in test step were 33%, 44.6%, 16.3%, and 173%, respectively, that clearly confirm the superiority of developed hybridization schemes in GWL modelling. Uncertainty analysis showed that ANFIS-GOA and SVM had, respectively, the best and worst performances among other models. In general, GOA enhanced the accuracy of the ANFIS, ANN, and SVM models.",
        "doi": "https://doi.org/10.3390/su12104023",
        "url": "https://doi.org/10.3390/su12104023",
        "authors": [
          {
            "display_name": "Akram Seifi"
          },
          {
            "display_name": "Mohammad Ehteram"
          },
          {
            "display_name": "Vijay P. Singh"
          },
          {
            "display_name": "Amir Mosavi"
          }
        ],
        "venue": "Sustainability"
      }
    },
    {
      "ref_id": "[92]",
      "original_data": {
        "ref_id": "[92]",
        "parsed": {
          "title": "Linear and non-linear SVM prediction for fresh properties and compressive strength of high volume fly ash self-compacting concrete",
          "authors": [
            "M. Azimi-Pour",
            "H. Eskandari-Naddaf",
            "A. Pakzad"
          ],
          "year": 2020,
          "venue": "Construction and Building Materials",
          "doi": "10.1016/j.conbuildmat.2019.117021"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W2977280727",
        "title": "Linear and non-linear SVM prediction for fresh properties and compressive strength of high volume fly ash self-compacting concrete",
        "display_name": "Linear and non-linear SVM prediction for fresh properties and compressive strength of high volume fly ash self-compacting concrete",
        "year": 2019,
        "cited_by_count": 227,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.conbuildmat.2019.117021",
        "url": "https://doi.org/10.1016/j.conbuildmat.2019.117021",
        "authors": [
          {
            "display_name": "Mohammad Azimi-Pour"
          },
          {
            "display_name": "Hamid Eskandari‐Naddaf"
          },
          {
            "display_name": "Amir Pakzad"
          }
        ],
        "venue": "Construction and Building Materials"
      }
    },
    {
      "ref_id": "[93]",
      "original_data": {
        "ref_id": "[93]",
        "parsed": {
          "title": "Prediction of peak particle velocity caused by blasting through the combinations of boosted-chaid and svm models with various kernels",
          "authors": [
            "J. Zeng",
            "P.C. Roussis",
            "A.S. Mohammed",
            "C. Maraveas",
            "S.A. Fatemi",
            "D.J. Armaghani",
            "P.G. Asteris"
          ],
          "year": 2021,
          "venue": "Applied Sciences",
          "doi": "10.3390/app11083705"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3153085477",
        "title": "Prediction of Peak Particle Velocity Caused by Blasting through the Combinations of Boosted-CHAID and SVM Models with Various Kernels",
        "display_name": "Prediction of Peak Particle Velocity Caused by Blasting through the Combinations of Boosted-CHAID and SVM Models with Various Kernels",
        "year": 2021,
        "cited_by_count": 48,
        "is_retracted": false,
        "abstract": "This research examines the feasibility of hybridizing boosted Chi-Squared Automatic Interaction Detection (CHAID) with different kernels of support vector machine (SVM) techniques for the prediction of the peak particle velocity (PPV) induced by quarry blasting. To achieve this objective, a boosting-CHAID technique was applied to a big experimental database comprising six input variables. The technique identified four input parameters (distance from blast-face, stemming length, powder factor, and maximum charge per delay) as the most significant parameters affecting the prediction accuracy and utilized them to propose the SVM models with various kernels. The kernel types used in this study include radial basis function, polynomial, sigmoid, and linear. Several criteria, including mean absolute error (MAE), correlation coefficient (R), and gains, were calculated to evaluate the developed models’ accuracy and applicability. In addition, a simple ranking system was used to evaluate the models’ performance systematically. The performance of the R and MAE index of the radial basis function kernel of SVM in training and testing phases, respectively, confirm the high capability of this SVM kernel in predicting PPV values. This study successfully demonstrates that a combination of boosting-CHAID and SVM models can identify and predict with a high level of accuracy the most effective parameters affecting PPV values.",
        "doi": "https://doi.org/10.3390/app11083705",
        "url": "https://doi.org/10.3390/app11083705",
        "authors": [
          {
            "display_name": "Jie Zeng"
          },
          {
            "display_name": "Panayiotis C. Roussis"
          },
          {
            "display_name": "Ahmed Salih Mohammed"
          },
          {
            "display_name": "Chrysanthos Maraveas"
          },
          {
            "display_name": "Seyed Alireza Fatemi"
          },
          {
            "display_name": "Danial Jahed Armaghani"
          },
          {
            "display_name": "Panagiotis G. Asteris"
          }
        ],
        "venue": "Applied Sciences"
      }
    },
    {
      "ref_id": "[94]",
      "original_data": {
        "ref_id": "[94]",
        "parsed": {
          "title": "Gradient boosting-based regression modelling for estimating the time period of the irregular precast concrete structural system with cross bracing",
          "authors": [
            "N. Dahiya",
            "B. Saini",
            "H.D. Chalak"
          ],
          "year": 2021,
          "venue": "Journal of King Saud University - Engineering Sciences",
          "doi": "10.1016/j.jksues.2021.08.004"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3168672392",
        "title": "Gradient boosting-based regression modelling for estimating the time period of the irregular precast concrete structural system with cross bracing",
        "display_name": "Gradient boosting-based regression modelling for estimating the time period of the irregular precast concrete structural system with cross bracing",
        "year": 2021,
        "cited_by_count": 2,
        "is_retracted": false,
        "abstract": "Abstract Regression tree, random forest, bagging and gradient boosting regression-based modelling techniques were used to estimate the time period of precast concrete frame structures with vertical irregularity and cross-bracing using 756 Etabs models. This paper thoroughly explored the efficacy of random forest, regression tree, bagging, gradient boosting-based modelling using RStudio. The time period has been the output parameter while the number of cross-bracing, column size, beam size, soft storey, irregularity coefficient and height of the building has been assigned as input parameters. The accuracy of machine learning techniques has been checked by reference to the formulas published in the literature. A compar- ison of results indicates that the gradient boosting-based regression approach performed well as com- pared to random forest regression, bagging and regression tree.",
        "doi": "https://doi.org/10.1007/s44444-025-00073-z",
        "url": "https://doi.org/10.1007/s44444-025-00073-z",
        "authors": [
          {
            "display_name": "Nitin Dahiya"
          },
          {
            "display_name": "Babita Saini"
          },
          {
            "display_name": "H. D. Chalak"
          }
        ],
        "venue": "Journal of King Saud University - Engineering Sciences"
      }
    },
    {
      "ref_id": "[95]",
      "original_data": {
        "ref_id": "[95]",
        "parsed": {
          "title": "An ensemble machine learning approach for prediction and optimization of modulus of elasticity of recycled aggregate concrete",
          "authors": [
            "T. Han",
            "A. Siddique",
            "K. Khayat",
            "J. Huang",
            "A. Kumar"
          ],
          "year": 2020,
          "venue": "Construction and Building Materials",
          "doi": "10.1016/j.conbuildmat.2020.118271"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3008008902",
        "title": "An ensemble machine learning approach for prediction and optimization of modulus of elasticity of recycled aggregate concrete",
        "display_name": "An ensemble machine learning approach for prediction and optimization of modulus of elasticity of recycled aggregate concrete",
        "year": 2020,
        "cited_by_count": 215,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.conbuildmat.2020.118271",
        "url": "https://doi.org/10.1016/j.conbuildmat.2020.118271",
        "authors": [
          {
            "display_name": "Taihao Han"
          },
          {
            "display_name": "Ashfia Siddique"
          },
          {
            "display_name": "Kamal H. Khayat"
          },
          {
            "display_name": "Jie Huang"
          },
          {
            "display_name": "Aditya Kumar"
          }
        ],
        "venue": "Construction and Building Materials"
      }
    },
    {
      "ref_id": "[96]",
      "original_data": {
        "ref_id": "[96]",
        "parsed": {
          "title": "Strength prediction models for recycled aggregate concrete using Random Forests, ANN and LASSO",
          "authors": [
            "S.S. Rizvon",
            "K. Jayakumar"
          ],
          "year": 2022,
          "venue": "Journal of Building Pathology and Rehabilitation",
          "doi": "10.1007/s41024-021-00145-y"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Acceptable Variance (±1 Year)",
      "external_metadata": {
        "id": "https://openalex.org/W4200482198",
        "title": "Strength prediction models for recycled aggregate concrete using Random Forests, ANN and LASSO",
        "display_name": "Strength prediction models for recycled aggregate concrete using Random Forests, ANN and LASSO",
        "year": 2021,
        "cited_by_count": 28,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1007/s41024-021-00145-y",
        "url": "https://doi.org/10.1007/s41024-021-00145-y",
        "authors": [
          {
            "display_name": "Shamili Syed Rizvon"
          },
          {
            "display_name": "J. Karthikeyan"
          }
        ],
        "venue": "Journal of Building Pathology and Rehabilitation"
      }
    },
    {
      "ref_id": "[97]",
      "original_data": {
        "ref_id": "[97]",
        "parsed": {
          "title": "Prediction of concrete mix strength using random forest model",
          "authors": [
            "A. Shaqadan"
          ],
          "year": 2016,
          "venue": null,
          "doi": null
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Mismatch Flagged (Title Similarity: 60%)",
      "external_metadata": {
        "id": "https://openalex.org/W4285801958",
        "title": "Prediction of Mechanical Strength by Using an Artificial Neural Network and Random Forest Algorithm",
        "display_name": "Prediction of Mechanical Strength by Using an Artificial Neural Network and Random Forest Algorithm",
        "year": 2022,
        "cited_by_count": 84,
        "is_retracted": false,
        "abstract": "Geopolymer concrete could be the best alternative to ordinary Portland cement concrete due to its higher performance in any severe condition. It reduces the carbon footprints to a very higher level. Machine learning methods are the future of the construction industry because it predicts the mechanical strengths of concrete mix design on the basis of their constituents without destructive test conduction. This study is aimed at developing the models to predict the mechanical strengths and validate them with the actual results. After the experimental investigation, we found the results of the mechanical (including compressive, splitting tensile, and flexural tensile) strength. The M2 mix of geopolymer concrete got the highest mechanical strengths whereas the M5 mix gets the lowest mechanical strengths among all the mix designs. The machine learning methods ANN (artificial neural network) and random forest are used to develop the models based on mixed experimental results. Mechanical strength results are taken as outputs, and mixed constituents are taken as inputs for training and testing. The performance of predicted results is checked based on R 2 , MAE (mean absolute error), RMSE (relative mean square error), RAE (relative absolute error), and RRSE (root‐relative square error). Random forest models show the best prediction to the ANN models because it shows the negligible error between actual and predicted values. The R 2 value is 1 of 12 predicted results out of 15 by the use of random forest methods. So it is most suitable to predict the strength of geopolymer concrete based on their constituent’s material quantity.",
        "doi": "https://doi.org/10.1155/2022/7791582",
        "url": "https://doi.org/10.1155/2022/7791582",
        "authors": [
          {
            "display_name": "Kamal Upreti"
          },
          {
            "display_name": "Manvendra Verma"
          },
          {
            "display_name": "Meena Agrawal"
          },
          {
            "display_name": "Jatinder Garg"
          },
          {
            "display_name": "Rekha Kaushik"
          },
          {
            "display_name": "Chinmay Agrawal"
          },
          {
            "display_name": "Divakar Singh"
          },
          {
            "display_name": "Rajamani Narayanasamy"
          }
        ],
        "venue": "Journal of Nanomaterials"
      }
    },
    {
      "ref_id": "[98]",
      "original_data": {
        "ref_id": "[98]",
        "parsed": {
          "title": "On fine-tuning deep learning models using transfer learning and hyper-parameters optimization for disease identification in maize leaves",
          "authors": [
            "M. Subramanian",
            "K. Shanmugavadivel",
            "P.S. Nandhini"
          ],
          "year": 2022,
          "venue": "Neural Computing and Applications",
          "doi": "10.1007/s00521-022-07246-w"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4224085183",
        "title": "On fine-tuning deep learning models using transfer learning and hyper-parameters optimization for disease identification in maize leaves",
        "display_name": "On fine-tuning deep learning models using transfer learning and hyper-parameters optimization for disease identification in maize leaves",
        "year": 2022,
        "cited_by_count": 121,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1007/s00521-022-07246-w",
        "url": "https://doi.org/10.1007/s00521-022-07246-w",
        "authors": [
          {
            "display_name": "Malliga Subramanian"
          },
          {
            "display_name": "Kogilavani Shanmugavadivel"
          },
          {
            "display_name": "P Nandhini"
          }
        ],
        "venue": "Neural Computing and Applications"
      }
    },
    {
      "ref_id": "[99]",
      "original_data": {
        "ref_id": "[99]",
        "parsed": {
          "title": "Intelligent fault diagnosis of rotary machinery by convolutional neural network with automatic hyper-parameters tuning using bayesian optimization",
          "authors": [
            "D. Kolar",
            "D. Lisjak",
            "M. Pajak?",
            "M. Gudlin"
          ],
          "year": 2021,
          "venue": "Sensors",
          "doi": "10.3390/s21072411"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3146977894",
        "title": "Intelligent Fault Diagnosis of Rotary Machinery by Convolutional Neural Network with Automatic Hyper-Parameters Tuning Using Bayesian Optimization",
        "display_name": "Intelligent Fault Diagnosis of Rotary Machinery by Convolutional Neural Network with Automatic Hyper-Parameters Tuning Using Bayesian Optimization",
        "year": 2021,
        "cited_by_count": 79,
        "is_retracted": false,
        "abstract": "Intelligent fault diagnosis can be related to applications of machine learning theories to machine fault diagnosis. Although there is a large number of successful examples, there is a gap in the optimization of the hyper-parameters of the machine learning model, which ultimately has a major impact on the performance of the model. Machine learning experts are required to configure a set of hyper-parameter values manually. This work presents a convolutional neural network based data-driven intelligent fault diagnosis technique for rotary machinery which uses model with optimized hyper-parameters and network structure. The proposed technique input raw three axes accelerometer signal as high definition 1-D data into deep learning layers with optimized hyper-parameters. Input is consisted of wide 12,800 × 1 × 3 vibration signal matrix. Model learning phase includes Bayesian optimization that optimizes hyper-parameters of the convolutional neural network. Finally, by using a Convolutional Neural Network (CNN) model with optimized hyper-parameters, classification in one of the 8 different machine states and 2 rotational speeds can be performed. This study accomplished the effective classification of different rotary machinery states in different rotational speeds using optimized convolutional artificial neural network for classification of raw three axis accelerometer signal input. Overall classification accuracy of 99.94% on evaluation set is obtained with the CNN model based on 19 layers. Additionally, more data are collected on the same machine with altered bearings to test the model for overfitting. Result of classification accuracy of 100% on second evaluation set has been achieved, proving the potential of using the proposed technique.",
        "doi": "https://doi.org/10.3390/s21072411",
        "url": "https://doi.org/10.3390/s21072411",
        "authors": [
          {
            "display_name": "Davor Kolar"
          },
          {
            "display_name": "Dragutin Lisjak"
          },
          {
            "display_name": "Michał Pająk"
          },
          {
            "display_name": "Mihael Gudlin"
          }
        ],
        "venue": "Sensors"
      }
    },
    {
      "ref_id": "[100]",
      "original_data": {
        "ref_id": "[100]",
        "parsed": {
          "title": "Prediction of interface yield stress and plastic viscosity of fresh concrete using a hybrid machine learning approach",
          "authors": [
            "T.D. Nguyen",
            "T.H. Tran",
            "N.D. Hoang"
          ],
          "year": 2020,
          "venue": "Advances in Engineering Informatics",
          "doi": "10.1016/j.aei.2020.101057"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3008932423",
        "title": "Prediction of interface yield stress and plastic viscosity of fresh concrete using a hybrid machine learning approach",
        "display_name": "Prediction of interface yield stress and plastic viscosity of fresh concrete using a hybrid machine learning approach",
        "year": 2020,
        "cited_by_count": 64,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.aei.2020.101057",
        "url": "https://doi.org/10.1016/j.aei.2020.101057",
        "authors": [
          {
            "display_name": "Thê-Duong Nguyen"
          },
          {
            "display_name": "Thu-Hien Tran"
          },
          {
            "display_name": "Nhat‐Duc Hoang"
          }
        ],
        "venue": "Advanced Engineering Informatics"
      }
    },
    {
      "ref_id": "[101]",
      "original_data": {
        "ref_id": "[101]",
        "parsed": {
          "title": "Ensemble Machine Learning approach for evaluating the material characterization of carbon nanotube-reinforced cementitious composites",
          "authors": [
            "F. Bagherzadeh",
            "T. Shafighfard"
          ],
          "year": 2022,
          "venue": "Case Studies in Construction Materials",
          "doi": "10.1016/j.cscm.2022.e01537"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W4303444766",
        "title": "Ensemble Machine Learning approach for evaluating the material characterization of carbon nanotube-reinforced cementitious composites",
        "display_name": "Ensemble Machine Learning approach for evaluating the material characterization of carbon nanotube-reinforced cementitious composites",
        "year": 2022,
        "cited_by_count": 63,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.cscm.2022.e01537",
        "url": "https://doi.org/10.1016/j.cscm.2022.e01537",
        "authors": [
          {
            "display_name": "Faramarz Bagherzadeh"
          },
          {
            "display_name": "Torkan Shafighfard"
          }
        ],
        "venue": "Case Studies in Construction Materials"
      }
    },
    {
      "ref_id": "[102]",
      "original_data": {
        "ref_id": "[102]",
        "parsed": {
          "title": "Multi-objective design optimization for graphite-based nanomaterials reinforced cementitious composites: A data-driven method with machine learning and NSGA-II",
          "authors": [
            "W. Dong",
            "Y. Huang",
            "B. Lehane",
            "G. Ma"
          ],
          "year": 2022,
          "venue": "Construction and Building Materials",
          "doi": "10.1016/j.conbuildmat.2022.127198"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Mismatch Flagged (Title Similarity: 51%)",
      "external_metadata": {
        "id": "https://openalex.org/W4391560002",
        "title": "Forecasting the strength of graphene nanoparticles-reinforced cementitious composites using ensemble learning algorithms",
        "display_name": "Forecasting the strength of graphene nanoparticles-reinforced cementitious composites using ensemble learning algorithms",
        "year": 2024,
        "cited_by_count": 42,
        "is_retracted": false,
        "abstract": "Contemporary infrastructure requires structural elements with enhanced mechanical strength and durability. Integrating nanomaterials into concrete is a promising solution to improve concrete strength and durability. However, the intricacies of such nanoscale cementitious composites are highly complex. Traditional regression models encounter limitations in capturing these intricate compositions to provide accurate and reliable estimations. This study focuses on developing robust prediction models for the compressive strength (CS) of graphene nanoparticle-reinforced cementitious composites (GrNCC) through machine learning (ML) algorithms. Three ML models, bagging regressor (BR), decision tree (DT), and AdaBoost regressor (AR), were employed to predict CS based on a comprehensive dataset of 172 experimental values. Seven input parameters, including graphite nanoparticle (GrN) diameter, water-to-cement ratio (wc), GrN content (GC), ultrasonication (US), sand content (SC), curing age (CA), and GrN thickness (GT), were considered. The models were trained with 70 % of the data, and the remaining 30 % of the data was used for testing the models. Statistical metrics such as mean absolute error (MAE), root mean square error (RMSE) and correlation coefficient (R) were employed to assess the predictive accuracy of the models. The DT and AR models demonstrated exceptional accuracy, yielding high correlation coefficients of 0.983 and 0.979 for training, and 0.873 and 0.822 for testing, respectively. Shapley Additive exPlanation (SHAP) analysis highlighted the influential role of curing age and GrN thickness (GT), positively impacting CS, while an increased water-to-cement ratio (w/c) negatively affected CS. This study showcases the efficacy of ML techniques in accurately predicting CS of graphene nanoparticle-modified concrete, offering a swift and cost-effective approach for assessing nanomaterial impact on concrete strength and reducing reliance on time-consuming and expensive experiments.",
        "doi": "https://doi.org/10.1016/j.rineng.2024.101837",
        "url": "https://doi.org/10.1016/j.rineng.2024.101837",
        "authors": [
          {
            "display_name": "Majid Khan"
          },
          {
            "display_name": "Roz‐Ud‐Din Nassar"
          },
          {
            "display_name": "Waqar Anwar"
          },
          {
            "display_name": "Mazhar Rasheed"
          },
          {
            "display_name": "Taoufik Najeh"
          },
          {
            "display_name": "Yaser Gamil"
          },
          {
            "display_name": "Furqan Farooq"
          }
        ],
        "venue": "Results in Engineering"
      }
    },
    {
      "ref_id": "[103]",
      "original_data": {
        "ref_id": "[103]",
        "parsed": {
          "title": "Sustainable utilization of foundry waste: Forecasting mechanical properties of foundry sand based concrete using multi-expression programming",
          "authors": [
            "M.F. Iqbal",
            "M.F. Javed",
            "M. Rauf",
            "I. Azim",
            "M. Ashraf",
            "J. Yang",
            "Q. feng Liu"
          ],
          "year": 2021,
          "venue": "Science of the Total Environment",
          "doi": "10.1016/j.scitotenv.2021.146524"
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W3136814736",
        "title": "Sustainable utilization of foundry waste: Forecasting mechanical properties of foundry sand based concrete using multi-expression programming",
        "display_name": "Sustainable utilization of foundry waste: Forecasting mechanical properties of foundry sand based concrete using multi-expression programming",
        "year": 2021,
        "cited_by_count": 161,
        "is_retracted": false,
        "abstract": null,
        "doi": "https://doi.org/10.1016/j.scitotenv.2021.146524",
        "url": "https://doi.org/10.1016/j.scitotenv.2021.146524",
        "authors": [
          {
            "display_name": "Muhammad Farjad Iqbal"
          },
          {
            "display_name": "Muhammad Faisal Javed"
          },
          {
            "display_name": "Momina Rauf"
          },
          {
            "display_name": "Iftikhar Azim"
          },
          {
            "display_name": "Muhammad Ashraf"
          },
          {
            "display_name": "Jian Yang"
          },
          {
            "display_name": "Qingfeng Liu"
          }
        ],
        "venue": "The Science of The Total Environment"
      }
    },
    {
      "ref_id": "[104]",
      "original_data": {
        "ref_id": "[104]",
        "parsed": {
          "title": "Model evaluation guidelines for systematic quantification of accuracy in watershed simulations",
          "authors": [
            "D.N. Moriasi",
            "J.G. Arnold",
            "M.W. Van Liew",
            "R.L. Bingner",
            "R.D. Harmel",
            "T.L. Veith"
          ],
          "year": 2007,
          "venue": "Transactions of the ASABE",
          "doi": null
        }
      },
      "enrichment_status": "success",
      "consistency_status": "Match",
      "external_metadata": {
        "id": "https://openalex.org/W2058998445",
        "title": "Model Evaluation Guidelines for Systematic Quantification of Accuracy in Watershed Simulations",
        "display_name": "Model Evaluation Guidelines for Systematic Quantification of Accuracy in Watershed Simulations",
        "year": 2007,
        "cited_by_count": 12689,
        "is_retracted": false,
        "abstract": "Watershed models are powerful tools for simulating the effect of watershed processes and management on soil and water resources. However, no comprehensive guidance is available to facilitate model evaluation in terms of the accuracy of simulated data compared to measured flow and constituent values. Thus, the objectives of this research were to: (1) determine recommended model evaluation techniques (statistical and graphical), (2) review reported ranges of values and corresponding performance ratings for the recommended statistics, and (3) establish guidelines for model evaluation based on the review results and project-specific considerations; all of these objectives focus on simulation of streamflow and transport of sediment and nutrients. These objectives were achieved with a thorough review of relevant literature on model application and recommended model evaluation methods. Based on this analysis, we recommend that three quantitative statistics, Nash-Sutcliffe efficiency (NSE), percent bias (PBIAS), and ratio of the root mean square error to the standard deviation of measured data (RSR), in addition to the graphical techniques, be used in model evaluation. The following model evaluation performance ratings were established for each recommended statistic. In general, model simulation can be judged as satisfactory if NSE > 0.50 and RSR < 0.70, and if PBIAS + 25% for streamflow, PBIAS + 55% for sediment, and PBIAS + 70% for N and P. For PBIAS, constituent-specific performance ratings were determined based on uncertainty of measured data. Additional considerations related to model evaluation guidelines are also discussed. These considerations include: single-event simulation, quality and quantity of measured data, model calibration procedure, evaluation time step, and project scope and magnitude. A case study illustrating the application of the model evaluation guidelines is also provided.",
        "doi": "https://doi.org/10.13031/2013.23153",
        "url": "https://doi.org/10.13031/2013.23153",
        "authors": [
          {
            "display_name": "Daniel N. Moriasi"
          },
          {
            "display_name": "J. G. Arnold"
          },
          {
            "display_name": "M. W. Van Liew"
          },
          {
            "display_name": "Ronald L. Bingner"
          },
          {
            "display_name": "R. Daren Harmel"
          },
          {
            "display_name": "Tamie L. Veith"
          }
        ],
        "venue": "Transactions of the ASABE"
      }
    }
  ],
  "enrichment_summary": {
    "total_references": 104,
    "successfully_enriched": 103,
    "failed": 1,
    "cached": 0,
    "metadata_mismatches": 4,
    "success_rate": "99.0%"
  }
}