{
  "Paper1.pdf": {
    "title": "Novel base predictive model of resilient modulus of compacted subgrade soils by using interpretable approaches with graphical user interface",
    "authors": [
      "Loai Alkhattabi",
      "Kiran Arif"
    ],
    "abstract": "The flexible pavement system consists of layers that are made up of a blend of aggregates and bitumen. To design flexible pavement systems that are both safe and environmentally sustainable, it is essential to have an accurate understanding of the resilient modulus (Mr) of the compacted subgrade soil. Mr refers to the ability of the soil to resist deformation under repeated loads. Thus, a critical parameter affects the performance and longevity of pavement systems. This study employs machine learning (ML) algorithms such as individual and ensemble learners using an extensive database of 2813 data points. These include dry unit weight, weighted plasticity index, confining stress, deviator stress, moisture content, and the number of freeze-thaw cycles (FT). The indi- vidual or weak learners were incorporated to create strong and robust ensemble learners by employing tech- niques such as bagging, adaptive boosting, and random forest (RF). Ensemble learning methods were used to improve the performance of individual learners, such as support vector machine (SVM) and decision tree (DT), by combining their predictions. To achieve the highest R2 value, a total of twenty bagging and boosting sub- models were trained and optimized. The validation of the test data was carried out through K-Fold cross- validation, utilizing metrics such as R2, MAE, and RMSE. The developed models were rigorously tested using statistical indices (MAE, MSE, RMSE, and RMLSE) to verify their predictive accuracy, reliability, and trustwor- thiness. The findings indicate that the integration of bagging and boosting techniques improves the efficiency of individual machine learning (ML) models. The combination of RF and DT utilizing bagging resulted in the most reliable performance, achieving an R2 value of 0.9 and demonstrating minimum errors. In general, the imple- mentation of the ensemble algorithm in ML improved the overall prediction accuracy of the model. Sensitivity analysis reveals that the prediction of the resilient modulus (Mr) of the subgrade is primarily influenced by dry density, confining stress, and deviator stress. Moreover, a graphical user interface (GUI) is developed for practical implantation.",
    "doi": "https://doi.org/10.1016/j.mtcomm.2024.109764",
    "references": [
      "[1] X. Chu, I. Campos-Guereta, A. Dawson, N. Thom, Sustainable pavement drainage systems: Subgrade moisture, subsurface drainage methods and drainage effectiveness, Constr. Build. Mater. 364 (2023) 129950, https://doi.org/ 10.1016/j.conbuildmat.2022.129950.",
      "[2] A. Hayat, A. Hussain, H.F. Afridi, Determination of in-field temperature variations in fresh HMA and corresponding compaction temperatures, Constr. Build. Mater. 216 (2019) 84–92, https://doi.org/10.1016/j. conbuildmat.2019.04.262.",
      "[3] W. Zhang, K.N. Ahmad, Z. Tong, Z. Hu, H. Wang, M. Wu, K. Zhao, S. Yang, H. Farooq, L.N. Mohammad, In-Time Density Monitoring of In-Place Asphalt Layer Construction via Intelligent Compaction Technology, J. Mater. Civ. Eng. 35 (2023), https://doi.org/10.1061/(asce)mt.1943-5533.0004558.",
      "[4] G. Bilgen, O.F. Altuntas, Sustainable re-use of waste glass, cement and lime treated dredged material as pavement material, Case Stud. Constr. Mater. 18 (2023) e01815, https://doi.org/10.1016/j.cscm.2022.e01815.",
      "[5] H.F. Afridi, M.J. Khattak, Self-Healing Characteristics of Polyvinyl Alcohol-Fiber- Reinforced Hot Mix Asphalt for Enhanced Pavement Durability, Transp. Res. Rec. (2024), https://doi.org/10.1177/03611981241231969.",
      "[6] X. Xie, Y. Gao, F. Hou, T. Cheng, A. Hao, H. Qin, Fluid Inverse Volumetric Modeling and Applications from Surface Motion, IEEE Trans. Vis. Comput. Graph. (2024), https://doi.org/10.1109/TVCG.2024.3370551.",
      "[7] D. Sarker, J.X. Wang, Moisture influence on structural responses of pavement on expansive soils, Transp. Geotech. 35 (2022) 100773, https://doi.org/10.1016/j. trgeo.2022.100773.",
      "[8] Y. Luo, H. Wu, W. Song, J. Yin, Y. Zhan, J. Yu, S. Abubakar Wada, Thermal fatigue and cracking behaviors of asphalt mixtures under different temperature variations, Constr. Build. Mater. 369 (2023) 130623, https://doi.org/10.1016/j. conbuildmat.2023.130623.",
      "[9] Z. Zimar, D. Robert, A. Zhou, F. Giustozzi, S. Setunge, J. Kodikara, Application of coal fly ash in pavement subgrade stabilisation: A review, J. Environ. Manag. 312 (2022) 114926, https://doi.org/10.1016/j.jenvman.2022.114926.",
      "[10] A.R. Gabr, B. Roy, M.R. Kaloop, D. Kumar, A. Arisha, M. Shiha, S. Shwally, J. W. Hu, S.M. El-Badawy, A novel approach for resilient modulus prediction using extreme learning machine-equilibrium optimiser techniques, Int. J. Pavement Eng. 23 (2022) 3346–3356, https://doi.org/10.1080/10298436.2021.1892109.",
      "[11] S. Hao, T. Pabst, Prediction of CBR and resilient modulus of crushed waste rocks using machine learning models, Acta Geotech. 17 (2022) 1383–1402, https://doi. org/10.1007/s11440-022-01472-1.",
      "[12] R. Sarkhani Benemaran, M. Esmaeili-Falak, A. Javadi, Predicting resilient modulus of flexible pavement foundation using extreme gradient boosting based optimised models, Int. J. Pavement Eng. (2022), https://doi.org/10.1080/ 10298436.2022.2095385.",
      "[13] D. Hu, Y. Li, X. Yang, X. Liang, K. Zhang, X. Liang, Experiment and Application of NATM Tunnel Deformation Monitoring Based on 3D Laser Scanning, Struct. Control Heal. Monit. 2023 (2023), https://doi.org/10.1155/2023/3341788.",
      "[14] A. Fouad, R. Hassan, A. Mahmood, Developing Resilient Modulus Prediction Models Based on Experimental Results of Crushed Hornfels Mixes with Different Gradation"
    ]
  },
  "Paper2.pdf": {
    "title": "Machine learning approaches to predict the strength of graphene nanoplatelets concrete: Optimization and hyper tuning with graphical user interface",
    "authors": [
      "Turki S. Alahmari",
      "Kiran Arif"
    ],
    "abstract": "This paper focuses on the need to consider the use of multipurpose cement composite (CC) in the construction industry to give superior performance. Therefore, incorporating nanomaterials (NMs) can improve the performance and characteristics of CC. Hence, the use of graphene nanoplatelets (GNPs) in the composite matrix can be a viable way to address the challenges towards achieving a sustainable, with superior properties. In addition, forecasting the properties of NMs is a challenging task due to nature of ambiguity between parameters, complex nature, and non-linear response to strength. In addition, strength evaluation is time consuming process. Thus, there is a needs for predictive models to estimate strength of NMs. This study employee four machine learning (ML) approaches namely as light gradient boosting (LGB), artificial neural network (ANN), gradient boosting (GB), and k-nearest neighbor (KNN) with hyper-tuning, and optimization. In addition, model evaluation is judge by statistical measures, uncertainty analysis, and tenfold approach is applied for validation of the model. Moreover, graphical user interface (GUI) is developed for practical implementation to estimate strength. The result reveals that XGB, and ANN model shows robust analysis with greater R2 > 0.90 for both train and test sets with XGB perform better as compared to ANN and other models. XGB depicts lesser statistical index, and uncertainty analysis demonstrates all model with less level of ambiguity for train and test set. The train and test set for XGB, LGB, KNN, and ANN models demonstrate 7.668 %, 8.9 %, 8.9 %, 17.18 %, 9.85 %, 20.61, and 5 %, 14.74 %, respectively. Shapley analysis reveals that GNP thickness, diameter and curing have major contribution to strength.",
    "doi": "https://doi.org/10.1016/j.mtcomm.2024.109946",
    "references": [
      "[1] H. Lin, Y. Han, S. Liang, F. Gong, S. Han, C. Shi, P. Feng, Effects of low temperatures and cryogenic freeze-thaw cycles on concrete mechanical properties: a literature review, Constr. Build. Mater. 345 (2022), https://doi.org/ 10.1016/j.conbuildmat.2022.128287.",
      "[2] Z. Liu, Z. Xu, X. Zheng, Y. Zhao, J. Wang, 3D path planning in threat environment based on fuzzy logic, J. Intell. Fuzzy Syst. 46 (2024) 7021–7034, https://doi.org/ 10.3233/JIFS-232076.",
      "[3] R. Rakesh Kumar Reddy, S.C. Yaragal, V.K. Sanjay, Processing of laboratory concrete demolition waste using ball mill, Mater. Today Proc. (2023), https:// doi.org/10.1016/j.matpr.2023.03.193.",
      "[4] J. Bernal, M. Fenaux, A. Moragues, E. Reyes, J.C. G´alvez, Study of chloride penetration in concretes exposed to high-mountain weather conditions with presence of deicing salts, Constr. Build. Mater. 127 (2016) 971–983, https://doi. org/10.1016/j.conbuildmat.2016.09.148.",
      "[5] J. Wei, H. Ying, Y. Yang, W. Zhang, H. Yuan, J. Zhou, Seismic performance of concrete-filled steel tubular composite columns with ultra high performance concrete plates, Eng. Struct. 278 (2023), https://doi.org/10.1016/j. engstruct.2022.115500.",
      "[6] L. Sun, C. Wang, C. Zhang, Z. Yang, C. Li, P. Qiao, Experimental investigation on the bond performance of sea sand coral concrete with FRP bar reinforcement for marine environments, Adv. Struct. Eng. (2022), https://doi.org/10.1177/ 13694332221131153.",
      "[7] A. Akbar, F. Farooq, M. Shafique, F. Aslam, R. Alyousef, H. Alabduljabbar, Sugarcane bagasse ash-based engineered geopolymer mortar incorporating propylene fibers, J. Build. Eng. 33 (2021) 101492, https://doi.org/10.1016/j. jobe.2020.101492.",
      "[8] F. Farooq, W. Ahmed, A. Akbar, F. Aslam, R. Alyousef, Predictive modeling for sustainable high-performance concrete from industrial wastes: a comparison and optimization of models using ensemble learners, J. Clean. Prod. 292 (2021) 126032, https://doi.org/10.1016/j.jclepro.2021.126032.",
      "[9] H. He, E. Shuang, D. Lu, Y. Hu, C. Yan, H. Shan, C. He, Deciphering size-induced influence of carbon dots on mechanical performance of cement composites, Constr. Build. Mater. 425 (2024), https://doi.org/10.1016/j. conbuildmat.2024.136030.",
      "[10] C. Chen, D. Han, C.C. Chang, MPCCT: multimodal vision-language learning paradigm with context-based compact Transformer, Pattern Recognit. 147 (2024), https://doi.org/10.1016/j.patcog.2023.110084.",
      "[11] M.L. Nehdi, A. Marani, L. Zhang, Is net-zero feasible: systematic review of cement and concrete decarbonization technologies, Renew. Sustain. Energy Rev. 191 (2024) 114169, https://doi.org/10.1016/j.rser.2023.114169.",
      "[12] B. Joshi, P. Sudhakaran, M. Varma, A. Saxena, Partial replacement of cement and fine aggregate in mortar material by using carbon sequestration technique, Mater. Today Proc. (2023), https://doi.org/10.1016/j.matpr.2023.03.649.",
      "[13] J. Chen, Y. Ji, Y. Xu, G. Wang, K. Hu, Experimental investigation of behavior of reinforced high-strength concrete walls under standard fire, J. Build. Eng. 87 (2024), https://doi.org/10.1016/j.jobe.2024.109052.",
      "[14] C. Chen, D. Han, X. Shen, CLVIN: Complete language-vision interaction network for visual question answering, Knowl. -Based Syst. 275 (2023), https://doi.org/ 10.1016/j.knosys.2023.110706.",
      "[15] Y.R. Alharbi, A.A. Abadel, O.A. Mayhoub, M. Kohail, Effect of using available metakaoline and nano materials on the behavior of reactive powder concrete, Constr. Build. Mater. 269 (2021) 121344, https://doi.org/10.1016/j. conbuildmat.2020.121344.",
      "[16] M.O. Mohsen, M.M. Al-Diseet, M.O. Aburumman, M. Abdel-Jaber, R. Taha, M. S. Al Ansari, A.A. Taqa, Hybrid effect of GNPs, GOs, and CNTs on the flexural and compressive strengths of ce"
    ]
  }
}